------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/mishat/Desktop/Data/JP/stata/DIMETimeSeries.log
  log type:  text
 opened on:   3 May 2020, 17:22:46

. //few nonlinear transformations have been tried (square and log terms)
. //nIndv and aIndv robust to logarithmic transformations
. //with aIndv, nCorp, count, nIndvTech robust to transformations
. //with nIndv,
. import delimited "/Users/mishat/Desktop/Data/JP/final/dimeTS.csv", case(preserve) numericcols(28 32) 
(33 vars, 21,269 obs)

. drop v1 nGen aGen sdCFCont sdCFDiff

. 
. desc

Contains data
  obs:        21,269                          
 vars:            28                          
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
NAMELSAD        str37   %37s                  
yr              int     %8.0g                 
area            float   %9.0g                 
count           long    %12.0g                
nIndv           long    %8.0g                 
nCorp           int     %8.0g                 
nIndvTech       long    %8.0g                 
nIndvBigTech    int     %8.0g                 
nCorpBigTech    int     %8.0g                 
nDemRec         long    %8.0g                 
nRepRec         long    %8.0g                 
nIndRec         int     %8.0g                 
nComRec         long    %8.0g                 
aTot            float   %9.0g                 
aIndv           float   %9.0g                 
aCorp           float   %9.0g                 
aIndvBigTech    double  %12.0g                
aIndvTech       float   %9.0g                 
aCorpTech       double  %8.0g                 
aDemRec         float   %9.0g                 
aRepRec         float   %9.0g                 
aIndRec         double  %12.0g                
aComRec         float   %9.0g                 
meanCFCont      float   %9.0g                 
meanCFCand      float   %9.0g                 
sdCFCand        float   %9.0g                 
meanCFDiff      float   %9.0g                 
id              int     %8.0g                 
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.

. sum

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    NAMELSAD |          0
          yr |     21,269    2002.254    10.76764       1980       2018
        area |     21,269    11.42607    23.56398       .044     468.67
       count |     21,269    1332.179    12267.28          1     827884
       nIndv |     21,269     1224.78    11685.65          0     816704
-------------+---------------------------------------------------------
       nCorp |     21,269     42.4357    435.5801          0      16809
   nIndvTech |     21,269    150.3424    1470.666          0      90506
nIndvBigTech |     21,269    14.60097    194.2492          0      11875
nCorpBigTech |     21,269    2.392496    46.95092          0       5636
     nDemRec |     21,269    591.5566    6613.792          0     584847
-------------+---------------------------------------------------------
     nRepRec |     21,269    126.1985    745.0427          0      35343
     nIndRec |     21,269    11.57986     200.421          0      19914
     nComRec |     21,269    843.8967    7908.755          0     570116
        aTot |     21,269    814328.7    1.16e+07  -72576.08   7.56e+08
       aIndv |     21,269    363458.2     4948452  -24940.85   2.95e+08
-------------+---------------------------------------------------------
       aCorp |     21,269    141656.5     3011811   -1464.06   3.03e+08
aIndvBigTech |     21,269     3816.03    71307.52   -6361.72    6881128
   aIndvTech |     21,269    48129.05     1757555  -100062.7   2.46e+08
   aCorpTech |     21,269     1700.29    32889.13      -2500    2465865
     aDemRec |     21,269      228371     3169192  -669127.7   1.43e+08
-------------+---------------------------------------------------------
     aRepRec |     21,269      145386     2420804  -110897.7   2.92e+08
     aIndRec |     21,269    29530.88     1229963      -1400   1.32e+08
     aComRec |     21,269    546885.4     8757939     -19394   6.27e+08
  meanCFCont |     21,269    -.112016    .7410495  -3.548571       4.17
  meanCFCand |     21,269   -.0200237    .6127338      -1.96       3.92
-------------+---------------------------------------------------------
    sdCFCand |     21,269   -.0200237    .6127338      -1.96       3.92
  meanCFDiff |     21,269   -.0251369    .1715547       -2.7       3.05
          id |     21,269    602.8063    381.2216          1       1475

. outreg2 using sum1.doc, replace sum(log)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
          yr |     21,269    2002.254    10.76764       1980       2018
        area |     21,269    11.42607    23.56398       .044     468.67
       count |     21,269    1332.179    12267.28          1     827884
       nIndv |     21,269     1224.78    11685.65          0     816704
       nCorp |     21,269     42.4357    435.5801          0      16809
-------------+---------------------------------------------------------
   nIndvTech |     21,269    150.3424    1470.666          0      90506
nIndvBigTech |     21,269    14.60097    194.2492          0      11875
nCorpBigTech |     21,269    2.392496    46.95092          0       5636
     nDemRec |     21,269    591.5566    6613.792          0     584847
     nRepRec |     21,269    126.1985    745.0427          0      35343
-------------+---------------------------------------------------------
     nIndRec |     21,269    11.57986     200.421          0      19914
     nComRec |     21,269    843.8967    7908.755          0     570116
        aTot |     21,269    814328.7    1.16e+07  -72576.08   7.56e+08
       aIndv |     21,269    363458.2     4948452  -24940.85   2.95e+08
       aCorp |     21,269    141656.5     3011811   -1464.06   3.03e+08
-------------+---------------------------------------------------------
aIndvBigTech |     21,269     3816.03    71307.52   -6361.72    6881128
   aIndvTech |     21,269    48129.05     1757555  -100062.7   2.46e+08
   aCorpTech |     21,269     1700.29    32889.13      -2500    2465865
     aDemRec |     21,269      228371     3169192  -669127.7   1.43e+08
     aRepRec |     21,269      145386     2420804  -110897.7   2.92e+08
-------------+---------------------------------------------------------
     aIndRec |     21,269    29530.88     1229963      -1400   1.32e+08
     aComRec |     21,269    546885.4     8757939     -19394   6.27e+08
  meanCFCont |     21,269    -.112016    .7410495  -3.548571       4.17
  meanCFCand |     21,269   -.0200237    .6127338      -1.96       3.92
    sdCFCand |     21,269   -.0200237    .6127338      -1.96       3.92
-------------+---------------------------------------------------------
  meanCFDiff |     21,269   -.0251369    .1715547       -2.7       3.05
          id |     21,269    602.8063    381.2216          1       1475

Following variable is string, not included:  
NAMELSAD  
sum1.doc
dir : seeout

. format yr %ty

. xtset id yr
       panel variable:  id (unbalanced)
        time variable:  yr, 1980 to 2018, but with gaps
                delta:  1 year

. 
. gen mIndv = aIndv/nIndv
(242 missing values generated)

. gen mIndvTech = aIndvTech/nIndvTech
(9,446 missing values generated)

. gen mIndvBigTech = aIndvBigTech/nIndvBigTech
(15,626 missing values generated)

. gen mBigTech = aCorpTech/nCorpBigTech
(18,370 missing values generated)

. gen mCorp = aCorp/nCorp
(12,658 missing values generated)

. 
. //Ftests
. mvtest means mIndv mIndvTech mIndvBigTech

Test that all means are the same

          Hotelling T2 =      3.09
   Hotelling F(2,5456) =      1.54
              Prob > F =    0.2138

. mvtest means mCorp mBigTech

Test that all means are the same

          Hotelling T2 =    141.64
   Hotelling F(1,2461) =    141.64
              Prob > F =    0.0000

. //test mIndv=mIndvTech=mIndvBigTech
. //test mCorp=mBigTech
. ttest mCorp=mBigTech

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
   mCorp |   2,462    1951.549    118.6139     5885.45    1718.956    2184.143
mBigTech |   2,462    529.0076    39.84759    1977.179    450.8694    607.1459
---------+--------------------------------------------------------------------
    diff |   2,462    1422.542    119.5279    5930.802    1188.156    1656.927
------------------------------------------------------------------------------
     mean(diff) = mean(mCorp - mBigTech)                          t =  11.9013
 Ho: mean(diff) = 0                              degrees of freedom =     2461

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 1.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 0.0000

. 
. //create time FE
. tab yr, gen(year)

         yr |      Freq.     Percent        Cum.
------------+-----------------------------------
       1980 |        622        2.92        2.92
       1982 |        565        2.66        5.58
       1984 |        603        2.84        8.42
       1986 |        622        2.92       11.34
       1988 |        695        3.27       14.61
       1990 |        776        3.65       18.26
       1992 |        914        4.30       22.55
       1994 |        889        4.18       26.73
       1996 |      1,000        4.70       31.44
       1998 |      1,150        5.41       36.84
       2000 |      1,178        5.54       42.38
       2002 |      1,286        6.05       48.43
       2004 |      1,326        6.23       54.66
       2006 |      1,350        6.35       61.01
       2008 |      1,371        6.45       67.45
       2010 |      1,347        6.33       73.79
       2012 |      1,404        6.60       80.39
       2014 |      1,378        6.48       86.87
       2016 |      1,435        6.75       93.62
       2018 |      1,358        6.38      100.00
------------+-----------------------------------
      Total |     21,269      100.00

. 
. //nCorp nIndvTech nIndvBigTech nCorpBigTech nDemRec nRepRec nIndRec nComRec aTot aCorp aIndvBigTech aIndvTech aCorpTech aDemRec aRepRec aIndRec aComRec aGen meanCFCont meanCFCand sdCFCand meanCFDiff
. //aIndv nIndv
. 
. //dataset1 regressions
. xtreg aIndv aCorp aTot, fe vce(cluster id)

Fixed-effects (within) regression               Number of obs     =     21,269
Group variable: id                              Number of groups  =      1,475

R-sq:                                           Obs per group:
     within  = 0.6592                                         min =          1
     between = 0.7425                                         avg =       14.4
     overall = 0.6896                                         max =         20

                                                F(2,1474)         =      13.46
corr(u_i, Xb)  = 0.0556                         Prob > F          =     0.0000

                                 (Std. Err. adjusted for 1,475 clusters in id)
------------------------------------------------------------------------------
             |               Robust
       aIndv |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       aCorp |  -1.263606   .2444795    -5.17   0.000    -1.743171    -.784041
        aTot |   .5797926   .1317805     4.40   0.000     .3212953    .8382899
       _cons |   70314.54   78089.56     0.90   0.368    -82863.97      223493
-------------+----------------------------------------------------------------
     sigma_u |  1312219.4
     sigma_e |  2369461.6
         rho |  .23471332   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. outreg2 using amountReg1.doc, replace
amountReg1.doc
dir : seeout

.  
. xtreg aIndv aCorp aTot year*, fe vce(cluster id)
note: year20 omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =     21,269
Group variable: id                              Number of groups  =      1,475

R-sq:                                           Obs per group:
     within  = 0.6597                                         min =          1
     between = 0.7420                                         avg =       14.4
     overall = 0.6897                                         max =         20

                                                F(21,1474)        =      37.40
corr(u_i, Xb)  = 0.0585                         Prob > F          =     0.0000

                                 (Std. Err. adjusted for 1,475 clusters in id)
------------------------------------------------------------------------------
             |               Robust
       aIndv |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       aCorp |  -1.261902   .2456684    -5.14   0.000    -1.743799   -.7800048
        aTot |   .5786707   .1324399     4.37   0.000     .3188799    .8384615
       year1 |  -138722.6   65997.57    -2.10   0.036    -268181.8   -9263.463
       year2 |  -148247.1   72045.04    -2.06   0.040    -289568.9   -6925.418
       year3 |  -142458.5   66000.02    -2.16   0.031    -271922.4   -12994.51
       year4 |  -138806.7   62885.85    -2.21   0.027    -262161.9   -15451.38
       year5 |  -112933.2   53446.89    -2.11   0.035    -217773.3   -8093.167
       year6 |  -107182.1   50578.91    -2.12   0.034    -206396.4   -7967.749
       year7 |  -78243.23   35450.48    -2.21   0.027      -147782    -8704.47
       year8 |  -94968.06   41210.03    -2.30   0.021    -175804.6    -14131.5
       year9 |  -67070.19   30403.52    -2.21   0.028      -126709   -7431.412
      year10 |  -36982.08   30139.51    -1.23   0.220    -96102.98    22138.83
      year11 |  -107144.7    41420.6    -2.59   0.010    -188394.3   -25895.07
      year12 |  -57287.58   43696.94    -1.31   0.190    -143002.4    28427.22
      year13 |  -24779.45   54528.42    -0.45   0.650      -131741    82182.13
      year14 |   110442.3   134964.1     0.82   0.413    -154299.9    375184.6
      year15 |   -39372.8   76277.09    -0.52   0.606      -188996    110250.4
      year16 |   49202.68   68108.03     0.72   0.470    -84396.32    182801.7
      year17 |   86098.43   106668.8     0.81   0.420    -123140.4    295337.3
      year18 |   -9483.19   65141.16    -0.15   0.884    -137262.4    118296.1
      year19 |   170481.8    93081.8     1.83   0.067    -12105.15    353068.7
      year20 |          0  (omitted)
       _cons |   93948.98   71183.54     1.32   0.187    -45682.85    233580.8
-------------+----------------------------------------------------------------
     sigma_u |  1314145.8
     sigma_e |  2368975.1
         rho |  .23531461   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. outreg2 using amountReg1.doc, append
amountReg1.doc
dir : seeout

.  
. xtreg aIndv aCorp aTot count nCorp nIndvTech nIndvBigTech nCorpBigTech aIndvBigTech aIndvBigTech aIndvTech aCorpTech year*, fe vce(cluster id)
note: aIndvBigTech omitted because of collinearity
note: year20 omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =     21,269
Group variable: id                              Number of groups  =      1,475

R-sq:                                           Obs per group:
     within  = 0.7825                                         min =          1
     between = 0.8770                                         avg =       14.4
     overall = 0.8119                                         max =         20

                                                F(29,1474)        =     211.67
corr(u_i, Xb)  = 0.2233                         Prob > F          =     0.0000

                                 (Std. Err. adjusted for 1,475 clusters in id)
------------------------------------------------------------------------------
             |               Robust
       aIndv |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       aCorp |  -.7589237   .2333252    -3.25   0.001    -1.216608    -.301239
        aTot |   .4020061   .1065102     3.77   0.000     .1930784    .6109337
       count |   15.76987   39.66329     0.40   0.691    -62.03265    93.57238
       nCorp |   -304.251   2151.617    -0.14   0.888    -4524.809    3916.307
   nIndvTech |   318.2084   287.8033     1.11   0.269    -246.3392     882.756
nIndvBigTech |   1184.929    1243.39     0.95   0.341    -1254.073    3623.932
nCorpBigTech |  -1755.269   1705.111    -1.03   0.303    -5099.972    1589.435
aIndvBigTech |   7.135544   3.408912     2.09   0.037     .4487083    13.82238
aIndvBigTech |          0  (omitted)
   aIndvTech |   .7554387   .1569046     4.81   0.000     .4476586    1.063219
   aCorpTech |  -13.67822   7.997685    -1.71   0.087    -29.36628    2.009833
       year1 |   126889.8     126460     1.00   0.316    -121170.9    374950.5
       year2 |   122686.8   130463.8     0.94   0.347    -133227.6    378601.3
       year3 |   126536.2   127725.8     0.99   0.322    -124007.4    377079.8
       year4 |   134636.4   127048.8     1.06   0.289    -114579.4    383852.2
       year5 |   156416.6   123639.5     1.27   0.206    -86111.45    398944.7
       year6 |   141495.9   117601.5     1.20   0.229    -89188.16      372180
       year7 |   168989.2   114894.2     1.47   0.142    -56384.33    394362.8
       year8 |   151187.8   113741.7     1.33   0.184    -71925.13    374300.6
       year9 |   176117.7   113832.8     1.55   0.122    -47173.94    399409.3
      year10 |   223388.4   117597.6     1.90   0.058    -7288.092    454064.9
      year11 |     170119   137013.7     1.24   0.215    -98643.58    438881.6
      year12 |   191762.1   164851.8     1.16   0.245      -131607    515131.3
      year13 |   237477.2   142605.5     1.67   0.096    -42254.13    517208.5
      year14 |   295953.9   179521.2     1.65   0.099    -56190.36    648098.3
      year15 |   148381.9   143492.7     1.03   0.301    -133089.7    429853.5
      year16 |   109089.6     128578     0.85   0.396    -143125.7      361305
      year17 |   261745.6   155121.9     1.69   0.092    -42537.69    566028.8
      year18 |   150908.3   154904.9     0.97   0.330    -152949.2    454765.8
      year19 |     116126   50699.14     2.29   0.022     16675.84    215576.2
      year20 |          0  (omitted)
       _cons |  -130450.1   103394.3    -1.26   0.207    -333265.8    72365.56
-------------+----------------------------------------------------------------
     sigma_u |  982557.85
     sigma_e |    1894291
         rho |  .21200509   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. outreg2 using amountReg1.doc, append
amountReg1.doc
dir : seeout

.  
. xtreg aIndv aCorp aTot aDemRec aRepRec aIndRec meanCFCand meanCFCont aIndvTech aIndvBigTech aCorpTech count nCorp nIndvTech nIndvBigTech nCorpBigTech nCom nDemRec nRepRec nIndRec year*, fe vce(cluster id)
note: year20 omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =     21,269
Group variable: id                              Number of groups  =      1,475

R-sq:                                           Obs per group:
     within  = 0.8140                                         min =          1
     between = 0.9076                                         avg =       14.4
     overall = 0.8474                                         max =         20

                                                F(38,1474)        =     671.52
corr(u_i, Xb)  = 0.1679                         Prob > F          =     0.0000

                                 (Std. Err. adjusted for 1,475 clusters in id)
------------------------------------------------------------------------------
             |               Robust
       aIndv |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       aCorp |  -.6842504   .2517431    -2.72   0.007    -1.178063   -.1904375
        aTot |   .4102424   .1519237     2.70   0.007     .1122327    .7082521
     aDemRec |   .1611824   .2980952     0.54   0.589    -.4235535    .7459184
     aRepRec |  -.8334617   .5069603    -1.64   0.100    -1.827902    .1609789
     aIndRec |   .1581278   .2477315     0.64   0.523    -.3278161    .6440717
  meanCFCand |  -27591.37   30606.79    -0.90   0.367    -87628.87    32446.13
  meanCFCont |   1417.515   32891.73     0.04   0.966    -63102.06     65937.1
   aIndvTech |   1.697458   .5525278     3.07   0.002      .613634    2.781283
aIndvBigTech |   5.370177   2.451259     2.19   0.029     .5618493     10.1785
   aCorpTech |  -13.30584   7.762166    -1.71   0.087    -28.53191     1.92023
       count |   96.68415   125.1154     0.77   0.440     -148.739    342.1073
       nCorp |  -2839.431   2767.278    -1.03   0.305    -8267.654    2588.792
   nIndvTech |   141.4965   151.8073     0.93   0.351    -156.2849    439.2779
nIndvBigTech |    1583.33   1055.941     1.50   0.134    -487.9778    3654.638
nCorpBigTech |  -1240.768   1628.499    -0.76   0.446    -4435.191    1953.655
     nComRec |  -95.96247   100.7422    -0.95   0.341    -293.5759    101.6509
     nDemRec |  -82.72902   152.0907    -0.54   0.587    -381.0662    215.6082
     nRepRec |   2214.601   1077.891     2.05   0.040     100.2383    4328.964
     nIndRec |  -541.2725   362.8052    -1.49   0.136    -1252.942    170.3971
       year1 |   208498.9   78575.11     2.65   0.008     54367.93    362629.8
       year2 |   231531.1    87622.1     2.64   0.008     59653.79    403408.4
       year3 |   240449.2   89840.28     2.68   0.008      64220.8    416677.6
       year4 |   230487.1   82775.28     2.78   0.005     68117.16      392857
       year5 |   225049.7    81098.1     2.78   0.006     65969.69    384129.6
       year6 |   197254.3   70375.73     2.80   0.005     59207.06    335301.6
       year7 |   171047.4    60080.7     2.85   0.004     53194.66    288900.2
       year8 |   193018.9   68964.34     2.80   0.005     57740.17    328297.6
       year9 |   180935.3   57188.79     3.16   0.002     68755.19    293115.4
      year10 |   150315.3   64707.14     2.32   0.020     23387.39    277243.2
      year11 |     138196   66825.74     2.07   0.039     7112.346    269279.7
      year12 |   144239.3   106955.4     1.35   0.178     -65561.7    354040.3
      year13 |   172332.5   85700.99     2.01   0.045     4223.569    340441.3
      year14 |   223055.5   114679.5     1.95   0.052    -1896.929      448008
      year15 |  -123008.4   123353.4    -1.00   0.319    -364975.3    118958.4
      year16 |  -11987.58   101326.6    -0.12   0.906    -210747.2      186772
      year17 |   10395.98   83123.92     0.13   0.900    -152657.8    173449.8
      year18 |   143547.7   79239.87     1.81   0.070    -11887.25    298982.6
      year19 |  -219506.6   118342.8    -1.85   0.064    -451644.8     12631.6
      year20 |          0  (omitted)
       _cons |    -167145   61355.15    -2.72   0.007    -287497.7   -46792.28
-------------+----------------------------------------------------------------
     sigma_u |  813545.17
     sigma_e |  1752268.8
         rho |  .17733179   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. outreg2 using amountReg1.doc, append
amountReg1.doc
dir : seeout

.  
. 
. xtreg nIndv nCorp, fe vce(cluster id)

Fixed-effects (within) regression               Number of obs     =     21,269
Group variable: id                              Number of groups  =      1,475

R-sq:                                           Obs per group:
     within  = 0.0410                                         min =          1
     between = 0.7038                                         avg =       14.4
     overall = 0.2196                                         max =         20

                                                F(1,1474)         =       7.26
corr(u_i, Xb)  = 0.5118                         Prob > F          =     0.0071

                                 (Std. Err. adjusted for 1,475 clusters in id)
------------------------------------------------------------------------------
             |               Robust
       nIndv |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       nCorp |   6.458108   2.396895     2.69   0.007      1.75642     11.1598
       _cons |   950.7259   101.7139     9.35   0.000     751.2065    1150.245
-------------+----------------------------------------------------------------
     sigma_u |  4439.1381
     sigma_e |  9644.7271
         rho |   .1748117   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. outreg2 using numReg1.doc, replace
numReg1.doc
dir : seeout

.  
. xtreg nIndv nCorp count year*, fe vce(cluster id)
note: year20 omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =     21,269
Group variable: id                              Number of groups  =      1,475

R-sq:                                           Obs per group:
     within  = 0.9997                                         min =          1
     between = 0.9997                                         avg =       14.4
     overall = 0.9996                                         max =         20

                                                F(21,1474)        =  661953.34
corr(u_i, Xb)  = 0.4128                         Prob > F          =     0.0000

                                 (Std. Err. adjusted for 1,475 clusters in id)
------------------------------------------------------------------------------
             |               Robust
       nIndv |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       nCorp |  -2.821994    .210539   -13.40   0.000    -3.234982   -2.409006
       count |    .997048   .0019765   504.46   0.000      .993171    1.000925
       year1 |  -15.36132   9.200771    -1.67   0.095    -33.40932    2.686677
       year2 |  -16.17977     9.3623    -1.73   0.084    -34.54462    2.185078
       year3 |   -16.1229   9.490554    -1.70   0.090    -34.73933    2.493534
       year4 |  -7.845738    9.74791    -0.80   0.421    -26.96699    11.27552
       year5 |  -8.655784   8.524735    -1.02   0.310    -25.37769    8.066119
       year6 |  -6.194119   7.899618    -0.78   0.433    -21.68981    9.301572
       year7 |  -6.191098    7.31451    -0.85   0.397    -20.53906     8.15686
       year8 |  -6.112051   7.451774    -0.82   0.412    -20.72926    8.505161
       year9 |  -5.760077   6.320891    -0.91   0.362    -18.15898    6.638823
      year10 |   12.98361   7.401905     1.75   0.080    -1.535779      27.503
      year11 |   .7243361   8.318398     0.09   0.931    -15.59282     17.0415
      year12 |  -1.759651     11.883    -0.15   0.882    -25.06904    21.54974
      year13 |   1.469834   12.89065     0.11   0.909    -23.81614    26.75581
      year14 |   14.12348    12.3591     1.14   0.253    -10.11982    38.36678
      year15 |   16.78548   15.49141     1.08   0.279    -13.60207    47.17303
      year16 |  -3.979017   12.48765    -0.32   0.750    -28.47448    20.51644
      year17 |   12.63165    13.2768     0.95   0.342    -13.41177    38.67508
      year18 |  -1.307863   9.633271    -0.14   0.892    -20.20424    17.58852
      year19 |   6.042228   3.523669     1.71   0.087    -.8697126    12.95417
      year20 |          0  (omitted)
       _cons |   15.54329   8.013414     1.94   0.053    -.1756231     31.2622
-------------+----------------------------------------------------------------
     sigma_u |  151.21618
     sigma_e |  179.97406
         rho |  .41381788   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. outreg2 using numReg1.doc, append
numReg1.doc
dir : seeout

.  
. xtreg nIndv aCorp aTot count nCorp nIndvTech nIndvBigTech nCorpBigTech aIndvBigTech aIndvBigTech aIndvTech aCorpTech year*, fe vce(cluster id)
note: aIndvBigTech omitted because of collinearity
note: year20 omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =     21,269
Group variable: id                              Number of groups  =      1,475

R-sq:                                           Obs per group:
     within  = 0.9998                                         min =          1
     between = 0.9998                                         avg =       14.4
     overall = 0.9997                                         max =         20

                                                F(29,1474)        =  635425.54
corr(u_i, Xb)  = 0.3723                         Prob > F          =     0.0000

                                 (Std. Err. adjusted for 1,475 clusters in id)
------------------------------------------------------------------------------
             |               Robust
       nIndv |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       aCorp |   1.04e-06   .0000141     0.07   0.941    -.0000266    .0000287
        aTot |  -.0000194   6.52e-06    -2.98   0.003    -.0000322   -6.62e-06
       count |   .9968838   .0027489   362.64   0.000     .9914915    1.002276
       nCorp |  -2.353869   .1670449   -14.09   0.000     -2.68154   -2.026198
   nIndvTech |   .0221817    .019084     1.16   0.245    -.0152531    .0596164
nIndvBigTech |    .113446   .0657699     1.72   0.085    -.0155666    .2424586
nCorpBigTech |  -.0980488   .1359461    -0.72   0.471    -.3647172    .1686197
aIndvBigTech |   .0003812    .000167     2.28   0.023     .0000537    .0007088
aIndvBigTech |          0  (omitted)
   aIndvTech |   .0000239   7.97e-06     3.00   0.003     8.25e-06    .0000395
   aCorpTech |  -.0007721   .0004749    -1.63   0.104    -.0017036    .0001594
       year1 |   3.053877   9.470431     0.32   0.747    -15.52308    21.63083
       year2 |   2.576832   8.967646     0.29   0.774    -15.01388    20.16754
       year3 |   1.624627   8.475729     0.19   0.848    -15.00115     18.2504
       year4 |   8.729381   9.839634     0.89   0.375     -10.5718    28.03056
       year5 |   7.062391   8.861012     0.80   0.426    -10.31915    24.44393
       year6 |   7.578981   8.068716     0.94   0.348    -8.248408    23.40637
       year7 |   6.745573   7.419342     0.91   0.363    -7.808021    21.29917
       year8 |    6.73602   7.690505     0.88   0.381     -8.34948    21.82152
       year9 |    5.77368   6.219506     0.93   0.353    -6.426346    17.97371
      year10 |   15.83104   5.485245     2.89   0.004     5.071318    26.59075
      year11 |   3.738903   6.129397     0.61   0.542    -8.284367    15.76217
      year12 |   -7.26895   6.780824    -1.07   0.284    -20.57004    6.032143
      year13 |   2.402842   8.542555     0.28   0.779    -14.35402     19.1597
      year14 |   17.58673   10.40304     1.69   0.091    -2.819609    37.99307
      year15 |   11.96092   10.08788     1.19   0.236    -7.827205    31.74905
      year16 |  -9.576655   6.369965    -1.50   0.133    -22.07182    2.918507
      year17 |    10.5777   10.46343     1.01   0.312    -9.947094    31.10249
      year18 |  -5.597729   6.407313    -0.87   0.382    -18.16615    6.970694
      year19 |   3.784052   2.403779     1.57   0.116    -.9311409    8.499244
      year20 |          0  (omitted)
       _cons |   1.805457    7.87871     0.23   0.819    -13.64922    17.26014
-------------+----------------------------------------------------------------
     sigma_u |  106.69845
     sigma_e |  154.53538
         rho |  .32282203   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. outreg2 using numReg1.doc, append
numReg1.doc
dir : seeout

.  
. xtreg nIndv aTot aCorp aComRec meanCFCand meanCFCont aIndvTech aIndvBigTech aCorpTech count nCorp nIndvTech nIndvBigTech nCorpBigTech nCom nDemRec nRepRec nIndRec year*, fe vce(cluster id)
note: year20 omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =     21,269
Group variable: id                              Number of groups  =      1,475

R-sq:                                           Obs per group:
     within  = 0.9998                                         min =          1
     between = 0.9998                                         avg =       14.4
     overall = 0.9998                                         max =         20

                                                F(36,1474)        =   7.78e+06
corr(u_i, Xb)  = 0.3596                         Prob > F          =     0.0000

                                 (Std. Err. adjusted for 1,475 clusters in id)
------------------------------------------------------------------------------
             |               Robust
       nIndv |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        aTot |  -.0000754   .0000319    -2.36   0.018     -.000138   -.0000128
       aCorp |  -5.02e-06   8.05e-06    -0.62   0.533    -.0000208    .0000108
     aComRec |   .0000651   .0000326     2.00   0.046     1.10e-06    .0001291
  meanCFCand |   4.278657   1.858371     2.30   0.021     .6333238     7.92399
  meanCFCont |  -2.389588   1.887333    -1.27   0.206    -6.091732    1.312556
   aIndvTech |   .0000496   .0000187     2.64   0.008     .0000128    .0000863
aIndvBigTech |   .0003964   .0001306     3.03   0.002     .0001402    .0006526
   aCorpTech |  -.0007406   .0004511    -1.64   0.101    -.0016254    .0001442
       count |   1.016794   .0143325    70.94   0.000     .9886795    1.044908
       nCorp |  -2.296685   .1894708   -12.12   0.000    -2.668346   -1.925024
   nIndvTech |   .0065723    .008313     0.79   0.429    -.0097343    .0228789
nIndvBigTech |   .0932553   .0482021     1.93   0.053    -.0012967    .1878073
nCorpBigTech |  -.0516993   .0846397    -0.61   0.541    -.2177264    .1143279
     nComRec |  -.0205406   .0131859    -1.56   0.120    -.0464058    .0053245
     nDemRec |  -.0094249   .0134516    -0.70   0.484    -.0358113    .0169615
     nRepRec |   .1039047   .0542769     1.91   0.056    -.0025635    .2103729
     nIndRec |  -.0348638   .0136054    -2.56   0.010    -.0615519   -.0081757
       year1 |   2.091957   7.788527     0.27   0.788    -13.18582    17.36973
       year2 |   2.616737   7.457438     0.35   0.726    -12.01158    17.24506
       year3 |   1.347105   7.247641     0.19   0.853    -12.86968    15.56389
       year4 |   7.088564   8.151996     0.87   0.385    -8.902186    23.07931
       year5 |   4.953689   7.472681     0.66   0.507    -9.704533    19.61191
       year6 |   4.579786   6.796518     0.67   0.501    -8.752092    17.91166
       year7 |   2.147537   6.667604     0.32   0.747    -10.93147    15.22654
       year8 |   4.103034   6.873904     0.60   0.551    -9.380642    17.58671
       year9 |  -.9594955   5.219543    -0.18   0.854    -11.19802    9.279027
      year10 |   10.13911   6.112101     1.66   0.097    -1.850237    22.12845
      year11 |   -3.47674   6.807312    -0.51   0.610    -16.82979    9.876312
      year12 |   -13.3115   6.963776    -1.91   0.056    -26.97147    .3484692
      year13 |  -10.19497   6.553753    -1.56   0.120    -23.05065    2.660701
      year14 |   2.981865   8.033914     0.37   0.711    -12.77726    18.74099
      year15 |  -12.70709   5.400836    -2.35   0.019    -23.30124   -2.112948
      year16 |  -22.02857   5.872748    -3.75   0.000    -33.54841   -10.50874
      year17 |  -7.135402    4.89813    -1.46   0.145    -16.74345    2.472645
      year18 |  -8.792757   5.398109    -1.63   0.104    -19.38155    1.796037
      year19 |  -21.59114   9.260184    -2.33   0.020    -39.75568   -3.426597
      year20 |          0  (omitted)
       _cons |   4.033544   6.003364     0.67   0.502    -7.742502    15.80959
-------------+----------------------------------------------------------------
     sigma_u |  91.916355
     sigma_e |  139.33973
         rho |  .30320709   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. outreg2 using numReg1.doc, append
numReg1.doc
dir : seeout

.  
. 
. clear

. 
. 
. import delimited "/Users/mishat/Desktop/Data/JP/final/dimeVoteTS.csv", case(preserve) numericcols(28 32) 
(35 vars, 12,223 obs)

. drop v1 nGen aGen sdCFCont sdCFDiff

. desc

Contains data
  obs:        12,223                          
 vars:            30                          
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
NAMELSAD        str37   %37s                  
yr              int     %8.0g                 
area            float   %9.0g                 
count           long    %12.0g                
nIndv           long    %12.0g                
nCorp           int     %8.0g                 
nIndvTech       long    %8.0g                 
nIndvBigTech    int     %8.0g                 
nCorpBigTech    int     %8.0g                 
nDemRec         long    %12.0g                
nRepRec         long    %12.0g                
nIndRec         int     %8.0g                 
nComRec         long    %12.0g                
aTot            float   %9.0g                 
aIndv           float   %9.0g                 
aCorp           float   %9.0g                 
aIndvBigTech    float   %9.0g                 
aIndvTech       float   %9.0g                 
aCorpTech       float   %9.0g                 
aDemRec         float   %9.0g                 
aRepRec         float   %9.0g                 
aIndRec         float   %9.0g                 
aComRec         float   %9.0g                 
meanCFCont      float   %9.0g                 
meanCFCand      float   %9.0g                 
sdCFCand        float   %9.0g                 
meanCFDiff      float   %9.0g                 
vReg            long    %12.0g                
vTurn           long    %12.0g                
id              int     %8.0g                 
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.

. sum

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    NAMELSAD |          0
          yr |     12,223    2010.119    5.136702       2002       2018
        area |     12,223     10.2959    21.49256       .044     468.67
       count |     12,223    2194.038    16083.18          1     827884
       nIndv |     12,223    2037.274    15339.96          0     816704
-------------+---------------------------------------------------------
       nCorp |     12,223    59.10807     547.688          0      16809
   nIndvTech |     12,223    256.0145    1930.991          0      90506
nIndvBigTech |     12,223    25.01726     255.704          0      11875
nCorpBigTech |     12,223    3.925877    61.73071          0       5636
     nDemRec |     12,223    986.2491     8689.26          0     584847
-------------+---------------------------------------------------------
     nRepRec |     12,223    178.8479    935.9405          0      35343
     nIndRec |     12,223    19.52802    264.0228          0      19914
     nComRec |     12,223    1425.943    10386.16          0     570116
        aTot |     12,223     1272958    1.52e+07  -72576.08   7.56e+08
       aIndv |     12,223    559560.9     6433125  -24940.85   2.95e+08
-------------+---------------------------------------------------------
       aCorp |     12,223    223780.1     3952923   -1464.06   3.03e+08
aIndvBigTech |     12,223    6346.427     93853.3   -6361.72    6881128
   aIndvTech |     12,223    79056.32     2316131  -100062.7   2.46e+08
   aCorpTech |     12,223    2659.065    42293.65    -533.33    2465865
     aDemRec |     12,223    346422.1     4015534  -669127.7   1.43e+08
-------------+---------------------------------------------------------
     aRepRec |     12,223    218605.6     3173784  -110897.7   2.92e+08
     aIndRec |     12,223     51000.7     1622133      -1400   1.32e+08
     aComRec |     12,223    882897.4    1.15e+07   -2840.53   6.27e+08
  meanCFCont |     12,223   -.4101356    .7194954  -3.548571       4.17
  meanCFCand |     12,223   -.2458437    .5863144      -1.96       3.92
-------------+---------------------------------------------------------
    sdCFCand |     12,223   -.2458437    .5863144      -1.96       3.92
  meanCFDiff |     12,223   -.0419981    .1335222       -2.7       1.85
        vReg |     12,223    537258.8     1592375       1020   8.78e+07
       vTurn |     12,223    344818.1    987194.8        693   5.52e+07
          id |     12,223    695.4926    403.1826          1       1474

. xtset id yr
       panel variable:  id (unbalanced)
        time variable:  yr, 2002 to 2018, but with gaps
                delta:  1 unit

. tab yr, gen(year)

         yr |      Freq.     Percent        Cum.
------------+-----------------------------------
       2002 |      1,283       10.50       10.50
       2004 |      1,323       10.82       21.32
       2006 |      1,342       10.98       32.30
       2008 |      1,363       11.15       43.45
       2010 |      1,345       11.00       54.45
       2012 |      1,402       11.47       65.92
       2014 |      1,376       11.26       77.18
       2016 |      1,433       11.72       88.91
       2018 |      1,356       11.09      100.00
------------+-----------------------------------
      Total |     12,223      100.00

. //ys are vTurn, vReg, turnoutR (also aIndv and nIndv but we have higher-power regressions earlier)
. //no need to repeat on the subset 2006-2018
. //the turnout and registration data looks too strange to include in any fractions 
. gen turnoutR = vTurn/vReg

. sum

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    NAMELSAD |          0
          yr |     12,223    2010.119    5.136702       2002       2018
        area |     12,223     10.2959    21.49256       .044     468.67
       count |     12,223    2194.038    16083.18          1     827884
       nIndv |     12,223    2037.274    15339.96          0     816704
-------------+---------------------------------------------------------
       nCorp |     12,223    59.10807     547.688          0      16809
   nIndvTech |     12,223    256.0145    1930.991          0      90506
nIndvBigTech |     12,223    25.01726     255.704          0      11875
nCorpBigTech |     12,223    3.925877    61.73071          0       5636
     nDemRec |     12,223    986.2491     8689.26          0     584847
-------------+---------------------------------------------------------
     nRepRec |     12,223    178.8479    935.9405          0      35343
     nIndRec |     12,223    19.52802    264.0228          0      19914
     nComRec |     12,223    1425.943    10386.16          0     570116
        aTot |     12,223     1272958    1.52e+07  -72576.08   7.56e+08
       aIndv |     12,223    559560.9     6433125  -24940.85   2.95e+08
-------------+---------------------------------------------------------
       aCorp |     12,223    223780.1     3952923   -1464.06   3.03e+08
aIndvBigTech |     12,223    6346.427     93853.3   -6361.72    6881128
   aIndvTech |     12,223    79056.32     2316131  -100062.7   2.46e+08
   aCorpTech |     12,223    2659.065    42293.65    -533.33    2465865
     aDemRec |     12,223    346422.1     4015534  -669127.7   1.43e+08
-------------+---------------------------------------------------------
     aRepRec |     12,223    218605.6     3173784  -110897.7   2.92e+08
     aIndRec |     12,223     51000.7     1622133      -1400   1.32e+08
     aComRec |     12,223    882897.4    1.15e+07   -2840.53   6.27e+08
  meanCFCont |     12,223   -.4101356    .7194954  -3.548571       4.17
  meanCFCand |     12,223   -.2458437    .5863144      -1.96       3.92
-------------+---------------------------------------------------------
    sdCFCand |     12,223   -.2458437    .5863144      -1.96       3.92
  meanCFDiff |     12,223   -.0419981    .1335222       -2.7       1.85
        vReg |     12,223    537258.8     1592375       1020   8.78e+07
       vTurn |     12,223    344818.1    987194.8        693   5.52e+07
          id |     12,223    695.4926    403.1826          1       1474
-------------+---------------------------------------------------------
       year1 |     12,223     .104966    .3065222          0          1
       year2 |     12,223    .1082386    .3106942          0          1
       year3 |     12,223     .109793    .3126444          0          1
       year4 |     12,223    .1115111    .3147769          0          1
       year5 |     12,223    .1100385    .3129505          0          1
-------------+---------------------------------------------------------
       year6 |     12,223    .1147018    .3186748          0          1
       year7 |     12,223    .1125747    .3160851          0          1
       year8 |     12,223     .117238    .3217168          0          1
       year9 |     12,223    .1109384    .3140687          0          1
    turnoutR |     12,223     .652845    .1625526   .0952381   3.688088

. outreg2 using sum2.doc, replace sum(log)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
          yr |     12,223    2010.119    5.136702       2002       2018
        area |     12,223     10.2959    21.49256       .044     468.67
       count |     12,223    2194.038    16083.18          1     827884
       nIndv |     12,223    2037.274    15339.96          0     816704
       nCorp |     12,223    59.10807     547.688          0      16809
-------------+---------------------------------------------------------
   nIndvTech |     12,223    256.0145    1930.991          0      90506
nIndvBigTech |     12,223    25.01726     255.704          0      11875
nCorpBigTech |     12,223    3.925877    61.73071          0       5636
     nDemRec |     12,223    986.2491     8689.26          0     584847
     nRepRec |     12,223    178.8479    935.9405          0      35343
-------------+---------------------------------------------------------
     nIndRec |     12,223    19.52802    264.0228          0      19914
     nComRec |     12,223    1425.943    10386.16          0     570116
        aTot |     12,223     1272958    1.52e+07  -72576.08   7.56e+08
       aIndv |     12,223    559560.9     6433125  -24940.85   2.95e+08
       aCorp |     12,223    223780.1     3952923   -1464.06   3.03e+08
-------------+---------------------------------------------------------
aIndvBigTech |     12,223    6346.427     93853.3   -6361.72    6881128
   aIndvTech |     12,223    79056.32     2316131  -100062.7   2.46e+08
   aCorpTech |     12,223    2659.065    42293.65    -533.33    2465865
     aDemRec |     12,223    346422.1     4015534  -669127.7   1.43e+08
     aRepRec |     12,223    218605.6     3173784  -110897.7   2.92e+08
-------------+---------------------------------------------------------
     aIndRec |     12,223     51000.7     1622133      -1400   1.32e+08
     aComRec |     12,223    882897.4    1.15e+07   -2840.53   6.27e+08
  meanCFCont |     12,223   -.4101356    .7194954  -3.548571       4.17
  meanCFCand |     12,223   -.2458437    .5863144      -1.96       3.92
    sdCFCand |     12,223   -.2458437    .5863144      -1.96       3.92
-------------+---------------------------------------------------------
  meanCFDiff |     12,223   -.0419981    .1335222       -2.7       1.85
        vReg |     12,223    537258.8     1592375       1020   8.78e+07
       vTurn |     12,223    344818.1    987194.8        693   5.52e+07
          id |     12,223    695.4926    403.1826          1       1474
       year1 |     12,223     .104966    .3065222          0          1
-------------+---------------------------------------------------------
       year2 |     12,223    .1082386    .3106942          0          1
       year3 |     12,223     .109793    .3126444          0          1
       year4 |     12,223    .1115111    .3147769          0          1
       year5 |     12,223    .1100385    .3129505          0          1
       year6 |     12,223    .1147018    .3186748          0          1
-------------+---------------------------------------------------------
       year7 |     12,223    .1125747    .3160851          0          1
       year8 |     12,223     .117238    .3217168          0          1
       year9 |     12,223    .1109384    .3140687          0          1
    turnoutR |     12,223     .652845    .1625526   .0952381   3.688088

Following variable is string, not included:  
NAMELSAD  
sum2.doc
dir : seeout

. 
. /*
> gen logTurn = log(vTurn)
> gen logReg = log(vReg)
> gen logR = log(turnoutR)
> gen logaCorp = log(aCorp)
> gen lognCorp = log(nCorp)
> gen logaCorpTech = log(aCorpTech)
> gen lognCorpBigTech = log(nCorpBigTech)
> gen lognIndvTech = log(nIndvTech)
> gen logaIndvTech = log(aIndvTech)
> gen lognIndvBigTech = log(nIndvBigTech)
> gen logaIndvBigTech = log(aIndvBigTech)
> 
> xtreg vTurn aCorp nCorp nIndvBigTech aIndvBigTech nIndvTech aIndvTech nCorpBigTech aCorpTech year*, fe vce(cluster id)
> xtreg logTurn aCorp nCorp nIndvBigTech aIndvBigTech nIndvTech aIndvTech nCorpBigTech aCorpTech year*, fe vce(cluster id)
> xtreg vTurn logaCorp lognCorp lognIndvBigTech logaIndvBigTech lognIndvTech logaIndvTech lognCorpBigTech logaCorpTech year*, fe vce(cluster id)
> xtreg logTurn logaCorp lognCorp lognIndvBigTech logaIndvBigTech lognIndvTech logaIndvTech lognCorpBigTech logaCorpTech year*, fe vce(cluster id)
> 
> xtreg turnoutR aCorp nCorp nIndvBigTech aIndvBigTech nIndvTech aIndvTech nCorpBigTech aCorpTech year*, fe vce(cluster id)
> xtreg logR aCorp nCorp nIndvBigTech aIndvBigTech nIndvTech aIndvTech nCorpBigTech aCorpTech year*, fe vce(cluster id)
> xtreg turnoutR logaCorp lognCorp lognIndvBigTech logaIndvBigTech lognIndvTech logaIndvTech lognCorpBigTech logaCorpTech year*, fe vce(cluster id)
> xtreg logR logaCorp lognCorp lognIndvBigTech logaIndvBigTech lognIndvTech logaIndvTech lognCorpBigTech logaCorpTech year*, fe vce(cluster id) */
. 
. 
. xtreg vReg aCorp, fe vce(cluster id)

Fixed-effects (within) regression               Number of obs     =     12,223
Group variable: id                              Number of groups  =      1,472

R-sq:                                           Obs per group:
     within  = 0.0051                                         min =          1
     between = 0.2622                                         avg =        8.3
     overall = 0.0759                                         max =          9

                                                F(1,1471)         =      10.00
corr(u_i, Xb)  = -0.3918                        Prob > F          =     0.0016

                                 (Std. Err. adjusted for 1,472 clusters in id)
------------------------------------------------------------------------------
             |               Robust
        vReg |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       aCorp |  -.0231359    .007318    -3.16   0.002    -.0374908   -.0087811
       _cons |   542436.1   1637.623   331.23   0.000     539223.8    545648.5
-------------+----------------------------------------------------------------
     sigma_u |  1304751.3
     sigma_e |  949978.99
         rho |  .65354437   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. outreg2 using regReg2.doc, replace
regReg2.doc
dir : seeout

.  
. xtreg vReg nCorp, fe vce(cluster id)

Fixed-effects (within) regression               Number of obs     =     12,223
Group variable: id                              Number of groups  =      1,472

R-sq:                                           Obs per group:
     within  = 0.0056                                         min =          1
     between = 0.4993                                         avg =        8.3
     overall = 0.2622                                         max =          9

                                                F(1,1471)         =       5.70
corr(u_i, Xb)  = -0.6837                        Prob > F          =     0.0171

                                 (Std. Err. adjusted for 1,472 clusters in id)
------------------------------------------------------------------------------
             |               Robust
        vReg |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       nCorp |  -286.8794   120.1395    -2.39   0.017    -522.5424    -51.2163
       _cons |   554215.7   7101.216    78.05   0.000     540286.1    568145.3
-------------+----------------------------------------------------------------
     sigma_u |  1371478.4
     sigma_e |  949757.73
         rho |  .67587422   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. outreg2 using regReg2.doc, append
regReg2.doc
dir : seeout

.  
. xtreg vReg aCorp nCorp aTot count year*, fe vce(cluster id)
note: year9 omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =     12,223
Group variable: id                              Number of groups  =      1,472

R-sq:                                           Obs per group:
     within  = 0.1275                                         min =          1
     between = 0.6540                                         avg =        8.3
     overall = 0.2429                                         max =          9

                                                F(12,1471)        =      46.91
corr(u_i, Xb)  = -0.7951                        Prob > F          =     0.0000

                                 (Std. Err. adjusted for 1,472 clusters in id)
------------------------------------------------------------------------------
             |               Robust
        vReg |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       aCorp |  -.0111473   .0167227    -0.67   0.505    -.0439502    .0216557
       nCorp |  -685.8773   424.7017    -1.61   0.107    -1518.963    147.2081
        aTot |   .0061279   .0061879     0.99   0.322    -.0060102    .0182659
       count |  -23.17451   7.150326    -3.24   0.001    -37.20043   -9.148586
       year1 |    -260521   19489.38   -13.37   0.000    -298750.9   -222291.1
       year2 |   692668.9    67432.5    10.27   0.000     560394.8    824943.1
       year3 |  -194949.2   19004.93   -10.26   0.000    -232228.8   -157669.5
       year4 |  -148347.9   19038.69    -7.79   0.000    -185693.8     -111002
       year5 |  -136368.5   15829.32    -8.61   0.000    -167418.9     -105318
       year6 |  -103539.5   25935.65    -3.99   0.000    -154414.3   -52664.66
       year7 |  -112847.9   20190.33    -5.59   0.000    -152452.9   -73243.05
       year8 |   14751.69   17210.28     0.86   0.392    -19007.62       48511
       year9 |          0  (omitted)
       _cons |   651514.6    27340.5    23.83   0.000     597884.1    705145.1
-------------+----------------------------------------------------------------
     sigma_u |  1757529.3
     sigma_e |  890065.82
         rho |  .79587958   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. outreg2 using regReg2.doc, append
regReg2.doc
dir : seeout

.  
. xtreg vReg aCorp nCorp aTot count nIndvBigTech aIndvBigTech nIndvTech aIndvTech nCorpBigTech aCorpTech year*, fe vce(cluster id)
note: year9 omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =     12,223
Group variable: id                              Number of groups  =      1,472

R-sq:                                           Obs per group:
     within  = 0.1432                                         min =          1
     between = 0.6571                                         avg =        8.3
     overall = 0.2408                                         max =          9

                                                F(18,1471)        =      34.12
corr(u_i, Xb)  = -0.8013                        Prob > F          =     0.0000

                                 (Std. Err. adjusted for 1,472 clusters in id)
------------------------------------------------------------------------------
             |               Robust
        vReg |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       aCorp |  -.0247595   .0183167    -1.35   0.177    -.0606892    .0111702
       nCorp |  -929.2145   494.7065    -1.88   0.061     -1899.62    41.19081
        aTot |   .0142175   .0076089     1.87   0.062     -.000708     .029143
       count |  -22.12507   6.994543    -3.16   0.002    -35.84541   -8.404729
nIndvBigTech |    96.3441   166.9826     0.58   0.564    -231.2052    423.8934
aIndvBigTech |  -.0985881   .1467058    -0.67   0.502    -.3863631    .1891868
   nIndvTech |  -43.54697   49.94462    -0.87   0.383    -141.5172    54.42329
   aIndvTech |  -.0232489   .0156975    -1.48   0.139    -.0540408    .0075431
nCorpBigTech |  -107.5906   199.6365    -0.54   0.590    -499.1931    284.0119
   aCorpTech |    3.38413   2.773344     1.22   0.223    -2.056001    8.824261
       year1 |  -262970.7   20659.25   -12.73   0.000    -303495.4     -222446
       year2 |   686904.1   63717.65    10.78   0.000       561917    811891.2
       year3 |  -192663.7   18377.53   -10.48   0.000    -228712.7   -156614.7
       year4 |  -145019.6   18211.07    -7.96   0.000    -180742.1   -109297.2
       year5 |  -130685.9   14293.86    -9.14   0.000    -158724.5   -102647.4
       year6 |  -105728.1   24193.85    -4.37   0.000    -153186.2   -58270.01
       year7 |  -113567.5    18265.9    -6.22   0.000    -149397.4   -77737.46
       year8 |   8704.804    14200.5     0.61   0.540    -19150.59     36560.2
       year9 |          0  (omitted)
       _cons |   659644.2   28343.53    23.27   0.000     604046.1    715242.2
-------------+----------------------------------------------------------------
     sigma_u |  1794584.8
     sigma_e |  882304.77
         rho |  .80533573   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. outreg2 using regReg2.doc, append
regReg2.doc
dir : seeout

.  
. xtreg vReg nCorp nIndvTech nIndvBigTech nCorpBigTech count nDemRec nRepRec nComRec aTot aCorp aIndvBigTech aIndvTech aCorpTech aDemRec aRepRec aComRec meanCFCont meanCFDiff year*, fe vce(cluster id)
note: year9 omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =     12,223
Group variable: id                              Number of groups  =      1,472

R-sq:                                           Obs per group:
     within  = 0.1698                                         min =          1
     between = 0.8017                                         avg =        8.3
     overall = 0.2407                                         max =          9

                                                F(26,1471)        =      52.75
corr(u_i, Xb)  = -0.7896                        Prob > F          =     0.0000

                                 (Std. Err. adjusted for 1,472 clusters in id)
------------------------------------------------------------------------------
             |               Robust
        vReg |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       nCorp |  -127.5335   408.2721    -0.31   0.755    -928.3911    673.3242
   nIndvTech |  -46.45474   36.54198    -1.27   0.204    -118.1347     25.2252
nIndvBigTech |    -1.3943   135.4833    -0.01   0.992    -267.1555    264.3669
nCorpBigTech |   -236.194    188.112    -1.26   0.209    -605.1904    132.8024
       count |   101.5629   41.83946     2.43   0.015     19.49153    183.6343
     nDemRec |  -69.54915   28.98256    -2.40   0.017    -126.4007    -12.6976
     nRepRec |  -605.4667   195.6365    -3.09   0.002    -989.2229   -221.7105
     nComRec |    -105.33   41.35452    -2.55   0.011    -186.4501   -24.20989
        aTot |   .0607532   .0982878     0.62   0.537     -.132046    .2535524
       aCorp |   -.037428   .0204517    -1.83   0.067    -.0775457    .0026896
aIndvBigTech |  -.0688933   .1287996    -0.53   0.593    -.3215437    .1837571
   aIndvTech |  -.0267207   .1043889    -0.26   0.798    -.2314877    .1780462
   aCorpTech |   3.385222   3.052143     1.11   0.268    -2.601794    9.372239
     aDemRec |   -.081853   .1086033    -0.75   0.451    -.2948868    .1311807
     aRepRec |  -.0282306    .032676    -0.86   0.388    -.0923271    .0358659
     aComRec |  -.0365622    .096943    -0.38   0.706    -.2267235    .1535991
  meanCFCont |   16077.64   6386.059     2.52   0.012     3550.883    28604.39
  meanCFDiff |  -51457.01   20463.26    -2.51   0.012    -91597.29   -11316.74
       year1 |  -293632.1   29888.47    -9.82   0.000    -352260.7   -235003.6
       year2 |   662281.2   55232.11    11.99   0.000     553939.1    770623.3
       year3 |  -194714.3   15854.27   -12.28   0.000    -225813.7   -163614.9
       year4 |  -117705.7   14251.48    -8.26   0.000    -145661.1   -89750.33
       year5 |  -117408.4   14139.47    -8.30   0.000    -145144.1   -89672.72
       year6 |   -68039.7   21944.37    -3.10   0.002    -111085.3   -24994.11
       year7 |  -86420.63   15952.49    -5.42   0.000    -117712.7   -55128.58
       year8 |   50818.75   20184.72     2.52   0.012     11224.86    90412.64
       year9 |          0  (omitted)
       _cons |   675856.9   31544.96    21.43   0.000       613979    737734.8
-------------+----------------------------------------------------------------
     sigma_u |  1765736.8
     sigma_e |  868811.29
         rho |  .80508665   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. outreg2 using regReg2.doc, append
regReg2.doc
dir : seeout

.  
. 
. xtreg vTurn aCorp, fe vce(cluster id)

Fixed-effects (within) regression               Number of obs     =     12,223
Group variable: id                              Number of groups  =      1,472

R-sq:                                           Obs per group:
     within  = 0.0091                                         min =          1
     between = 0.2550                                         avg =        8.3
     overall = 0.0607                                         max =          9

                                                F(1,1471)         =       5.24
corr(u_i, Xb)  = -0.3994                        Prob > F          =     0.0222

                                 (Std. Err. adjusted for 1,472 clusters in id)
------------------------------------------------------------------------------
             |               Robust
       vTurn |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       aCorp |  -.0207855   .0090802    -2.29   0.022     -.038597    -.002974
       _cons |   349469.4   2031.965   171.99   0.000     345483.6    353455.3
-------------+----------------------------------------------------------------
     sigma_u |  786165.32
     sigma_e |  637321.17
         rho |  .60343222   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. outreg2 using turnReg2.doc, replace
turnReg2.doc
dir : seeout

.  
. xtreg vTurn nCorp, fe vce(cluster id)

Fixed-effects (within) regression               Number of obs     =     12,223
Group variable: id                              Number of groups  =      1,472

R-sq:                                           Obs per group:
     within  = 0.0138                                         min =          1
     between = 0.4915                                         avg =        8.3
     overall = 0.2246                                         max =          9

                                                F(1,1471)         =       8.82
corr(u_i, Xb)  = -0.7078                        Prob > F          =     0.0030

                                 (Std. Err. adjusted for 1,472 clusters in id)
------------------------------------------------------------------------------
             |               Robust
       vTurn |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       nCorp |  -303.0047   102.0048    -2.97   0.003    -503.0951   -102.9143
       _cons |   362728.1   6029.308    60.16   0.000     350901.1    374555.1
-------------+----------------------------------------------------------------
     sigma_u |  863542.38
     sigma_e |  635828.66
         rho |   .6484488   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. outreg2 using turnReg2.doc, append
turnReg2.doc
dir : seeout

.  
. xtreg vTurn aCorp nCorp aTot count year*, fe vce(cluster id)
note: year9 omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =     12,223
Group variable: id                              Number of groups  =      1,472

R-sq:                                           Obs per group:
     within  = 0.1279                                         min =          1
     between = 0.6034                                         avg =        8.3
     overall = 0.1392                                         max =          9

                                                F(12,1471)        =      55.64
corr(u_i, Xb)  = -0.7117                        Prob > F          =     0.0000

                                 (Std. Err. adjusted for 1,472 clusters in id)
------------------------------------------------------------------------------
             |               Robust
       vTurn |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       aCorp |  -.0131658   .0063139    -2.09   0.037    -.0255509   -.0007806
       nCorp |  -436.6099   200.7533    -2.17   0.030    -830.4032   -42.81662
        aTot |   .0049059   .0043694     1.12   0.262    -.0036651    .0134769
       count |  -8.674699   3.095722    -2.80   0.005     -14.7472   -2.602199
       year1 |  -231024.1   14221.17   -16.25   0.000      -258920   -203128.2
       year2 |   473628.7   44620.03    10.61   0.000     386103.1    561154.4
       year3 |  -176694.9   11769.79   -15.01   0.000    -199782.3   -153607.6
       year4 |  -32528.49   12664.27    -2.57   0.010    -57370.43   -7686.538
       year5 |  -100625.3   8780.429   -11.46   0.000    -117848.8   -83401.82
       year6 |   -36561.9   15172.84    -2.41   0.016    -66324.61   -6799.191
       year7 |  -161043.7   10128.62   -15.90   0.000    -180911.8   -141175.6
       year8 |    58419.3   10606.14     5.51   0.000     37614.53    79224.07
       year9 |          0  (omitted)
       _cons |   408917.9   13005.43    31.44   0.000     383406.7      434429
-------------+----------------------------------------------------------------
     sigma_u |  994115.15
     sigma_e |  598215.06
         rho |  .73415475   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. outreg2 using turnReg2.doc, append
turnReg2.doc
dir : seeout

.  
. xtreg vTurn aCorp nCorp aTot count nIndvBigTech aIndvBigTech nIndvTech aIndvTech nCorpBigTech aCorpTech year*, fe vce(cluster id)
note: year9 omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =     12,223
Group variable: id                              Number of groups  =      1,472

R-sq:                                           Obs per group:
     within  = 0.1410                                         min =          1
     between = 0.6160                                         avg =        8.3
     overall = 0.1483                                         max =          9

                                                F(18,1471)        =      38.94
corr(u_i, Xb)  = -0.7331                        Prob > F          =     0.0000

                                 (Std. Err. adjusted for 1,472 clusters in id)
------------------------------------------------------------------------------
             |               Robust
       vTurn |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       aCorp |   -.021947   .0077951    -2.82   0.005    -.0372378   -.0066562
       nCorp |   -605.946   253.8741    -2.39   0.017     -1103.94    -107.952
        aTot |   .0103529   .0049364     2.10   0.036     .0006697    .0200361
       count |  -10.00386   4.155323    -2.41   0.016    -18.15486   -1.852874
nIndvBigTech |  -35.21679   77.41997    -0.45   0.649    -187.0821    116.6485
aIndvBigTech |    .019091   .1439066     0.13   0.894     -.263193     .301375
   nIndvTech |  -2.258252   12.86295    -0.18   0.861    -27.48992    22.97342
   aIndvTech |  -.0169546   .0100204    -1.69   0.091    -.0366104    .0027012
nCorpBigTech |  -67.68228   114.5786    -0.59   0.555    -292.4372    157.0726
   aCorpTech |   2.142687   1.869592     1.15   0.252    -1.524664    5.810038
       year1 |  -232512.8      14855   -15.65   0.000      -261652   -203373.5
       year2 |   469539.2   42307.84    11.10   0.000       386549    552529.3
       year3 |  -175807.9   11768.52   -14.94   0.000    -198892.7     -152723
       year4 |  -31505.29   12893.88    -2.44   0.015    -56797.65   -6212.929
       year5 |  -98945.88   8104.167   -12.21   0.000    -114842.8   -83048.92
       year6 |  -38977.98   13955.76    -2.79   0.005     -66353.3   -11602.66
       year7 |  -160968.2   9323.707   -17.26   0.000    -179257.4     -142679
       year8 |   54101.99   7991.112     6.77   0.000      38426.8    69777.18
       year9 |          0  (omitted)
       _cons |   415098.4   14027.56    29.59   0.000     387582.3    442614.6
-------------+----------------------------------------------------------------
     sigma_u |  1022648.9
     sigma_e |  593860.02
         rho |  .74781934   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. outreg2 using turnReg2.doc, append
turnReg2.doc
dir : seeout

.  
. xtreg vTurn nCorp nIndvTech nIndvBigTech nCorpBigTech count nDemRec nRepRec nComRec aTot aCorp aIndvBigTech aIndvTech aCorpTech aDemRec aRepRec aIndRec aComRec meanCFDiff year*, fe vce(cluster id)
note: year9 omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =     12,223
Group variable: id                              Number of groups  =      1,472

R-sq:                                           Obs per group:
     within  = 0.1815                                         min =          1
     between = 0.5956                                         avg =        8.3
     overall = 0.0266                                         max =          9

                                                F(26,1471)        =      64.89
corr(u_i, Xb)  = -0.5111                        Prob > F          =     0.0000

                                 (Std. Err. adjusted for 1,472 clusters in id)
------------------------------------------------------------------------------
             |               Robust
       vTurn |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       nCorp |  -416.3621   312.8477    -1.33   0.183    -1030.037    197.3131
   nIndvTech |   -34.0097   12.16687    -2.80   0.005    -57.87596   -10.14344
nIndvBigTech |  -38.34489    78.2481    -0.49   0.624    -191.8346    115.1449
nCorpBigTech |  -117.2576    153.072    -0.77   0.444    -417.5203    183.0051
       count |   122.8701   33.88415     3.63   0.000     56.40371    189.3365
     nDemRec |   -89.7342   26.38314    -3.40   0.001    -141.4868   -37.98162
     nRepRec |  -78.17707   125.6835    -0.62   0.534     -324.715    168.3609
     nComRec |  -114.7704   32.66232    -3.51   0.000    -178.8401   -50.70072
        aTot |   .0348661   .0657243     0.53   0.596    -.0940574    .1637895
       aCorp |  -.0149058   .0167097    -0.89   0.373    -.0476832    .0178716
aIndvBigTech |   -.076516    .075858    -1.01   0.313    -.2253175    .0722854
   aIndvTech |   -.008672   .0640258    -0.14   0.892    -.1342635    .1169196
   aCorpTech |   2.168588   1.989859     1.09   0.276    -1.734676    6.071852
     aDemRec |  -.0527937   .0677505    -0.78   0.436    -.1856916    .0801043
     aRepRec |  -.0225081    .023072    -0.98   0.329    -.0677657    .0227494
     aIndRec |    .012416    .021164     0.59   0.558    -.0290989    .0539309
     aComRec |  -.0238276   .0708439    -0.34   0.737    -.1627933    .1151381
  meanCFDiff |  -25981.83   13890.76    -1.87   0.062    -53229.64    1265.973
       year1 |  -250561.4   20200.44   -12.40   0.000    -290186.1   -210936.7
       year2 |   442545.9   35764.63    12.37   0.000     372390.8      512701
       year3 |  -192970.6   12634.51   -15.27   0.000    -217754.2     -168187
       year4 |  -60383.07      10166    -5.94   0.000    -80324.46   -40441.67
       year5 |  -117259.9   12057.83    -9.72   0.000    -140912.3   -93607.57
       year6 |  -59104.17   14140.29    -4.18   0.000    -86841.45   -31366.88
       year7 |  -131980.1   14533.45    -9.08   0.000    -160488.6   -103471.6
       year8 |   29364.12   14313.28     2.05   0.040     1287.493    57440.74
       year9 |          0  (omitted)
       _cons |   410408.7   20397.48    20.12   0.000     370397.4    450419.9
-------------+----------------------------------------------------------------
     sigma_u |  907315.69
     sigma_e |   579920.2
         rho |  .70996208   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. outreg2 using turnReg2.doc, append
turnReg2.doc
dir : seeout

.  
. 
. xtreg turnoutR aCorp, fe vce(cluster id)

Fixed-effects (within) regression               Number of obs     =     12,223
Group variable: id                              Number of groups  =      1,472

R-sq:                                           Obs per group:
     within  = 0.0005                                         min =          1
     between = 0.0022                                         avg =        8.3
     overall = 0.0010                                         max =          9

                                                F(1,1471)         =       4.07
corr(u_i, Xb)  = 0.0090                         Prob > F          =     0.0437

                                 (Std. Err. adjusted for 1,472 clusters in id)
------------------------------------------------------------------------------
             |               Robust
    turnoutR |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       aCorp |  -1.08e-09   5.33e-10    -2.02   0.044    -2.12e-09   -3.04e-11
       _cons |   .6530857   .0001193  5476.28   0.000     .6528518    .6533196
-------------+----------------------------------------------------------------
     sigma_u |  .09043392
     sigma_e |  .14571253
         rho |  .27807454   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. outreg2 using turnrReg2.doc, replace
turnrReg2.doc
dir : seeout

.  
. xtreg turnoutR nCorp, fe vce(cluster id)

Fixed-effects (within) regression               Number of obs     =     12,223
Group variable: id                              Number of groups  =      1,472

R-sq:                                           Obs per group:
     within  = 0.0011                                         min =          1
     between = 0.0031                                         avg =        8.3
     overall = 0.0015                                         max =          9

                                                F(1,1471)         =      10.08
corr(u_i, Xb)  = -0.0488                        Prob > F          =     0.0015

                                 (Std. Err. adjusted for 1,472 clusters in id)
------------------------------------------------------------------------------
             |               Robust
    turnoutR |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       nCorp |  -.0000195   6.14e-06    -3.17   0.002    -.0000315   -7.45e-06
       _cons |   .6539973    .000363  1801.80   0.000     .6532853    .6547093
-------------+----------------------------------------------------------------
     sigma_u |  .09047964
     sigma_e |  .14566676
         rho |  .27840374   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. outreg2 using turnrReg2.doc, append
turnrReg2.doc
dir : seeout

.  
. xtreg turnoutR aCorp nCorp aTot count year*, fe vce(cluster id)
note: year9 omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =     12,223
Group variable: id                              Number of groups  =      1,472

R-sq:                                           Obs per group:
     within  = 0.6841                                         min =          1
     between = 0.0770                                         avg =        8.3
     overall = 0.4927                                         max =          9

                                                F(11,1471)        =          .
corr(u_i, Xb)  = 0.0045                         Prob > F          =          .

                                 (Std. Err. adjusted for 1,472 clusters in id)
------------------------------------------------------------------------------
             |               Robust
    turnoutR |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       aCorp |  -5.81e-10   3.78e-10    -1.53   0.125    -1.32e-09    1.62e-10
       nCorp |  -1.22e-06   3.85e-06    -0.32   0.751    -8.78e-06    6.33e-06
        aTot |   1.71e-10   1.16e-10     1.47   0.140    -5.65e-11    3.99e-10
       count |   1.80e-07   1.25e-07     1.44   0.151    -6.56e-08    4.26e-07
       year1 |  -.1901247   .0032503   -58.49   0.000    -.1965004   -.1837489
       year2 |   .0143188   .0048926     2.93   0.003     .0047217     .023916
       year3 |  -.1405284   .0035185   -39.94   0.000    -.1474302   -.1336266
       year4 |   .1318295   .0020507    64.28   0.000     .1278068    .1358521
       year5 |  -.0316176   .0016443   -19.23   0.000     -.034843   -.0283923
       year6 |   .0729489   .0015209    47.96   0.000     .0699654    .0759323
       year7 |  -.1781213    .001996   -89.24   0.000    -.1820367    -.174206
       year8 |   .1002471   .0012705    78.90   0.000     .0977548    .1027393
       year9 |          0  (omitted)
       _cons |   .6749803   .0015371   439.13   0.000     .6719652    .6779955
-------------+----------------------------------------------------------------
     sigma_u |  .08703534
     sigma_e |  .08196449
         rho |  .52997803   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. outreg2 using turnrReg2.doc, append
turnrReg2.doc
dir : seeout

.  
. xtreg turnoutR aCorp nCorp aTot count nIndvBigTech aIndvBigTech nIndvTech aIndvTech nCorpBigTech aCorpTech year*, fe vce(cluster id)
note: year9 omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =     12,223
Group variable: id                              Number of groups  =      1,472

R-sq:                                           Obs per group:
     within  = 0.6841                                         min =          1
     between = 0.0767                                         avg =        8.3
     overall = 0.4926                                         max =          9

                                                F(15,1471)        =          .
corr(u_i, Xb)  = 0.0043                         Prob > F          =          .

                                 (Std. Err. adjusted for 1,472 clusters in id)
------------------------------------------------------------------------------
             |               Robust
    turnoutR |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       aCorp |  -6.58e-10   4.46e-10    -1.48   0.140    -1.53e-09    2.16e-10
       nCorp |  -3.04e-06   4.12e-06    -0.74   0.461    -.0000111    5.04e-06
        aTot |   2.27e-10   1.83e-10     1.24   0.215    -1.32e-10    5.86e-10
       count |   2.76e-07   2.10e-07     1.32   0.189    -1.35e-07    6.87e-07
nIndvBigTech |  -5.22e-06   3.84e-06    -1.36   0.174    -.0000128    2.31e-06
aIndvBigTech |   2.20e-09   3.35e-09     0.66   0.511    -4.36e-09    8.76e-09
   nIndvTech |  -4.77e-07   1.08e-06    -0.44   0.658    -2.59e-06    1.64e-06
   aIndvTech |  -7.00e-11   2.25e-10    -0.31   0.755    -5.11e-10    3.71e-10
nCorpBigTech |   7.22e-06   8.54e-06     0.85   0.398    -9.52e-06     .000024
   aCorpTech |   1.21e-08   1.33e-08     0.91   0.364    -1.41e-08    3.82e-08
       year1 |  -.1901217   .0032514   -58.47   0.000    -.1964995   -.1837438
       year2 |   .0142908   .0048956     2.92   0.004     .0046877    .0238939
       year3 |   -.140551   .0035209   -39.92   0.000    -.1474574   -.1336445
       year4 |   .1318401   .0020494    64.33   0.000     .1278202    .1358601
       year5 |  -.0316061   .0016459   -19.20   0.000    -.0348347   -.0283774
       year6 |   .0729276   .0015211    47.94   0.000     .0699438    .0759113
       year7 |  -.1781243   .0019979   -89.16   0.000    -.1820432   -.1742053
       year8 |    .100313   .0012721    78.85   0.000     .0978176    .1028083
       year9 |          0  (omitted)
       _cons |   .6750063   .0015433   437.38   0.000      .671979    .6780335
-------------+----------------------------------------------------------------
     sigma_u |  .08704642
     sigma_e |  .08198094
         rho |  .52994147   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. outreg2 using turnrReg2.doc, append
turnrReg2.doc
dir : seeout

.  
. xtreg turnoutR nCorp nIndvTech nIndvBigTech nCorpBigTech count nDemRec nRepRec aTot aCorp aIndvBigTech aIndvTech aCorpTech aDemRec aRepRec meanCFCont meanCFCand year*, fe vce(cluster id)
note: year9 omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =     12,223
Group variable: id                              Number of groups  =      1,472

R-sq:                                           Obs per group:
     within  = 0.6853                                         min =          1
     between = 0.0619                                         avg =        8.3
     overall = 0.4891                                         max =          9

                                                F(21,1471)        =          .
corr(u_i, Xb)  = -0.0049                        Prob > F          =          .

                                 (Std. Err. adjusted for 1,472 clusters in id)
------------------------------------------------------------------------------
             |               Robust
    turnoutR |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       nCorp |  -.0000202   5.10e-06    -3.96   0.000    -.0000302   -.0000102
   nIndvTech |  -1.28e-06   6.56e-07    -1.96   0.051    -2.57e-06    3.55e-09
nIndvBigTech |  -3.28e-06   3.28e-06    -1.00   0.318    -9.71e-06    3.16e-06
nCorpBigTech |   .0000111   5.52e-06     2.01   0.044     2.92e-07    .0000219
       count |   4.77e-07   1.64e-07     2.91   0.004     1.56e-07    7.97e-07
     nDemRec |  -7.51e-07   1.86e-07    -4.03   0.000    -1.12e-06   -3.85e-07
     nRepRec |   .0000185   3.57e-06     5.18   0.000     .0000115    .0000254
        aTot |   5.84e-10   1.62e-10     3.60   0.000     2.66e-10    9.02e-10
       aCorp |  -7.61e-10   3.86e-10    -1.97   0.049    -1.52e-09   -4.05e-12
aIndvBigTech |  -2.07e-09   3.26e-09    -0.64   0.525    -8.46e-09    4.32e-09
   aIndvTech |   2.46e-09   1.25e-09     1.97   0.049     1.17e-11    4.92e-09
   aCorpTech |   1.37e-08   1.59e-08     0.86   0.390    -1.76e-08    4.50e-08
     aDemRec |  -6.36e-10   4.61e-10    -1.38   0.168    -1.54e-09    2.68e-10
     aRepRec |  -2.56e-09   1.13e-09    -2.27   0.024    -4.77e-09   -3.44e-10
  meanCFCont |  -.0050222   .0034868    -1.44   0.150    -.0118618    .0018175
  meanCFCand |   .0104393   .0038984     2.68   0.007     .0027922    .0180864
       year1 |  -.1932067   .0037919   -50.95   0.000    -.2006447   -.1857686
       year2 |   .0106201   .0052615     2.02   0.044     .0002993    .0209408
       year3 |  -.1447338   .0038536   -37.56   0.000    -.1522929   -.1371747
       year4 |   .1267286   .0025946    48.84   0.000      .121639    .1318181
       year5 |  -.0360421   .0022848   -15.78   0.000    -.0405239   -.0315604
       year6 |   .0687985   .0018082    38.05   0.000     .0652515    .0723455
       year7 |  -.1792356   .0020727   -86.47   0.000    -.1833014   -.1751697
       year8 |   .0994978   .0014285    69.65   0.000     .0966957       .1023
       year9 |          0  (omitted)
       _cons |   .6767715   .0025002   270.68   0.000     .6718671    .6816759
-------------+----------------------------------------------------------------
     sigma_u |  .08767777
     sigma_e |  .08184482
         rho |  .53436742   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. outreg2 using turnrReg2.doc, append
turnrReg2.doc
dir : seeout

.  
. 
. clear

. 
. import delimited "/Users/mishat/Desktop/Data/JP/final/fullTS.csv", case(preserve) encoding(ISO-8859-2) numericcols(229 230 231 232 233 234 235 236 237 238 239 275 276 277 278 279 280 281 282 283) clear 
(327 vars, 916 obs)

. desc

Contains data
  obs:           916                          
 vars:           327                          
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
v1              int     %8.0g                 
NAMELSAD        str31   %31s                  
yr              int     %8.0g                 
area            float   %9.0g                 
count           long    %12.0g                
nIndv           long    %12.0g                
nCorp           int     %8.0g                 
nIndvTech       long    %12.0g                
nIndvBigTech    int     %8.0g                 
nCorpBigTech    int     %8.0g                 
nDemRec         long    %12.0g                
nRepRec         long    %12.0g                
nIndRec         int     %8.0g                 
nComRec         long    %12.0g                
nGen            float   %9.0g                 
aTot            float   %9.0g                 
aIndv           float   %9.0g                 
aCorp           float   %9.0g                 
aIndvBigTech    float   %9.0g                 
aIndvTech       float   %9.0g                 
aCorpTech       float   %9.0g                 
aDemRec         float   %9.0g                 
aRepRec         float   %9.0g                 
aIndRec         float   %9.0g                 
aComRec         float   %9.0g                 
aGen            float   %9.0g                 
meanCFCont      float   %9.0g                 
sdCFCont        float   %9.0g                 
meanCFCand      float   %9.0g                 
sdCFCand        float   %9.0g                 
meanCFDiff      float   %9.0g                 
sdCFDiff        float   %9.0g                 
vReg            long    %12.0g                
vTurn           long    %12.0g                
SE_A00002_001   float   %9.0g                 
SE_A00003_001   float   %9.0g                 
SE_A00003_002   float   %9.0g                 
SE_A00003_003   float   %9.0g                 
SE_A02002_002   long    %12.0g                
SE_A02002_003   long    %12.0g                
SE_A02002_004   long    %12.0g                
SE_A02002_005   long    %12.0g                
SE_A02002_006   long    %12.0g                
SE_A02002_007   long    %12.0g                
SE_A02002_008   long    %12.0g                
SE_A02002_009   long    %12.0g                
SE_A02002_010   long    %12.0g                
SE_A02002_011   long    %12.0g                
SE_A02002_012   long    %12.0g                
SE_A02002_013   long    %12.0g                
SE_A02002_014   int     %8.0g                 
SE_A02002_015   long    %12.0g                
SE_A02002_016   long    %12.0g                
SE_A02002_017   long    %12.0g                
SE_A02002_018   long    %12.0g                
SE_A02002_019   long    %12.0g                
SE_A02002_020   long    %12.0g                
SE_A02002_021   long    %12.0g                
SE_A02002_022   long    %12.0g                
SE_A02002_023   long    %12.0g                
SE_A02002_024   long    %12.0g                
SE_A02002_025   long    %12.0g                
SE_A02002_026   long    %12.0g                
SE_A02002_027   long    %12.0g                
SE_C01001B_002  long    %12.0g                
SE_C01001B_003  long    %12.0g                
SE_C01001B_004  long    %12.0g                
SE_C01001B_005  long    %12.0g                
SE_C01001B_006  long    %12.0g                
SE_C01001B_007  long    %12.0g                
SE_C01001B_008  long    %12.0g                
SE_C01001B_009  long    %12.0g                
SE_C01001B_010  long    %12.0g                
SE_C01001B_011  long    %12.0g                
SE_C01001B_012  long    %12.0g                
SE_C01001B_013  long    %12.0g                
SE_C01001B_014  long    %12.0g                
SE_C01001B_015  long    %12.0g                
SE_C01001B_016  long    %12.0g                
SE_C01001B_017  long    %12.0g                
SE_C01001B_018  long    %12.0g                
SE_C01001B_019  long    %12.0g                
SE_C01001B_020  long    %12.0g                
SE_C01001B_021  long    %12.0g                
SE_C01001B_022  long    %12.0g                
SE_C01001B_023  long    %12.0g                
SE_A01004_001   float   %9.0g                 
SE_A01004_002   float   %9.0g                 
SE_A01004_003   float   %9.0g                 
SE_A10008_001   long    %12.0g                
SE_A10008_002   long    %12.0g                
SE_A10008_003   long    %12.0g                
SE_A10008_004   long    %12.0g                
SE_A10008_005   long    %12.0g                
SE_A10008_006   long    %12.0g                
SE_A10008_007   long    %12.0g                
SE_A10008_008   long    %12.0g                
SE_A10008_009   long    %12.0g                
SE_A10024_001   long    %12.0g                
SE_A10024_002   long    %12.0g                
SE_A10024_003   long    %12.0g                
SE_A10024_004   long    %12.0g                
SE_A10024_005   long    %12.0g                
SE_A10024_006   long    %12.0g                
SE_A10024_007   long    %12.0g                
SE_A10024_008   long    %12.0g                
SE_A10002B_001  long    %12.0g                
SE_A10002B_002  long    %12.0g                
SE_A10002B_003  long    %12.0g                
SE_A10002B_004  long    %12.0g                
SE_A10002B_005  long    %12.0g                
SE_A10002B_006  long    %12.0g                
SE_A10002B_007  int     %8.0g                 
SE_A10002B_008  int     %8.0g                 
SE_A10022_001   long    %12.0g                
SE_A10022_002   long    %12.0g                
SE_A10022_003   long    %12.0g                
SE_A10022_004   long    %12.0g                
SE_A10022_005   long    %12.0g                
SE_A10022_006   long    %12.0g                
SE_A10022_007   long    %12.0g                
SE_A10022_008   long    %12.0g                
SE_A10005B_001  long    %12.0g                
SE_A10005B_002  long    %12.0g                
SE_A10005B_003  long    %12.0g                
SE_A10005B_004  long    %12.0g                
SE_A10005B_005  long    %12.0g                
SE_A10005B_006  long    %12.0g                
SE_A10005B_007  int     %8.0g                 
SE_A10005B_008  long    %12.0g                
SE_A10009_001   long    %12.0g                
SE_A10009_002   long    %12.0g                
SE_A10009_003   long    %12.0g                
SE_A10009_004   long    %12.0g                
SE_A10009_005   long    %12.0g                
SE_A10009_006   long    %12.0g                
SE_A10009_007   long    %12.0g                
SE_A10009_008   int     %8.0g                 
SE_A10009_009   int     %8.0g                 
SE_A10009_010   int     %8.0g                 
SE_A10009_011   long    %12.0g                
SE_A10009_012   long    %12.0g                
SE_A10009_013   long    %12.0g                
SE_A10009_014   long    %12.0g                
SE_A10009_015   long    %12.0g                
SE_A10009_016   long    %12.0g                
SE_A10009_017   long    %12.0g                
SE_A10009_018   long    %12.0g                
SE_A10009_019   long    %12.0g                
SE_A10010_002   long    %12.0g                
SE_A03001B_002  long    %12.0g                
SE_A03001B_010  long    %12.0g                
SE_A10023_002   long    %12.0g                
SE_A10023_003   long    %12.0g                
SE_A10020_002   long    %12.0g                
SE_A10020_003   long    %12.0g                
SE_A10020_004   long    %12.0g                
SE_A10020_005   long    %12.0g                
SE_A10020_006   long    %12.0g                
SE_A10020_007   long    %12.0g                
SE_A10020_008   long    %12.0g                
SE_A10020_009   long    %12.0g                
SE_A10020_010   long    %12.0g                
SE_A01003B_002  long    %12.0g                
SE_A01003B_003  long    %12.0g                
SE_A01003B_004  long    %12.0g                
SE_A01003B_005  long    %12.0g                
SE_A01003B_006  long    %12.0g                
SE_A01003B_007  long    %12.0g                
SE_A01003B_008  long    %12.0g                
SE_A01003B_009  long    %12.0g                
SE_A01003B_010  int     %8.0g                 
SE_A10003_001   float   %9.0g                 
SE_A10003B_001  float   %9.0g                 
SE_A11001_002   long    %12.0g                
SE_A11001_003   long    %12.0g                
SE_A11001_004   long    %12.0g                
SE_A11001_005   long    %12.0g                
SE_A11001_006   long    %12.0g                
SE_A14019_001   double  %10.0g                
SE_A14016_001   long    %12.0g                
SE_A14021_001   double  %10.0g                
SE_A14023_001   double  %10.0g                
SE_A14023_002   double  %10.0g                
SE_A14023_009   double  %10.0g                
SE_A10011_002   long    %12.0g                
SE_A10011_003   long    %12.0g                
SE_A10019_002   long    %12.0g                
SE_A10019_003   long    %12.0g                
SE_A10016_002   long    %12.0g                
SE_A10016_003   long    %12.0g                
SE_A10012_002   long    %12.0g                
SE_A10012_003   long    %12.0g                
SE_A10017_002   long    %12.0g                
SE_A10017_003   long    %12.0g                
SE_A10018_002   long    %12.0g                
SE_A10018_003   long    %12.0g                
SE_A10014_002   long    %12.0g                
SE_A10014_003   long    %12.0g                
SE_A10015_002   long    %12.0g                
SE_A10015_003   long    %12.0g                
SE_A10013_002   long    %12.0g                
SE_A10013_003   long    %12.0g                
SE_A14024_001   long    %12.0g                
SE_A14026_001   long    %12.0g                
SE_A14026_002   long    %12.0g                
SE_A14026_003   long    %12.0g                
SE_A14026_004   long    %12.0g                
SE_A14026_005   long    %12.0g                
SE_A14027_001   long    %12.0g                
SE_A14027_002   long    %12.0g                
SE_A14027_003   long    %12.0g                
SE_A14027_004   long    %12.0g                
SE_A14027_005   long    %12.0g                
SE_A14027_006   long    %12.0g                
SE_A14025_001   float   %9.0g                 
SE_A14025_002   float   %9.0g                 
SE_A14025_003   float   %9.0g                 
SE_A14025_004   float   %9.0g                 
SE_A14025_005   float   %9.0g                 
SE_A14025_006   float   %9.0g                 
SE_A14028_001   float   %9.0g                 
SE_A10060_001   long    %12.0g                
SE_A10060_002   long    %12.0g                
SE_A10060_003   long    %12.0g                
SE_A10044_001   long    %12.0g                
SE_A10044_002   long    %12.0g                
SE_A10044_003   long    %12.0g                
SE_A10032_002   long    %8.0g                 
SE_A10032_003   long    %8.0g                 
SE_A10032_004   double  %10.0g                
SE_A10032_005   double  %10.0g                
SE_A10032_006   double  %10.0g                
SE_A10032_007   long    %8.0g                 
SE_A10032_008   long    %8.0g                 
SE_A10032_009   long    %8.0g                 
SE_A10032_010   long    %8.0g                 
SE_A10032_011   double  %10.0g                
SE_A10032_012   float   %9.0g                 
SE_A10050_002   long    %12.0g                
SE_A10050_003   long    %12.0g                
SE_A10050_004   long    %12.0g                
SE_A10050_005   long    %12.0g                
SE_A10050_006   long    %12.0g                
SE_A10050_007   long    %12.0g                
SE_A10042B_002  long    %12.0g                
SE_A10042B_003  long    %12.0g                
SE_A10042B_004  long    %12.0g                
SE_A10042B_005  long    %12.0g                
SE_A10042B_006  int     %8.0g                 
SE_A10042B_007  int     %8.0g                 
SE_A10057_001   int     %8.0g                 
SE_A10036_001   long    %12.0g                
SE_A18003_001   float   %9.0g                 
SE_A18004_001   long    %12.0g                
SE_A18007_002   int     %8.0g                 
SE_A18007_003   int     %8.0g                 
SE_A10037_001   float   %9.0g                 
SE_A10037_002   float   %9.0g                 
SE_A10037_003   float   %9.0g                 
SE_A10027_002   int     %8.0g                 
SE_A10027_003   int     %8.0g                 
SE_A10027_004   long    %12.0g                
SE_A10027_005   long    %12.0g                
SE_A10027_006   long    %12.0g                
SE_A10027_007   long    %12.0g                
SE_A10027_008   long    %12.0g                
SE_A10027_009   long    %12.0g                
SE_A10027_010   long    %12.0g                
SE_A10027_011   long    %12.0g                
SE_A10027_012   long    %12.0g                
SE_A10027_013   long    %12.0g                
SE_A10027_014   long    %12.0g                
SE_A10027_015   long    %12.0g                
SE_A13003A_001  long    %8.0g                 
SE_A13003A_002  long    %8.0g                 
SE_A13003A_003  long    %8.0g                 
SE_A13003B_001  long    %8.0g                 
SE_A13003B_002  long    %8.0g                 
SE_A13003B_003  long    %8.0g                 
SE_A13003C_001  long    %8.0g                 
SE_A13003C_002  double  %10.0g                
SE_A13003C_003  long    %8.0g                 
SE_A09001_002   long    %12.0g                
SE_A09001_003   long    %12.0g                
SE_A09001_004   long    %12.0g                
SE_A09001_005   long    %12.0g                
SE_A09001_006   long    %12.0g                
SE_A09001_007   long    %12.0g                
SE_A09001_008   long    %12.0g                
SE_A09001_009   long    %12.0g                
SE_A09002_002   int     %8.0g                 
SE_A09002_003   long    %12.0g                
SE_A09002_004   long    %12.0g                
SE_A09002_005   long    %12.0g                
SE_A09002_006   long    %12.0g                
SE_A09002_007   long    %12.0g                
SE_A09002_008   long    %12.0g                
SE_A10030_003   long    %12.0g                
SE_A10030_004   long    %12.0g                
SE_A10030_005   long    %12.0g                
SE_A10030_006   long    %12.0g                
SE_A10030_007   long    %12.0g                
SE_A10054B_002  long    %12.0g                
SE_A10054B_003  long    %12.0g                
SE_A10054B_004  long    %12.0g                
SE_A10054B_005  long    %12.0g                
SE_A10054B_006  int     %8.0g                 
SE_A10054B_007  int     %8.0g                 
SE_A16002_001   long    %12.0g                
SE_A16002_002   long    %12.0g                
SE_A16002_003   long    %12.0g                
SE_A16002_004   long    %12.0g                
SE_A16002_005   long    %12.0g                
SE_A16002_006   long    %12.0g                
SE_A16002_007   long    %12.0g                
SE_A06001_002   long    %12.0g                
SE_A06001_003   long    %12.0g                
SE_A06001_004   long    %12.0g                
SE_A06001_005   long    %12.0g                
SE_A05001_002   long    %12.0g                
SE_A05001_003   long    %12.0g                
SE_A05001_004   long    %12.0g                
SE_A10048_001   long    %12.0g                
SE_A10048_002   long    %12.0g                
SE_A10048_003   long    %12.0g                
id              int     %8.0g                 
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.

. sum

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
          v1 |        916       458.5    264.5707          1        916
    NAMELSAD |          0
          yr |        916    2012.238    3.993453       2006       2018
        area |        916    37.39931    52.86487       3.58     468.67
       count |        916    18157.74    55162.11        290     827884
-------------+---------------------------------------------------------
       nIndv |        916    16913.86    52944.38        252     816704
       nCorp |        916    461.3144    1723.238          0      16809
   nIndvTech |        916    2207.766    6605.661         17      90506
nIndvBigTech |        916    230.2707    878.1833          0      11875
nCorpBigTech |        916    34.14301    219.7305          0       5636
-------------+---------------------------------------------------------
     nDemRec |        916    8388.961    30437.51         39     584847
     nRepRec |        916    1262.763    2994.415          8      35343
     nIndRec |        916     174.524    943.6569          0      19914
     nComRec |        916    11884.72    35654.84        208     570116
        nGen |        916    .0516325    .0794892          0   .4287886
-------------+---------------------------------------------------------
        aTot |        916    1.05e+07    5.05e+07    9281.52   7.56e+08
       aIndv |        916     4155823    1.96e+07    9281.52   2.44e+08
       aCorp |        916     2120046    1.40e+07          0   3.03e+08
aIndvBigTech |        916    44765.71    211525.8          0    2588553
   aIndvTech |        916    397685.9     1555937  -100062.7   2.00e+07
-------------+---------------------------------------------------------
   aCorpTech |        916     18552.9    100756.9          0    1393362
     aDemRec |        916     2754981    1.31e+07    2348.87   1.43e+08
     aRepRec |        916     1547762     5888238     722.33   7.36e+07
     aIndRec |        916    527228.2     5721098       -229   1.32e+08
     aComRec |        916     7615108    3.90e+07    5737.24   6.27e+08
-------------+---------------------------------------------------------
        aGen |        916    395682.8     3223072      -2426   6.96e+07
  meanCFCont |        916    -.616101    .4375725  -1.616288   .9070293
    sdCFCont |        916     .914756    .1860118   .3509596   1.542066
  meanCFCand |        916   -.3909635    .3481433  -1.209661    .888126
    sdCFCand |        916   -.3909635    .3481433  -1.209661    .888126
-------------+---------------------------------------------------------
  meanCFDiff |        916   -.0461534    .0287026  -.1629603   .0566457
    sdCFDiff |        916    .2703547    .0672823   .0820338   .4856243
        vReg |        916     2173372     2896623     367929   3.41e+07
       vTurn |        916     1360646     1829689     109896   2.10e+07
SE_A00002_~1 |        916    134171.1    320572.9   931.4459    3990469
-------------+---------------------------------------------------------
SE_A00003_~1 |        916    41.11603    59.37352   3.509351   502.7275
SE_A0000~002 |        916    37.00905    52.75691   3.509351   469.0747
SE_A0000~003 |        916    4.106976    17.43041          0   185.2223
SE_A0200~002 |        916    89591.42      181016      28998    1995286
SE_A0200~003 |        916    6327.404    12318.21        687     146203
-------------+---------------------------------------------------------
SE_A0200~004 |        916    6069.682    11271.54        930     126660
SE_A0200~005 |        916    6206.447    11356.93        819     139548
SE_A0200~006 |        916    3799.626    6931.908        471      80257
SE_A0200~007 |        916    9612.189    20265.85        914     220136
SE_A0200~008 |        916    14552.53    32526.61       1952     379769
-------------+---------------------------------------------------------
SE_A0200~009 |        916    13075.36    28037.29       2312     310757
SE_A0200~010 |        916    11964.36    24137.62       2103     271871
SE_A0200~011 |        916    9087.719    17993.79       1160     217902
SE_A0200~012 |        916    5200.976    10216.88        392     134233
SE_A0200~013 |        916    2709.462    5428.512        143      60615
-------------+---------------------------------------------------------
SE_A0200~014 |        916    985.6616    2086.801          0      25545
SE_A0200~015 |        916    91062.83    182588.8      29179    2015652
SE_A0200~016 |        916    6052.191    11808.43        446     141681
SE_A0200~017 |        916    5814.074    10900.86        886     125335
SE_A0200~018 |        916    5902.563    10954.66        925     130407
-------------+---------------------------------------------------------
SE_A0200~019 |        916    3621.366    6733.925        401      79058
SE_A0200~020 |        916     9212.14    19504.41        835     215226
SE_A0200~021 |        916    13833.41    30419.29       1619     352769
SE_A0200~022 |        916    12829.68    26351.45       2842     291218
SE_A0200~023 |        916     12132.6    23827.41       2897     264747
-------------+---------------------------------------------------------
SE_A0200~024 |        916     9817.61    19721.23       1107     234044
SE_A0200~025 |        916    6194.416     12429.3        662     161377
SE_A0200~026 |        916    3748.456    7555.982        228      86447
SE_A0200~027 |        916    1904.318    3827.963          0      45432
SE_C0100~002 |        916    168274.7    339751.1      56206    3761915
-------------+---------------------------------------------------------
SE_C0100~003 |        916    156390.9    317873.6      50106    3543111
SE_C0100~004 |        916    144281.9    295986.9      44794    3316437
SE_C0100~005 |        916    136860.9    282633.3      41150    3185786
SE_C0100~006 |        916    131698.4    272229.1      38621    3080797
SE_C0100~007 |        916    128909.9    266453.2      37006    3022096
-------------+---------------------------------------------------------
SE_C0100~008 |        916    126168.3    260784.8      36079    2965990
SE_C0100~009 |        916    118036.6    243417.3      32216    2784844
SE_C0100~010 |        916    103497.9      211269      26595    2405324
SE_C0100~011 |        916    89650.63    180717.6      21886    2052306
SE_C0100~012 |        916    76409.02    152619.6      17239    1746302
-------------+---------------------------------------------------------
SE_C0100~013 |        916    63745.58    126639.9      12655    1477546
SE_C0100~014 |        916    51334.95    102087.6       7948    1216624
SE_C0100~015 |        916    39648.62    78956.35       5674     964373
SE_C0100~016 |        916    29355.17    58589.22       3663     725516
SE_C0100~017 |        916    25600.25    51029.22       2766     633038
-------------+---------------------------------------------------------
SE_C0100~018 |        916    20743.29    41345.17       1773     512427
SE_C0100~019 |        916    17852.64    35568.45       1551     441138
SE_C0100~020 |        916    14182.62    28325.84       1254     342248
SE_C0100~021 |        916    9347.897    18819.67        645     216817
SE_C0100~022 |        916    5688.401     11547.6        335     130989
-------------+---------------------------------------------------------
SE_C0100~023 |        916    2889.979    5897.911         66      69755
SE_A0100~001 |        916     35.1821    4.291181       24.6       50.7
SE_A01004_~2 |        916    34.01616    4.196785       22.6       47.9
SE_A01004_~3 |        916    36.36736    4.516471       24.3       53.9
SE_A10008_~1 |        916    59807.63    125892.7      13733    1382293
-------------+---------------------------------------------------------
SE_A10008_~2 |        916    39932.69    75315.26      11108     823799
SE_A10008_~3 |        916    27951.93    49269.63       6628     531499
SE_A10008_~4 |        916    11980.76    26482.16       1564     301434
SE_A10008_~5 |        916    3648.503    8254.319        324      94618
SE_A10008_~6 |        916     8332.26    18266.03        689     207462
-------------+---------------------------------------------------------
SE_A10008_~7 |        916    19874.94    51407.77       1360     564674
SE_A10008_~8 |        916    9531.154    25760.24        148     280117
SE_A10008_~9 |        916    10343.79    25684.75        553     284557
SE_A10024_~1 |        916    59807.63    125892.7      13733    1382293
SE_A10024_~2 |        916    15096.33     38549.2        735     421527
-------------+---------------------------------------------------------
SE_A10024_~3 |        916    17300.22    36313.98       1692     403076
SE_A10024_~4 |        916    9897.654    19306.38       1873     215361
SE_A10024_~5 |        916    8970.667    16593.82       2029     182425
SE_A10024_~6 |        916    4719.511     8915.42        330      99146
SE_A10024_~7 |        916    2129.755    4067.194         46      45803
-------------+---------------------------------------------------------
SE_A10024_~8 |        916      1693.5    3524.961          0      46373
SE_A10002B~1 |        916     29663.5    77549.97       2803     884311
SE_A10002B~2 |        916    9096.211    27580.26         62     312521
SE_A10002B~3 |        916    7783.317    20995.76        357     244127
SE_A10002B~4 |        916    4735.536    11190.96        123     128213
-------------+---------------------------------------------------------
SE_A10002B~5 |        916    3935.258    9125.461        255     105607
SE_A10002B~6 |        916    2265.848     5283.88          0      61165
SE_A10002B~7 |        916    1048.825    2398.616          0      29418
SE_A10002B~8 |        916    798.5044    1815.214          0      23166
SE_A10022_~1 |        916    59807.63    125892.7      13733    1382293
-------------+---------------------------------------------------------
SE_A10022_~2 |        916    21300.48    39409.62       5291     442010
SE_A10022_~3 |        916     19131.4    35036.73       5008     398952
SE_A10022_~4 |        916    4114.353    7818.762        520      86499
SE_A10022_~5 |        916    4091.072    7639.721        221      93338
SE_A10022_~6 |        916    10925.98    19760.51       2784     219940
-------------+---------------------------------------------------------
SE_A10022_~7 |        916    2169.083    4486.796          0      53733
SE_A10022_~8 |        916    38507.15    87323.31       4463     994290
SE_A10005B~1 |        916     29663.5    77549.97       2803     884311
SE_A10005B~2 |        916    10775.91    24031.87       1058     273434
SE_A10005B~3 |        916    9872.098    21768.69       1058     246852
-------------+---------------------------------------------------------
SE_A10005B~4 |        916    2361.867    5011.478          0      56611
SE_A10005B~5 |        916    2413.852     5356.96         27      62495
SE_A10005B~6 |        916     5096.38    11532.48        575     133137
SE_A10005B~7 |        916    903.8111    2307.586          0      28643
SE_A10005B~8 |        916    18887.59    54167.07       1606     634764
-------------+---------------------------------------------------------
SE_A10009~01 |        916    59807.63    125892.7      13733    1382293
SE_A10009~02 |        916    21553.52    39866.05       5326     448766
SE_A10009~03 |        916    21395.89    39598.89       5291     444850
SE_A10009~04 |        916    14201.27    24580.29       3647     276971
SE_A10009~05 |        916    7194.621    15315.91        530     178596
-------------+---------------------------------------------------------
SE_A10009~06 |        916    1991.237    4279.504         35      49310
SE_A10009~07 |        916    5203.384    11069.61        315     130277
SE_A10009~08 |        916    157.6321    302.0408          0       3916
SE_A10009~09 |        916    101.3537      206.14          0       2775
SE_A1000~010 |        916    56.27838    123.7646          0       1398
-------------+---------------------------------------------------------
SE_A1000~011 |        916    38254.11    86886.51       4326     990888
SE_A1000~012 |        916     18536.8    36129.42       2668     428103
SE_A1000~013 |        916    13750.66    24962.58       1528     287846
SE_A1000~014 |        916    4786.142    11354.13        333     140257
SE_A1000~015 |        916    1657.266     4041.42         42      50490
-------------+---------------------------------------------------------
SE_A1000~016 |        916    3128.876    7338.775        215      90247
SE_A1000~017 |        916    19717.31    51153.89       1336     562785
SE_A1000~018 |        916      9429.8     25600.9        148     278989
SE_A1000~019 |        916    10287.51    25590.29        553     283796
SE_A10010_~2 |        916    36911.03    72148.14       2520     773902
-------------+---------------------------------------------------------
SE_A0300~002 |        916    16714.51    40082.04        654     453918
SE_A0300~010 |        916    10332.27     30667.9        308     364015
SE_A10023_~2 |        916    17391.27    43217.06        902     508869
SE_A10023_~3 |        916    42416.36    85161.86        641     875381
SE_A10020_~2 |        916    2260.261    5443.966          0      60222
-------------+---------------------------------------------------------
SE_A10020_~3 |        916    10516.09    24502.37        680     262650
SE_A10020_~4 |        916     12611.1    26988.57       2640     307221
SE_A10020_~5 |        916    12621.44    25543.18       2617     282155
SE_A10020_~6 |        916    5485.904     11099.6        524     128562
SE_A10020_~7 |        916    4650.064     9508.95        243     115682
-------------+---------------------------------------------------------
SE_A10020_~8 |        916    6358.986    12860.03        555     166591
SE_A10020_~9 |        916     3674.21    7483.077        145      83208
SE_A10020_~0 |        916    1629.585    3400.807          0      40582
SE_A01003B~2 |        916    2074.844    5161.153          0      57656
SE_A01003B~3 |        916    7902.563    20867.45        208     229383
-------------+---------------------------------------------------------
SE_A0100~004 |        916    6990.691    18213.89        395     199007
SE_A0100~005 |        916    5435.239    14247.17        175     169241
SE_A0100~006 |        916    1987.562    5476.138         43      68162
SE_A0100~007 |        916    1578.965    4400.831          0      58343
SE_A0100~008 |        916    1980.157    5491.153          0      73453
-------------+---------------------------------------------------------
SE_A0100~009 |        916    1128.378    3034.184          0      34697
SE_A0100~010 |        916    585.0993    1345.828          0      16806
SE_A10003_~1 |        916    3.088133    .5198755       1.81       4.77
SE_A10003B~1 |        916    3.033745    .5642811       1.58       4.81
SE_A1100~002 |        916    55281.22    131408.1      10460    1522000
-------------+---------------------------------------------------------
SE_A1100~003 |        916     65038.3      117944      16661    1289778
SE_A1100~004 |        916    3392.693    8332.163        157     102599
SE_A1100~005 |        916    7131.874    14185.35       1131     158769
SE_A1100~006 |        916     13437.8    25486.18       1613     272139
SE_A14019_~1 |        916    5.20e+09    1.08e+10   5.40e+08   1.33e+11
-------------+---------------------------------------------------------
SE_A14016_~1 |        916    48087.94       17225      19355     137024
SE_A14021_~1 |        916    1.25e+09    3.46e+09   2.89e+07   4.15e+10
SE_A14023_~1 |        916    5.45e+09    1.13e+10   5.95e+08   1.40e+11
SE_A14023_~2 |        916    3.54e+09    7.44e+09   1.40e+08   8.90e+10
SE_A1402~009 |        916    1.19e+09    2.64e+09   8.95e+07   3.75e+10
-------------+---------------------------------------------------------
SE_A10011_~2 |        916    49261.76    104269.1      11651    1153496
SE_A10011_~3 |        916    10545.88    21834.09        945     243822
SE_A10019_~2 |        916    46811.12    96945.79      10820    1062659
SE_A10019_~3 |        916    12996.52    29179.79       1386     330518
SE_A10016_~2 |        916    8292.581       22158       1070     270875
-------------+---------------------------------------------------------
SE_A10016_~3 |        916    51515.05    104028.4      11964    1121470
SE_A10012_~2 |        916    12550.97    25263.45        248     257766
SE_A10012_~3 |        916    47256.66    101740.3       7552    1148412
SE_A10017_~2 |        916    14050.21    26777.34       1845     316077
SE_A10017_~3 |        916    45757.42    99282.88      11247    1069091
-------------+---------------------------------------------------------
SE_A10018_~2 |        916    3544.383    8272.259         72      95961
SE_A10018_~3 |        916    56263.25    117871.5      12196    1286332
SE_A10014_~2 |        916    2176.663    5156.671          0      65522
SE_A10014_~3 |        916    57630.97    121027.6      12138    1335136
SE_A10015_~2 |        916     8379.68    13176.32        814     134670
-------------+---------------------------------------------------------
SE_A10015_~3 |        916    51427.95    113136.4      12661    1257266
SE_A10013_~2 |        916    7137.702    13449.06        852     172238
SE_A10013_~3 |        916    52669.93    112928.7      11593    1279742
SE_A14024_~1 |        916    30232.66    12640.61       9104      96705
SE_A14026_~1 |        916    29438.25    10039.89      12390      77013
-------------+---------------------------------------------------------
SE_A14026_~2 |        916    54613.82    18266.55      24020     144252
SE_A14026_~3 |        916    83671.89    26545.02      36714     205113
SE_A14026_~4 |        916    127617.6    39002.23      54478     258215
SE_A14026_~5 |        916      201582    47948.96      92911     702742
SE_A14027_~1 |        916    16225.22     5582.06       4260      39876
-------------+---------------------------------------------------------
SE_A14027_~2 |        916     41828.4    14082.53      18653     102127
SE_A14027_~3 |        916    68421.43    22295.28      30106     174713
SE_A14027_~4 |        916    103524.7    32662.32      44835     273609
SE_A14027_~5 |        916      203393    73701.89      84283     648477
SE_A14027_~6 |        916    327504.8    138158.9     125111    1113883
-------------+---------------------------------------------------------
SE_A14025_~1 |        916    3.803712    .7990773       1.23       6.35
SE_A14025_~2 |        916    9.679847    1.202225       5.93       13.2
SE_A14025_~3 |        916    15.81321    1.246792      11.47       18.6
SE_A14025_~4 |        916    23.96607    1.031772       19.6      26.73
SE_A14025_~5 |        916    46.73648    3.684071      38.72      59.45
-------------+---------------------------------------------------------
SE_A14025_~6 |        916    18.67197    3.058894       11.9       30.6
SE_A14028_~1 |        916     .429694    .0417154       .329       .562
SE_A1006~001 |        916    59807.63    125892.7      13733    1382293
SE_A1006~002 |        916    30144.13    49380.26       4564     509223
SE_A1006~003 |        916     29663.5    77549.97       2803     884311
-------------+---------------------------------------------------------
SE_A10044_~1 |        916    64041.42    135518.2      14259    1502686
SE_A10044_~2 |        916    59807.63    125892.7      13733    1382293
SE_A10044_~3 |        916    4233.785    9851.108         85     120393
SE_A10032~02 |        911    37819.12    62471.84       9324     651446
SE_A10032_~3 |        911    33013.74    53544.33       8080     559550
-------------+---------------------------------------------------------
SE_A10032_~4 |        911     4805.38    9941.133         69      91896
SE_A10032_~5 |        911    1795.029    5179.518          0      45061
SE_A10032_~6 |        911     4166.83    8923.393          0      94650
SE_A10032_~7 |        911    4805.797    12334.29         99     130743
SE_A1003~008 |        911    4269.525    13029.54          0     146128
-------------+---------------------------------------------------------
SE_A1003~009 |        911    4181.596    17115.11          0     197922
SE_A1003~010 |        911    5715.811    19048.23          0     233940
SE_A1003~011 |        911    1456.201    1699.426          0      11772
SE_A1003~012 |        911    44.20527     101.011          0       1120
SE_A10050_~2 |        916    2591.517    11391.29          0     142831
-------------+---------------------------------------------------------
SE_A10050_~3 |        916    9719.433    30911.35        312     350902
SE_A10050_~4 |        916    17031.83    39652.46       1876     437230
SE_A10050_~5 |        916    18430.49    29818.16       3279     316153
SE_A10050_~6 |        916    9590.354    13198.34        347     125930
SE_A10050_~7 |        916    2444.009    3937.987          0      41120
-------------+---------------------------------------------------------
SE_A10042B~2 |        916    2419.188    10975.79          0     137934
SE_A10042B~3 |        916    8910.191    28810.37        209     328041
SE_A1004~004 |        916    11268.61    27178.68        724     311886
SE_A1004~005 |        916    5133.051     8899.62        380      99822
SE_A1004~006 |        916     1587.37    2413.578          0      24152
-------------+---------------------------------------------------------
SE_A1004~007 |        916    345.0841    640.7017          0       6619
SE_A1005~001 |        916    1974.105    12.35123       1939       2001
SE_A10036_~1 |        916    491358.3    244710.8     112900    2000001
SE_A18003_~1 |        916    33.56081    4.297113       21.7         51
SE_A18004_~1 |        916    3.97e+07    1.03e+08    4149900   1.37e+09
-------------+---------------------------------------------------------
SE_A1800~002 |        916    1426.729    406.7939        756       3324
SE_A1800~003 |        916    1309.324    371.9061        640       3058
SE_A10037_~1 |        916    24.54738    3.381736       15.2       37.1
SE_A10037_~2 |        916    28.30884    3.794825       19.4       44.4
SE_A10037_~3 |        916    11.05382    1.799938        6.7       19.7
-------------+---------------------------------------------------------
SE_A10027~02 |        916    171.5371     361.937          0       4382
SE_A10027~03 |        916     525.012    881.3026          0      10053
SE_A10027~04 |        916    1557.764    3237.034          0      35470
SE_A10027~05 |        916    1617.204    2868.789         64      34662
SE_A10027_~6 |        916    1675.789    3285.396          0      43420
-------------+---------------------------------------------------------
SE_A10027_~7 |        916     1765.43    3877.731          0      59015
SE_A10027_~8 |        916     1944.04    4895.084         64      81622
SE_A10027_~9 |        916    2318.531    6149.208         81      92537
SE_A10027_~0 |        916    2712.483    7054.373         77      96284
SE_A1002~011 |        916    2963.698    7580.994         61      91376
-------------+---------------------------------------------------------
SE_A1002~012 |        916    13515.11    30327.12        953     357699
SE_A1002~013 |        916    10205.06    20109.23       1507     270504
SE_A1002~014 |        916    14176.25    30164.99        277     353979
SE_A1002~015 |        916    2039.004    6433.414          0     117604
SE_A13003A~1 |        914     43224.1    80979.66       9326     945831
-------------+---------------------------------------------------------
SE_A13003A~2 |        914    9070.627    23508.91         35     289822
SE_A13003A~3 |        914    34153.48    58528.71       7066     685418
SE_A13003B~1 |        914    114503.4    237418.9      32042    2621635
SE_A13003B~2 |        914    15857.24     41778.4        651     523603
SE_A13003B~3 |        914    98646.17    196780.8      26821    2238081
-------------+---------------------------------------------------------
SE_A13003C~1 |        914    20274.31     40413.2       1773     501821
SE_A13003C~2 |        914    2199.272    6015.087          0      81291
SE_A13003C~3 |        914    18075.04    34540.14       1588     420530
SE_A09001_~2 |        916    78800.05    163640.6      18798    1876407
SE_A09001_~3 |        916    6997.873    11602.15        759     132967
-------------+---------------------------------------------------------
SE_A09001_~4 |        916    22545.57    40796.68       2868     414990
SE_A09001_~5 |        916     16387.2    35033.39       1540     356687
SE_A09001_~6 |        916    14325.03    36153.96        825     445196
SE_A09001_~7 |        916    9810.255    23761.29        345     310047
SE_A09001_~8 |        916    6047.451    14555.51        240     198499
-------------+---------------------------------------------------------
SE_A0900~009 |        916    2686.672    5381.125        108      74162
SE_A09002_~2 |        916    1243.353    2281.084          0      29650
SE_A09002_~3 |        916    15990.98    26805.12       1954     286625
SE_A09002_~4 |        916    28696.31    58258.45       3714     583860
SE_A09002_~5 |        916    17596.67    44309.82        952     556524
-------------+---------------------------------------------------------
SE_A09002_~6 |        916    6538.611       15569        291     198719
SE_A09002_~7 |        916    6047.451    14555.51        240     198499
SE_A09002_~8 |        916    2686.672    5381.125        108      74162
SE_A10030_~3 |        916    17807.57    46110.45        417     533611
SE_A10030_~4 |        916    21549.34     42591.1       3025     527047
-------------+---------------------------------------------------------
SE_A10030_~5 |        916    10441.91    20850.61        937     432708
SE_A10030_~6 |        916    3788.422    6990.936        304     138781
SE_A10030_~7 |        916    1541.638    2760.061          0      45340
SE_A10054B~2 |        916    4441.971    15628.45         40     164366
SE_A10054B~3 |        916    12884.41    36286.89        680     410344
-------------+---------------------------------------------------------
SE_A10054B~4 |        916    9116.854     20961.4       1047     244892
SE_A10054B~5 |        916    2302.313    4554.849         76      63909
SE_A10054B~6 |        916    661.8231    1238.515          0      16471
SE_A10054B~7 |        916    256.1299    540.3996          0       5826
SE_A1600~001 |        916    136409.2    281810.1      41150    3184818
-------------+---------------------------------------------------------
SE_A1600~002 |        916    7741.591    12451.44        462     123404
SE_A1600~003 |        916    4306.903    7186.225        245      71510
SE_A1600~004 |        916    3434.688    5501.369         53      59706
SE_A1600~005 |        916    128667.7    270895.2      40226    3101274
SE_A1600~006 |        916    111359.1    235018.1      28590    2630456
-------------+---------------------------------------------------------
SE_A1600~007 |        916     17308.6    36249.49       1720     470818
SE_A0600~002 |        916    126699.3      229009      29604    2504061
SE_A0600~003 |        916    53954.91    137303.8       3356    1507032
SE_A0600~004 |        916     25777.6     61652.3       1888     717605
SE_A0600~005 |        916    28177.31    76848.31       1399     927913
-------------+---------------------------------------------------------
SE_A0500~002 |        916    164193.3    333298.3      52517    3626396
SE_A0500~003 |        916    128250.1    273799.8      28184    3149198
SE_A0500~004 |        916    35943.14    62324.97       1052     704680
SE_A10048_~1 |        916    59807.63    125892.7      13733    1382293
SE_A10048_~2 |        916    59500.56    124993.8      13606    1374156
-------------+---------------------------------------------------------
SE_A10048_~3 |        916     59049.9    123555.5      13529    1357254
          id |        916    741.4716    391.3515         11       1347

. xtset id yr
       panel variable:  id (unbalanced)
        time variable:  yr, 2006 to 2018, but with gaps
                delta:  1 unit

. tab yr, gen(year)

         yr |      Freq.     Percent        Cum.
------------+-----------------------------------
       2006 |        120       13.10       13.10
       2008 |        121       13.21       26.31
       2010 |        127       13.86       40.17
       2012 |        133       14.52       54.69
       2014 |        135       14.74       69.43
       2016 |        137       14.96       84.39
       2018 |        143       15.61      100.00
------------+-----------------------------------
      Total |        916      100.00

. 
. gen pop = SE_A02002_002 + SE_A02002_015

. rename SE_A00002_001 popDen

. rename SE_A14028_001 gini

. rename SE_A14024_001 incomePC

. gen pforeignBorn = SE_A06001_003/pop

. rename SE_A14016_001 medIncome 

. rename SE_A14019_001 aggIncome

. gen pHousingOwners = SE_A10060_001/SE_A10060_002

. gen povertyR = SE_A13003B_002/SE_A13003B_001
(2 missing values generated)

. //only for 16-64
. rename SE_A09001_002 nWorkersOutside

. rename SE_A09001_003 travel0t9

. rename SE_A09001_004 travel10t19

. rename SE_A09001_005 travel20t29

. rename SE_A09001_006 travel30t39

. rename SE_A09001_007 travel40t59

. rename SE_A09001_008 travel60t89

. rename SE_A09001_009 travel90p

. rename SE_A14023_002 aggIncomeWhite

. rename SE_A14023_009 aggIncomeLatino              

. rename SE_A18007_002 move2005p

. rename SE_A18007_003 move2000t04

. rename SE_A10036_001 medianHomeValue

. rename SE_A18004_001 aggRent

. rename SE_A14027_001 meanQ1Inc

. rename SE_A14027_002 meanQ2Inc

. rename SE_A14027_003 meanQ3Inc

. rename SE_A14027_004 meanQ4Inc

. rename SE_A14027_005 meanQ5Inc

. rename SE_A14027_006 mean5pInc

. rename SE_C01001B_002 age5p

. rename SE_C01001B_003 age10p

. rename SE_C01001B_004 age15p

. rename SE_C01001B_005 age18p

. rename SE_C01001B_006 age20p

. rename SE_C01001B_007 age21p

. rename SE_C01001B_008 age22p

. rename SE_C01001B_009 age25p

. rename SE_C01001B_010 age30p

. rename SE_C01001B_011 age35p

. rename SE_C01001B_012 age40p

. rename SE_C01001B_013 age45p

. rename SE_C01001B_014 age50p

. rename SE_C01001B_015 age55p

. rename SE_C01001B_016 age60p

. rename SE_C01001B_017 age62p

. rename SE_C01001B_018 age65p

. rename SE_C01001B_019 age67p

. rename SE_C01001B_020 age70p

. rename SE_C01001B_021 age75p

. rename SE_C01001B_022 age80p

. rename SE_C01001B_023 age85p

. gen turnoutR = vTurn/vReg

. 
. sum

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
          v1 |        916       458.5    264.5707          1        916
    NAMELSAD |          0
          yr |        916    2012.238    3.993453       2006       2018
        area |        916    37.39931    52.86487       3.58     468.67
       count |        916    18157.74    55162.11        290     827884
-------------+---------------------------------------------------------
       nIndv |        916    16913.86    52944.38        252     816704
       nCorp |        916    461.3144    1723.238          0      16809
   nIndvTech |        916    2207.766    6605.661         17      90506
nIndvBigTech |        916    230.2707    878.1833          0      11875
nCorpBigTech |        916    34.14301    219.7305          0       5636
-------------+---------------------------------------------------------
     nDemRec |        916    8388.961    30437.51         39     584847
     nRepRec |        916    1262.763    2994.415          8      35343
     nIndRec |        916     174.524    943.6569          0      19914
     nComRec |        916    11884.72    35654.84        208     570116
        nGen |        916    .0516325    .0794892          0   .4287886
-------------+---------------------------------------------------------
        aTot |        916    1.05e+07    5.05e+07    9281.52   7.56e+08
       aIndv |        916     4155823    1.96e+07    9281.52   2.44e+08
       aCorp |        916     2120046    1.40e+07          0   3.03e+08
aIndvBigTech |        916    44765.71    211525.8          0    2588553
   aIndvTech |        916    397685.9     1555937  -100062.7   2.00e+07
-------------+---------------------------------------------------------
   aCorpTech |        916     18552.9    100756.9          0    1393362
     aDemRec |        916     2754981    1.31e+07    2348.87   1.43e+08
     aRepRec |        916     1547762     5888238     722.33   7.36e+07
     aIndRec |        916    527228.2     5721098       -229   1.32e+08
     aComRec |        916     7615108    3.90e+07    5737.24   6.27e+08
-------------+---------------------------------------------------------
        aGen |        916    395682.8     3223072      -2426   6.96e+07
  meanCFCont |        916    -.616101    .4375725  -1.616288   .9070293
    sdCFCont |        916     .914756    .1860118   .3509596   1.542066
  meanCFCand |        916   -.3909635    .3481433  -1.209661    .888126
    sdCFCand |        916   -.3909635    .3481433  -1.209661    .888126
-------------+---------------------------------------------------------
  meanCFDiff |        916   -.0461534    .0287026  -.1629603   .0566457
    sdCFDiff |        916    .2703547    .0672823   .0820338   .4856243
        vReg |        916     2173372     2896623     367929   3.41e+07
       vTurn |        916     1360646     1829689     109896   2.10e+07
      popDen |        916    134171.1    320572.9   931.4459    3990469
-------------+---------------------------------------------------------
SE_A0000~001 |        916    41.11603    59.37352   3.509351   502.7275
SE_A0000~002 |        916    37.00905    52.75691   3.509351   469.0747
SE_A0000~003 |        916    4.106976    17.43041          0   185.2223
SE_A0200~002 |        916    89591.42      181016      28998    1995286
SE_A0200~003 |        916    6327.404    12318.21        687     146203
-------------+---------------------------------------------------------
SE_A0200~004 |        916    6069.682    11271.54        930     126660
SE_A0200~005 |        916    6206.447    11356.93        819     139548
SE_A0200~006 |        916    3799.626    6931.908        471      80257
SE_A0200~007 |        916    9612.189    20265.85        914     220136
SE_A0200~008 |        916    14552.53    32526.61       1952     379769
-------------+---------------------------------------------------------
SE_A0200~009 |        916    13075.36    28037.29       2312     310757
SE_A0200~010 |        916    11964.36    24137.62       2103     271871
SE_A0200~011 |        916    9087.719    17993.79       1160     217902
SE_A0200~012 |        916    5200.976    10216.88        392     134233
SE_A0200~013 |        916    2709.462    5428.512        143      60615
-------------+---------------------------------------------------------
SE_A0200~014 |        916    985.6616    2086.801          0      25545
SE_A0200~015 |        916    91062.83    182588.8      29179    2015652
SE_A0200~016 |        916    6052.191    11808.43        446     141681
SE_A0200~017 |        916    5814.074    10900.86        886     125335
SE_A0200~018 |        916    5902.563    10954.66        925     130407
-------------+---------------------------------------------------------
SE_A0200~019 |        916    3621.366    6733.925        401      79058
SE_A0200~020 |        916     9212.14    19504.41        835     215226
SE_A0200~021 |        916    13833.41    30419.29       1619     352769
SE_A0200~022 |        916    12829.68    26351.45       2842     291218
SE_A0200~023 |        916     12132.6    23827.41       2897     264747
-------------+---------------------------------------------------------
SE_A0200~024 |        916     9817.61    19721.23       1107     234044
SE_A0200~025 |        916    6194.416     12429.3        662     161377
SE_A0200~026 |        916    3748.456    7555.982        228      86447
SE_A0200~027 |        916    1904.318    3827.963          0      45432
       age5p |        916    168274.7    339751.1      56206    3761915
-------------+---------------------------------------------------------
      age10p |        916    156390.9    317873.6      50106    3543111
      age15p |        916    144281.9    295986.9      44794    3316437
      age18p |        916    136860.9    282633.3      41150    3185786
      age20p |        916    131698.4    272229.1      38621    3080797
      age21p |        916    128909.9    266453.2      37006    3022096
-------------+---------------------------------------------------------
      age22p |        916    126168.3    260784.8      36079    2965990
      age25p |        916    118036.6    243417.3      32216    2784844
      age30p |        916    103497.9      211269      26595    2405324
      age35p |        916    89650.63    180717.6      21886    2052306
      age40p |        916    76409.02    152619.6      17239    1746302
-------------+---------------------------------------------------------
      age45p |        916    63745.58    126639.9      12655    1477546
      age50p |        916    51334.95    102087.6       7948    1216624
      age55p |        916    39648.62    78956.35       5674     964373
      age60p |        916    29355.17    58589.22       3663     725516
      age62p |        916    25600.25    51029.22       2766     633038
-------------+---------------------------------------------------------
      age65p |        916    20743.29    41345.17       1773     512427
      age67p |        916    17852.64    35568.45       1551     441138
      age70p |        916    14182.62    28325.84       1254     342248
      age75p |        916    9347.897    18819.67        645     216817
      age80p |        916    5688.401     11547.6        335     130989
-------------+---------------------------------------------------------
      age85p |        916    2889.979    5897.911         66      69755
SE_A0100~001 |        916     35.1821    4.291181       24.6       50.7
SE_A01004_~2 |        916    34.01616    4.196785       22.6       47.9
SE_A01004_~3 |        916    36.36736    4.516471       24.3       53.9
SE_A10008_~1 |        916    59807.63    125892.7      13733    1382293
-------------+---------------------------------------------------------
SE_A10008_~2 |        916    39932.69    75315.26      11108     823799
SE_A10008_~3 |        916    27951.93    49269.63       6628     531499
SE_A10008_~4 |        916    11980.76    26482.16       1564     301434
SE_A10008_~5 |        916    3648.503    8254.319        324      94618
SE_A10008_~6 |        916     8332.26    18266.03        689     207462
-------------+---------------------------------------------------------
SE_A10008_~7 |        916    19874.94    51407.77       1360     564674
SE_A10008_~8 |        916    9531.154    25760.24        148     280117
SE_A10008_~9 |        916    10343.79    25684.75        553     284557
SE_A10024_~1 |        916    59807.63    125892.7      13733    1382293
SE_A10024_~2 |        916    15096.33     38549.2        735     421527
-------------+---------------------------------------------------------
SE_A10024_~3 |        916    17300.22    36313.98       1692     403076
SE_A10024_~4 |        916    9897.654    19306.38       1873     215361
SE_A10024_~5 |        916    8970.667    16593.82       2029     182425
SE_A10024_~6 |        916    4719.511     8915.42        330      99146
SE_A10024_~7 |        916    2129.755    4067.194         46      45803
-------------+---------------------------------------------------------
SE_A10024_~8 |        916      1693.5    3524.961          0      46373
SE_A10002B~1 |        916     29663.5    77549.97       2803     884311
SE_A10002B~2 |        916    9096.211    27580.26         62     312521
SE_A10002B~3 |        916    7783.317    20995.76        357     244127
SE_A10002B~4 |        916    4735.536    11190.96        123     128213
-------------+---------------------------------------------------------
SE_A10002B~5 |        916    3935.258    9125.461        255     105607
SE_A10002B~6 |        916    2265.848     5283.88          0      61165
SE_A10002B~7 |        916    1048.825    2398.616          0      29418
SE_A10002B~8 |        916    798.5044    1815.214          0      23166
SE_A10022_~1 |        916    59807.63    125892.7      13733    1382293
-------------+---------------------------------------------------------
SE_A10022_~2 |        916    21300.48    39409.62       5291     442010
SE_A10022_~3 |        916     19131.4    35036.73       5008     398952
SE_A10022_~4 |        916    4114.353    7818.762        520      86499
SE_A10022_~5 |        916    4091.072    7639.721        221      93338
SE_A10022_~6 |        916    10925.98    19760.51       2784     219940
-------------+---------------------------------------------------------
SE_A10022_~7 |        916    2169.083    4486.796          0      53733
SE_A10022_~8 |        916    38507.15    87323.31       4463     994290
SE_A10005B~1 |        916     29663.5    77549.97       2803     884311
SE_A10005B~2 |        916    10775.91    24031.87       1058     273434
SE_A10005B~3 |        916    9872.098    21768.69       1058     246852
-------------+---------------------------------------------------------
SE_A10005B~4 |        916    2361.867    5011.478          0      56611
SE_A10005B~5 |        916    2413.852     5356.96         27      62495
SE_A10005B~6 |        916     5096.38    11532.48        575     133137
SE_A10005B~7 |        916    903.8111    2307.586          0      28643
SE_A10005B~8 |        916    18887.59    54167.07       1606     634764
-------------+---------------------------------------------------------
SE_A10009~01 |        916    59807.63    125892.7      13733    1382293
SE_A10009~02 |        916    21553.52    39866.05       5326     448766
SE_A10009~03 |        916    21395.89    39598.89       5291     444850
SE_A10009~04 |        916    14201.27    24580.29       3647     276971
SE_A10009~05 |        916    7194.621    15315.91        530     178596
-------------+---------------------------------------------------------
SE_A10009~06 |        916    1991.237    4279.504         35      49310
SE_A10009~07 |        916    5203.384    11069.61        315     130277
SE_A10009~08 |        916    157.6321    302.0408          0       3916
SE_A10009~09 |        916    101.3537      206.14          0       2775
SE_A1000~010 |        916    56.27838    123.7646          0       1398
-------------+---------------------------------------------------------
SE_A1000~011 |        916    38254.11    86886.51       4326     990888
SE_A1000~012 |        916     18536.8    36129.42       2668     428103
SE_A1000~013 |        916    13750.66    24962.58       1528     287846
SE_A1000~014 |        916    4786.142    11354.13        333     140257
SE_A1000~015 |        916    1657.266     4041.42         42      50490
-------------+---------------------------------------------------------
SE_A1000~016 |        916    3128.876    7338.775        215      90247
SE_A1000~017 |        916    19717.31    51153.89       1336     562785
SE_A1000~018 |        916      9429.8     25600.9        148     278989
SE_A1000~019 |        916    10287.51    25590.29        553     283796
SE_A10010_~2 |        916    36911.03    72148.14       2520     773902
-------------+---------------------------------------------------------
SE_A0300~002 |        916    16714.51    40082.04        654     453918
SE_A0300~010 |        916    10332.27     30667.9        308     364015
SE_A10023_~2 |        916    17391.27    43217.06        902     508869
SE_A10023_~3 |        916    42416.36    85161.86        641     875381
SE_A10020_~2 |        916    2260.261    5443.966          0      60222
-------------+---------------------------------------------------------
SE_A10020_~3 |        916    10516.09    24502.37        680     262650
SE_A10020_~4 |        916     12611.1    26988.57       2640     307221
SE_A10020_~5 |        916    12621.44    25543.18       2617     282155
SE_A10020_~6 |        916    5485.904     11099.6        524     128562
SE_A10020_~7 |        916    4650.064     9508.95        243     115682
-------------+---------------------------------------------------------
SE_A10020_~8 |        916    6358.986    12860.03        555     166591
SE_A10020_~9 |        916     3674.21    7483.077        145      83208
SE_A10020_~0 |        916    1629.585    3400.807          0      40582
SE_A01003B~2 |        916    2074.844    5161.153          0      57656
SE_A01003B~3 |        916    7902.563    20867.45        208     229383
-------------+---------------------------------------------------------
SE_A0100~004 |        916    6990.691    18213.89        395     199007
SE_A0100~005 |        916    5435.239    14247.17        175     169241
SE_A0100~006 |        916    1987.562    5476.138         43      68162
SE_A0100~007 |        916    1578.965    4400.831          0      58343
SE_A0100~008 |        916    1980.157    5491.153          0      73453
-------------+---------------------------------------------------------
SE_A0100~009 |        916    1128.378    3034.184          0      34697
SE_A0100~010 |        916    585.0993    1345.828          0      16806
SE_A10003_~1 |        916    3.088133    .5198755       1.81       4.77
SE_A10003B~1 |        916    3.033745    .5642811       1.58       4.81
SE_A1100~002 |        916    55281.22    131408.1      10460    1522000
-------------+---------------------------------------------------------
SE_A1100~003 |        916     65038.3      117944      16661    1289778
SE_A1100~004 |        916    3392.693    8332.163        157     102599
SE_A1100~005 |        916    7131.874    14185.35       1131     158769
SE_A1100~006 |        916     13437.8    25486.18       1613     272139
   aggIncome |        916    5.20e+09    1.08e+10   5.40e+08   1.33e+11
-------------+---------------------------------------------------------
   medIncome |        916    48087.94       17225      19355     137024
SE_A14021_~1 |        916    1.25e+09    3.46e+09   2.89e+07   4.15e+10
SE_A14023_~1 |        916    5.45e+09    1.13e+10   5.95e+08   1.40e+11
aggIncomeW~e |        916    3.54e+09    7.44e+09   1.40e+08   8.90e+10
aggIncomeL~o |        916    1.19e+09    2.64e+09   8.95e+07   3.75e+10
-------------+---------------------------------------------------------
SE_A10011_~2 |        916    49261.76    104269.1      11651    1153496
SE_A10011_~3 |        916    10545.88    21834.09        945     243822
SE_A10019_~2 |        916    46811.12    96945.79      10820    1062659
SE_A10019_~3 |        916    12996.52    29179.79       1386     330518
SE_A10016_~2 |        916    8292.581       22158       1070     270875
-------------+---------------------------------------------------------
SE_A10016_~3 |        916    51515.05    104028.4      11964    1121470
SE_A10012_~2 |        916    12550.97    25263.45        248     257766
SE_A10012_~3 |        916    47256.66    101740.3       7552    1148412
SE_A10017_~2 |        916    14050.21    26777.34       1845     316077
SE_A10017_~3 |        916    45757.42    99282.88      11247    1069091
-------------+---------------------------------------------------------
SE_A10018_~2 |        916    3544.383    8272.259         72      95961
SE_A10018_~3 |        916    56263.25    117871.5      12196    1286332
SE_A10014_~2 |        916    2176.663    5156.671          0      65522
SE_A10014_~3 |        916    57630.97    121027.6      12138    1335136
SE_A10015_~2 |        916     8379.68    13176.32        814     134670
-------------+---------------------------------------------------------
SE_A10015_~3 |        916    51427.95    113136.4      12661    1257266
SE_A10013_~2 |        916    7137.702    13449.06        852     172238
SE_A10013_~3 |        916    52669.93    112928.7      11593    1279742
    incomePC |        916    30232.66    12640.61       9104      96705
SE_A14026_~1 |        916    29438.25    10039.89      12390      77013
-------------+---------------------------------------------------------
SE_A14026_~2 |        916    54613.82    18266.55      24020     144252
SE_A14026_~3 |        916    83671.89    26545.02      36714     205113
SE_A14026_~4 |        916    127617.6    39002.23      54478     258215
SE_A14026_~5 |        916      201582    47948.96      92911     702742
   meanQ1Inc |        916    16225.22     5582.06       4260      39876
-------------+---------------------------------------------------------
   meanQ2Inc |        916     41828.4    14082.53      18653     102127
   meanQ3Inc |        916    68421.43    22295.28      30106     174713
   meanQ4Inc |        916    103524.7    32662.32      44835     273609
   meanQ5Inc |        916      203393    73701.89      84283     648477
   mean5pInc |        916    327504.8    138158.9     125111    1113883
-------------+---------------------------------------------------------
SE_A14025_~1 |        916    3.803712    .7990773       1.23       6.35
SE_A14025_~2 |        916    9.679847    1.202225       5.93       13.2
SE_A14025_~3 |        916    15.81321    1.246792      11.47       18.6
SE_A14025_~4 |        916    23.96607    1.031772       19.6      26.73
SE_A14025_~5 |        916    46.73648    3.684071      38.72      59.45
-------------+---------------------------------------------------------
SE_A1402~006 |        916    18.67197    3.058894       11.9       30.6
        gini |        916     .429694    .0417154       .329       .562
SE_A1006~001 |        916    59807.63    125892.7      13733    1382293
SE_A1006~002 |        916    30144.13    49380.26       4564     509223
SE_A1006~003 |        916     29663.5    77549.97       2803     884311
-------------+---------------------------------------------------------
SE_A10044_~1 |        916    64041.42    135518.2      14259    1502686
SE_A10044_~2 |        916    59807.63    125892.7      13733    1382293
SE_A10044_~3 |        916    4233.785    9851.108         85     120393
SE_A10032~02 |        911    37819.12    62471.84       9324     651446
SE_A10032_~3 |        911    33013.74    53544.33       8080     559550
-------------+---------------------------------------------------------
SE_A10032_~4 |        911     4805.38    9941.133         69      91896
SE_A10032_~5 |        911    1795.029    5179.518          0      45061
SE_A10032_~6 |        911     4166.83    8923.393          0      94650
SE_A10032_~7 |        911    4805.797    12334.29         99     130743
SE_A1003~008 |        911    4269.525    13029.54          0     146128
-------------+---------------------------------------------------------
SE_A1003~009 |        911    4181.596    17115.11          0     197922
SE_A1003~010 |        911    5715.811    19048.23          0     233940
SE_A1003~011 |        911    1456.201    1699.426          0      11772
SE_A1003~012 |        911    44.20527     101.011          0       1120
SE_A10050_~2 |        916    2591.517    11391.29          0     142831
-------------+---------------------------------------------------------
SE_A10050_~3 |        916    9719.433    30911.35        312     350902
SE_A10050_~4 |        916    17031.83    39652.46       1876     437230
SE_A10050_~5 |        916    18430.49    29818.16       3279     316153
SE_A10050_~6 |        916    9590.354    13198.34        347     125930
SE_A10050_~7 |        916    2444.009    3937.987          0      41120
-------------+---------------------------------------------------------
SE_A10042B~2 |        916    2419.188    10975.79          0     137934
SE_A10042B~3 |        916    8910.191    28810.37        209     328041
SE_A1004~004 |        916    11268.61    27178.68        724     311886
SE_A1004~005 |        916    5133.051     8899.62        380      99822
SE_A1004~006 |        916     1587.37    2413.578          0      24152
-------------+---------------------------------------------------------
SE_A1004~007 |        916    345.0841    640.7017          0       6619
SE_A1005~001 |        916    1974.105    12.35123       1939       2001
medianHome~e |        916    491358.3    244710.8     112900    2000001
SE_A1800~001 |        916    33.56081    4.297113       21.7         51
     aggRent |        916    3.97e+07    1.03e+08    4149900   1.37e+09
-------------+---------------------------------------------------------
   move2005p |        916    1426.729    406.7939        756       3324
 move2000t04 |        916    1309.324    371.9061        640       3058
SE_A1003~001 |        916    24.54738    3.381736       15.2       37.1
SE_A10037_~2 |        916    28.30884    3.794825       19.4       44.4
SE_A10037_~3 |        916    11.05382    1.799938        6.7       19.7
-------------+---------------------------------------------------------
SE_A10027~02 |        916    171.5371     361.937          0       4382
SE_A10027~03 |        916     525.012    881.3026          0      10053
SE_A10027~04 |        916    1557.764    3237.034          0      35470
SE_A10027~05 |        916    1617.204    2868.789         64      34662
SE_A10027_~6 |        916    1675.789    3285.396          0      43420
-------------+---------------------------------------------------------
SE_A10027_~7 |        916     1765.43    3877.731          0      59015
SE_A10027_~8 |        916     1944.04    4895.084         64      81622
SE_A10027_~9 |        916    2318.531    6149.208         81      92537
SE_A10027_~0 |        916    2712.483    7054.373         77      96284
SE_A1002~011 |        916    2963.698    7580.994         61      91376
-------------+---------------------------------------------------------
SE_A1002~012 |        916    13515.11    30327.12        953     357699
SE_A1002~013 |        916    10205.06    20109.23       1507     270504
SE_A1002~014 |        916    14176.25    30164.99        277     353979
SE_A1002~015 |        916    2039.004    6433.414          0     117604
SE_A13003A~1 |        914     43224.1    80979.66       9326     945831
-------------+---------------------------------------------------------
SE_A13003A~2 |        914    9070.627    23508.91         35     289822
SE_A13003A~3 |        914    34153.48    58528.71       7066     685418
SE_A13003B~1 |        914    114503.4    237418.9      32042    2621635
SE_A13003B~2 |        914    15857.24     41778.4        651     523603
SE_A13003B~3 |        914    98646.17    196780.8      26821    2238081
-------------+---------------------------------------------------------
SE_A13003C~1 |        914    20274.31     40413.2       1773     501821
SE_A13003C~2 |        914    2199.272    6015.087          0      81291
SE_A13003C~3 |        914    18075.04    34540.14       1588     420530
nWorkersOu~e |        916    78800.05    163640.6      18798    1876407
   travel0t9 |        916    6997.873    11602.15        759     132967
-------------+---------------------------------------------------------
 travel10t19 |        916    22545.57    40796.68       2868     414990
 travel20t29 |        916     16387.2    35033.39       1540     356687
 travel30t39 |        916    14325.03    36153.96        825     445196
 travel40t59 |        916    9810.255    23761.29        345     310047
 travel60t89 |        916    6047.451    14555.51        240     198499
-------------+---------------------------------------------------------
   travel90p |        916    2686.672    5381.125        108      74162
SE_A0900~002 |        916    1243.353    2281.084          0      29650
SE_A0900~003 |        916    15990.98    26805.12       1954     286625
SE_A0900~004 |        916    28696.31    58258.45       3714     583860
SE_A0900~005 |        916    17596.67    44309.82        952     556524
-------------+---------------------------------------------------------
SE_A0900~006 |        916    6538.611       15569        291     198719
SE_A0900~007 |        916    6047.451    14555.51        240     198499
SE_A0900~008 |        916    2686.672    5381.125        108      74162
SE_A10030_~3 |        916    17807.57    46110.45        417     533611
SE_A10030_~4 |        916    21549.34     42591.1       3025     527047
-------------+---------------------------------------------------------
SE_A10030_~5 |        916    10441.91    20850.61        937     432708
SE_A10030_~6 |        916    3788.422    6990.936        304     138781
SE_A10030_~7 |        916    1541.638    2760.061          0      45340
SE_A10054B~2 |        916    4441.971    15628.45         40     164366
SE_A10054B~3 |        916    12884.41    36286.89        680     410344
-------------+---------------------------------------------------------
SE_A10054B~4 |        916    9116.854     20961.4       1047     244892
SE_A10054B~5 |        916    2302.313    4554.849         76      63909
SE_A10054B~6 |        916    661.8231    1238.515          0      16471
SE_A10054B~7 |        916    256.1299    540.3996          0       5826
SE_A1600~001 |        916    136409.2    281810.1      41150    3184818
-------------+---------------------------------------------------------
SE_A1600~002 |        916    7741.591    12451.44        462     123404
SE_A1600~003 |        916    4306.903    7186.225        245      71510
SE_A1600~004 |        916    3434.688    5501.369         53      59706
SE_A1600~005 |        916    128667.7    270895.2      40226    3101274
SE_A1600~006 |        916    111359.1    235018.1      28590    2630456
-------------+---------------------------------------------------------
SE_A1600~007 |        916     17308.6    36249.49       1720     470818
SE_A0600~002 |        916    126699.3      229009      29604    2504061
SE_A0600~003 |        916    53954.91    137303.8       3356    1507032
SE_A0600~004 |        916     25777.6     61652.3       1888     717605
SE_A0600~005 |        916    28177.31    76848.31       1399     927913
-------------+---------------------------------------------------------
SE_A0500~002 |        916    164193.3    333298.3      52517    3626396
SE_A0500~003 |        916    128250.1    273799.8      28184    3149198
SE_A0500~004 |        916    35943.14    62324.97       1052     704680
SE_A10048_~1 |        916    59807.63    125892.7      13733    1382293
SE_A10048_~2 |        916    59500.56    124993.8      13606    1374156
-------------+---------------------------------------------------------
SE_A10048_~3 |        916     59049.9    123555.5      13529    1357254
          id |        916    741.4716    391.3515         11       1347
       year1 |        916    .1310044    .3375895          0          1
       year2 |        916    .1320961    .3387802          0          1
       year3 |        916    .1386463    .3457658          0          1
-------------+---------------------------------------------------------
       year4 |        916    .1451965    .3524913          0          1
       year5 |        916    .1473799    .3546779          0          1
       year6 |        916    .1495633    .3568377          0          1
       year7 |        916    .1561135    .3631612          0          1
         pop |        916    180654.3    363568.8      61628    3990469
-------------+---------------------------------------------------------
pforeignBorn |        916    .2716778    .1073089   .0377028   .5702659
pHousingOw~s |        916    1.885716    .4509502   1.156321   4.690825
    povertyR |        914    .1243843    .0608773    .014142   .4012956
    turnoutR |        916    .6269852    .1549603   .1963706   .9275579

. outreg2 using sum3.doc, replace sum(log)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
          v1 |        916       458.5    264.5707          1        916
          yr |        916    2012.238    3.993453       2006       2018
        area |        916    37.39931    52.86487       3.58     468.67
       count |        916    18157.74    55162.11        290     827884
       nIndv |        916    16913.86    52944.38        252     816704
-------------+---------------------------------------------------------
       nCorp |        916    461.3144    1723.238          0      16809
   nIndvTech |        916    2207.766    6605.661         17      90506
nIndvBigTech |        916    230.2707    878.1833          0      11875
nCorpBigTech |        916    34.14301    219.7305          0       5636
     nDemRec |        916    8388.961    30437.51         39     584847
-------------+---------------------------------------------------------
     nRepRec |        916    1262.763    2994.415          8      35343
     nIndRec |        916     174.524    943.6569          0      19914
     nComRec |        916    11884.72    35654.84        208     570116
        nGen |        916    .0516325    .0794892          0   .4287886
        aTot |        916    1.05e+07    5.05e+07    9281.52   7.56e+08
-------------+---------------------------------------------------------
       aIndv |        916     4155823    1.96e+07    9281.52   2.44e+08
       aCorp |        916     2120046    1.40e+07          0   3.03e+08
aIndvBigTech |        916    44765.71    211525.8          0    2588553
   aIndvTech |        916    397685.9     1555937  -100062.7   2.00e+07
   aCorpTech |        916     18552.9    100756.9          0    1393362
-------------+---------------------------------------------------------
     aDemRec |        916     2754981    1.31e+07    2348.87   1.43e+08
     aRepRec |        916     1547762     5888238     722.33   7.36e+07
     aIndRec |        916    527228.2     5721098       -229   1.32e+08
     aComRec |        916     7615108    3.90e+07    5737.24   6.27e+08
        aGen |        916    395682.8     3223072      -2426   6.96e+07
-------------+---------------------------------------------------------
  meanCFCont |        916    -.616101    .4375725  -1.616288   .9070293
    sdCFCont |        916     .914756    .1860118   .3509596   1.542066
  meanCFCand |        916   -.3909635    .3481433  -1.209661    .888126
    sdCFCand |        916   -.3909635    .3481433  -1.209661    .888126
  meanCFDiff |        916   -.0461534    .0287026  -.1629603   .0566457
-------------+---------------------------------------------------------
    sdCFDiff |        916    .2703547    .0672823   .0820338   .4856243
        vReg |        916     2173372     2896623     367929   3.41e+07
       vTurn |        916     1360646     1829689     109896   2.10e+07
      popDen |        916    134171.1    320572.9   931.4459    3990469
SE_A0000~001 |        916    41.11603    59.37352   3.509351   502.7275
-------------+---------------------------------------------------------
SE_A0000~002 |        916    37.00905    52.75691   3.509351   469.0747
SE_A0000~003 |        916    4.106976    17.43041          0   185.2223
SE_A0200~002 |        916    89591.42      181016      28998    1995286
SE_A0200~003 |        916    6327.404    12318.21        687     146203
SE_A0200~004 |        916    6069.682    11271.54        930     126660
-------------+---------------------------------------------------------
SE_A0200~005 |        916    6206.447    11356.93        819     139548
SE_A0200~006 |        916    3799.626    6931.908        471      80257
SE_A0200~007 |        916    9612.189    20265.85        914     220136
SE_A0200~008 |        916    14552.53    32526.61       1952     379769
SE_A0200~009 |        916    13075.36    28037.29       2312     310757
-------------+---------------------------------------------------------
SE_A0200~010 |        916    11964.36    24137.62       2103     271871
SE_A0200~011 |        916    9087.719    17993.79       1160     217902
SE_A0200~012 |        916    5200.976    10216.88        392     134233
SE_A0200~013 |        916    2709.462    5428.512        143      60615
SE_A0200~014 |        916    985.6616    2086.801          0      25545
-------------+---------------------------------------------------------
SE_A0200~015 |        916    91062.83    182588.8      29179    2015652
SE_A0200~016 |        916    6052.191    11808.43        446     141681
SE_A0200~017 |        916    5814.074    10900.86        886     125335
SE_A0200~018 |        916    5902.563    10954.66        925     130407
SE_A0200~019 |        916    3621.366    6733.925        401      79058
-------------+---------------------------------------------------------
SE_A0200~020 |        916     9212.14    19504.41        835     215226
SE_A0200~021 |        916    13833.41    30419.29       1619     352769
SE_A0200~022 |        916    12829.68    26351.45       2842     291218
SE_A0200~023 |        916     12132.6    23827.41       2897     264747
SE_A0200~024 |        916     9817.61    19721.23       1107     234044
-------------+---------------------------------------------------------
SE_A0200~025 |        916    6194.416     12429.3        662     161377
SE_A0200~026 |        916    3748.456    7555.982        228      86447
SE_A0200~027 |        916    1904.318    3827.963          0      45432
       age5p |        916    168274.7    339751.1      56206    3761915
      age10p |        916    156390.9    317873.6      50106    3543111
-------------+---------------------------------------------------------
      age15p |        916    144281.9    295986.9      44794    3316437
      age18p |        916    136860.9    282633.3      41150    3185786
      age20p |        916    131698.4    272229.1      38621    3080797
      age21p |        916    128909.9    266453.2      37006    3022096
      age22p |        916    126168.3    260784.8      36079    2965990
-------------+---------------------------------------------------------
      age25p |        916    118036.6    243417.3      32216    2784844
      age30p |        916    103497.9      211269      26595    2405324
      age35p |        916    89650.63    180717.6      21886    2052306
      age40p |        916    76409.02    152619.6      17239    1746302
      age45p |        916    63745.58    126639.9      12655    1477546
-------------+---------------------------------------------------------
      age50p |        916    51334.95    102087.6       7948    1216624
      age55p |        916    39648.62    78956.35       5674     964373
      age60p |        916    29355.17    58589.22       3663     725516
      age62p |        916    25600.25    51029.22       2766     633038
      age65p |        916    20743.29    41345.17       1773     512427
-------------+---------------------------------------------------------
      age67p |        916    17852.64    35568.45       1551     441138
      age70p |        916    14182.62    28325.84       1254     342248
      age75p |        916    9347.897    18819.67        645     216817
      age80p |        916    5688.401     11547.6        335     130989
      age85p |        916    2889.979    5897.911         66      69755
-------------+---------------------------------------------------------
SE_A0100~001 |        916     35.1821    4.291181       24.6       50.7
SE_A01004_~2 |        916    34.01616    4.196785       22.6       47.9
SE_A01004_~3 |        916    36.36736    4.516471       24.3       53.9
SE_A10008_~1 |        916    59807.63    125892.7      13733    1382293
SE_A10008_~2 |        916    39932.69    75315.26      11108     823799
-------------+---------------------------------------------------------
SE_A10008_~3 |        916    27951.93    49269.63       6628     531499
SE_A10008_~4 |        916    11980.76    26482.16       1564     301434
SE_A10008_~5 |        916    3648.503    8254.319        324      94618
SE_A10008_~6 |        916     8332.26    18266.03        689     207462
SE_A10008_~7 |        916    19874.94    51407.77       1360     564674
-------------+---------------------------------------------------------
SE_A10008_~8 |        916    9531.154    25760.24        148     280117
SE_A10008_~9 |        916    10343.79    25684.75        553     284557
SE_A10024_~1 |        916    59807.63    125892.7      13733    1382293
SE_A10024_~2 |        916    15096.33     38549.2        735     421527
SE_A10024_~3 |        916    17300.22    36313.98       1692     403076
-------------+---------------------------------------------------------
SE_A10024_~4 |        916    9897.654    19306.38       1873     215361
SE_A10024_~5 |        916    8970.667    16593.82       2029     182425
SE_A10024_~6 |        916    4719.511     8915.42        330      99146
SE_A10024_~7 |        916    2129.755    4067.194         46      45803
SE_A10024_~8 |        916      1693.5    3524.961          0      46373
-------------+---------------------------------------------------------
SE_A10002B~1 |        916     29663.5    77549.97       2803     884311
SE_A10002B~2 |        916    9096.211    27580.26         62     312521
SE_A10002B~3 |        916    7783.317    20995.76        357     244127
SE_A10002B~4 |        916    4735.536    11190.96        123     128213
SE_A10002B~5 |        916    3935.258    9125.461        255     105607
-------------+---------------------------------------------------------
SE_A10002B~6 |        916    2265.848     5283.88          0      61165
SE_A10002B~7 |        916    1048.825    2398.616          0      29418
SE_A10002B~8 |        916    798.5044    1815.214          0      23166
SE_A10022_~1 |        916    59807.63    125892.7      13733    1382293
SE_A10022_~2 |        916    21300.48    39409.62       5291     442010
-------------+---------------------------------------------------------
SE_A10022_~3 |        916     19131.4    35036.73       5008     398952
SE_A10022_~4 |        916    4114.353    7818.762        520      86499
SE_A10022_~5 |        916    4091.072    7639.721        221      93338
SE_A10022_~6 |        916    10925.98    19760.51       2784     219940
SE_A10022_~7 |        916    2169.083    4486.796          0      53733
-------------+---------------------------------------------------------
SE_A10022_~8 |        916    38507.15    87323.31       4463     994290
SE_A10005B~1 |        916     29663.5    77549.97       2803     884311
SE_A10005B~2 |        916    10775.91    24031.87       1058     273434
SE_A10005B~3 |        916    9872.098    21768.69       1058     246852
SE_A10005B~4 |        916    2361.867    5011.478          0      56611
-------------+---------------------------------------------------------
SE_A10005B~5 |        916    2413.852     5356.96         27      62495
SE_A10005B~6 |        916     5096.38    11532.48        575     133137
SE_A10005B~7 |        916    903.8111    2307.586          0      28643
SE_A10005B~8 |        916    18887.59    54167.07       1606     634764
SE_A10009~01 |        916    59807.63    125892.7      13733    1382293
-------------+---------------------------------------------------------
SE_A10009~02 |        916    21553.52    39866.05       5326     448766
SE_A10009~03 |        916    21395.89    39598.89       5291     444850
SE_A10009~04 |        916    14201.27    24580.29       3647     276971
SE_A10009~05 |        916    7194.621    15315.91        530     178596
SE_A10009~06 |        916    1991.237    4279.504         35      49310
-------------+---------------------------------------------------------
SE_A10009~07 |        916    5203.384    11069.61        315     130277
SE_A10009~08 |        916    157.6321    302.0408          0       3916
SE_A10009~09 |        916    101.3537      206.14          0       2775
SE_A1000~010 |        916    56.27838    123.7646          0       1398
SE_A1000~011 |        916    38254.11    86886.51       4326     990888
-------------+---------------------------------------------------------
SE_A1000~012 |        916     18536.8    36129.42       2668     428103
SE_A1000~013 |        916    13750.66    24962.58       1528     287846
SE_A1000~014 |        916    4786.142    11354.13        333     140257
SE_A1000~015 |        916    1657.266     4041.42         42      50490
SE_A1000~016 |        916    3128.876    7338.775        215      90247
-------------+---------------------------------------------------------
SE_A1000~017 |        916    19717.31    51153.89       1336     562785
SE_A1000~018 |        916      9429.8     25600.9        148     278989
SE_A1000~019 |        916    10287.51    25590.29        553     283796
SE_A10010_~2 |        916    36911.03    72148.14       2520     773902
SE_A0300~002 |        916    16714.51    40082.04        654     453918
-------------+---------------------------------------------------------
SE_A0300~010 |        916    10332.27     30667.9        308     364015
SE_A10023_~2 |        916    17391.27    43217.06        902     508869
SE_A10023_~3 |        916    42416.36    85161.86        641     875381
SE_A10020_~2 |        916    2260.261    5443.966          0      60222
SE_A10020_~3 |        916    10516.09    24502.37        680     262650
-------------+---------------------------------------------------------
SE_A10020_~4 |        916     12611.1    26988.57       2640     307221
SE_A10020_~5 |        916    12621.44    25543.18       2617     282155
SE_A10020_~6 |        916    5485.904     11099.6        524     128562
SE_A10020_~7 |        916    4650.064     9508.95        243     115682
SE_A10020_~8 |        916    6358.986    12860.03        555     166591
-------------+---------------------------------------------------------
SE_A10020_~9 |        916     3674.21    7483.077        145      83208
SE_A10020_~0 |        916    1629.585    3400.807          0      40582
SE_A01003B~2 |        916    2074.844    5161.153          0      57656
SE_A01003B~3 |        916    7902.563    20867.45        208     229383
SE_A0100~004 |        916    6990.691    18213.89        395     199007
-------------+---------------------------------------------------------
SE_A0100~005 |        916    5435.239    14247.17        175     169241
SE_A0100~006 |        916    1987.562    5476.138         43      68162
SE_A0100~007 |        916    1578.965    4400.831          0      58343
SE_A0100~008 |        916    1980.157    5491.153          0      73453
SE_A0100~009 |        916    1128.378    3034.184          0      34697
-------------+---------------------------------------------------------
SE_A0100~010 |        916    585.0993    1345.828          0      16806
SE_A10003_~1 |        916    3.088133    .5198755       1.81       4.77
SE_A10003B~1 |        916    3.033745    .5642811       1.58       4.81
SE_A1100~002 |        916    55281.22    131408.1      10460    1522000
SE_A1100~003 |        916     65038.3      117944      16661    1289778
-------------+---------------------------------------------------------
SE_A1100~004 |        916    3392.693    8332.163        157     102599
SE_A1100~005 |        916    7131.874    14185.35       1131     158769
SE_A1100~006 |        916     13437.8    25486.18       1613     272139
   aggIncome |        916    5.20e+09    1.08e+10   5.40e+08   1.33e+11
   medIncome |        916    48087.94       17225      19355     137024
-------------+---------------------------------------------------------
SE_A14021_~1 |        916    1.25e+09    3.46e+09   2.89e+07   4.15e+10
SE_A14023_~1 |        916    5.45e+09    1.13e+10   5.95e+08   1.40e+11
aggIncomeW~e |        916    3.54e+09    7.44e+09   1.40e+08   8.90e+10
aggIncomeL~o |        916    1.19e+09    2.64e+09   8.95e+07   3.75e+10
SE_A10011_~2 |        916    49261.76    104269.1      11651    1153496
-------------+---------------------------------------------------------
SE_A10011_~3 |        916    10545.88    21834.09        945     243822
SE_A10019_~2 |        916    46811.12    96945.79      10820    1062659
SE_A10019_~3 |        916    12996.52    29179.79       1386     330518
SE_A10016_~2 |        916    8292.581       22158       1070     270875
SE_A10016_~3 |        916    51515.05    104028.4      11964    1121470
-------------+---------------------------------------------------------
SE_A10012_~2 |        916    12550.97    25263.45        248     257766
SE_A10012_~3 |        916    47256.66    101740.3       7552    1148412
SE_A10017_~2 |        916    14050.21    26777.34       1845     316077
SE_A10017_~3 |        916    45757.42    99282.88      11247    1069091
SE_A10018_~2 |        916    3544.383    8272.259         72      95961
-------------+---------------------------------------------------------
SE_A10018_~3 |        916    56263.25    117871.5      12196    1286332
SE_A10014_~2 |        916    2176.663    5156.671          0      65522
SE_A10014_~3 |        916    57630.97    121027.6      12138    1335136
SE_A10015_~2 |        916     8379.68    13176.32        814     134670
SE_A10015_~3 |        916    51427.95    113136.4      12661    1257266
-------------+---------------------------------------------------------
SE_A10013_~2 |        916    7137.702    13449.06        852     172238
SE_A10013_~3 |        916    52669.93    112928.7      11593    1279742
    incomePC |        916    30232.66    12640.61       9104      96705
SE_A14026_~1 |        916    29438.25    10039.89      12390      77013
SE_A14026_~2 |        916    54613.82    18266.55      24020     144252
-------------+---------------------------------------------------------
SE_A14026_~3 |        916    83671.89    26545.02      36714     205113
SE_A14026_~4 |        916    127617.6    39002.23      54478     258215
SE_A14026_~5 |        916      201582    47948.96      92911     702742
   meanQ1Inc |        916    16225.22     5582.06       4260      39876
   meanQ2Inc |        916     41828.4    14082.53      18653     102127
-------------+---------------------------------------------------------
   meanQ3Inc |        916    68421.43    22295.28      30106     174713
   meanQ4Inc |        916    103524.7    32662.32      44835     273609
   meanQ5Inc |        916      203393    73701.89      84283     648477
   mean5pInc |        916    327504.8    138158.9     125111    1113883
SE_A14025_~1 |        916    3.803712    .7990773       1.23       6.35
-------------+---------------------------------------------------------
SE_A14025_~2 |        916    9.679847    1.202225       5.93       13.2
SE_A14025_~3 |        916    15.81321    1.246792      11.47       18.6
SE_A14025_~4 |        916    23.96607    1.031772       19.6      26.73
SE_A14025_~5 |        916    46.73648    3.684071      38.72      59.45
SE_A1402~006 |        916    18.67197    3.058894       11.9       30.6
-------------+---------------------------------------------------------
        gini |        916     .429694    .0417154       .329       .562
SE_A1006~001 |        916    59807.63    125892.7      13733    1382293
SE_A1006~002 |        916    30144.13    49380.26       4564     509223
SE_A1006~003 |        916     29663.5    77549.97       2803     884311
SE_A10044_~1 |        916    64041.42    135518.2      14259    1502686
-------------+---------------------------------------------------------
SE_A10044_~2 |        916    59807.63    125892.7      13733    1382293
SE_A10044_~3 |        916    4233.785    9851.108         85     120393
SE_A10032~02 |        911    37819.12    62471.84       9324     651446
SE_A10032_~3 |        911    33013.74    53544.33       8080     559550
SE_A10032_~4 |        911     4805.38    9941.133         69      91896
-------------+---------------------------------------------------------
SE_A10032_~5 |        911    1795.029    5179.518          0      45061
SE_A10032_~6 |        911     4166.83    8923.393          0      94650
SE_A10032_~7 |        911    4805.797    12334.29         99     130743
SE_A1003~008 |        911    4269.525    13029.54          0     146128
SE_A1003~009 |        911    4181.596    17115.11          0     197922
-------------+---------------------------------------------------------
SE_A1003~010 |        911    5715.811    19048.23          0     233940
SE_A1003~011 |        911    1456.201    1699.426          0      11772
SE_A1003~012 |        911    44.20527     101.011          0       1120
SE_A10050_~2 |        916    2591.517    11391.29          0     142831
SE_A10050_~3 |        916    9719.433    30911.35        312     350902
-------------+---------------------------------------------------------
SE_A10050_~4 |        916    17031.83    39652.46       1876     437230
SE_A10050_~5 |        916    18430.49    29818.16       3279     316153
SE_A10050_~6 |        916    9590.354    13198.34        347     125930
SE_A10050_~7 |        916    2444.009    3937.987          0      41120
SE_A10042B~2 |        916    2419.188    10975.79          0     137934
-------------+---------------------------------------------------------
SE_A10042B~3 |        916    8910.191    28810.37        209     328041
SE_A1004~004 |        916    11268.61    27178.68        724     311886
SE_A1004~005 |        916    5133.051     8899.62        380      99822
SE_A1004~006 |        916     1587.37    2413.578          0      24152
SE_A1004~007 |        916    345.0841    640.7017          0       6619
-------------+---------------------------------------------------------
SE_A1005~001 |        916    1974.105    12.35123       1939       2001
medianHome~e |        916    491358.3    244710.8     112900    2000001
SE_A1800~001 |        916    33.56081    4.297113       21.7         51
     aggRent |        916    3.97e+07    1.03e+08    4149900   1.37e+09
   move2005p |        916    1426.729    406.7939        756       3324
-------------+---------------------------------------------------------
 move2000t04 |        916    1309.324    371.9061        640       3058
SE_A1003~001 |        916    24.54738    3.381736       15.2       37.1
SE_A10037_~2 |        916    28.30884    3.794825       19.4       44.4
SE_A10037_~3 |        916    11.05382    1.799938        6.7       19.7
SE_A10027~02 |        916    171.5371     361.937          0       4382
-------------+---------------------------------------------------------
SE_A10027~03 |        916     525.012    881.3026          0      10053
SE_A10027~04 |        916    1557.764    3237.034          0      35470
SE_A10027~05 |        916    1617.204    2868.789         64      34662
SE_A10027_~6 |        916    1675.789    3285.396          0      43420
SE_A10027_~7 |        916     1765.43    3877.731          0      59015
-------------+---------------------------------------------------------
SE_A10027_~8 |        916     1944.04    4895.084         64      81622
SE_A10027_~9 |        916    2318.531    6149.208         81      92537
SE_A10027_~0 |        916    2712.483    7054.373         77      96284
SE_A1002~011 |        916    2963.698    7580.994         61      91376
SE_A1002~012 |        916    13515.11    30327.12        953     357699
-------------+---------------------------------------------------------
SE_A1002~013 |        916    10205.06    20109.23       1507     270504
SE_A1002~014 |        916    14176.25    30164.99        277     353979
SE_A1002~015 |        916    2039.004    6433.414          0     117604
SE_A13003A~1 |        914     43224.1    80979.66       9326     945831
SE_A13003A~2 |        914    9070.627    23508.91         35     289822
-------------+---------------------------------------------------------
SE_A13003A~3 |        914    34153.48    58528.71       7066     685418
SE_A13003B~1 |        914    114503.4    237418.9      32042    2621635
SE_A13003B~2 |        914    15857.24     41778.4        651     523603
SE_A13003B~3 |        914    98646.17    196780.8      26821    2238081
SE_A13003C~1 |        914    20274.31     40413.2       1773     501821
-------------+---------------------------------------------------------
SE_A13003C~2 |        914    2199.272    6015.087          0      81291
SE_A13003C~3 |        914    18075.04    34540.14       1588     420530
nWorkersOu~e |        916    78800.05    163640.6      18798    1876407
   travel0t9 |        916    6997.873    11602.15        759     132967
 travel10t19 |        916    22545.57    40796.68       2868     414990
-------------+---------------------------------------------------------
 travel20t29 |        916     16387.2    35033.39       1540     356687
 travel30t39 |        916    14325.03    36153.96        825     445196
 travel40t59 |        916    9810.255    23761.29        345     310047
 travel60t89 |        916    6047.451    14555.51        240     198499
   travel90p |        916    2686.672    5381.125        108      74162
-------------+---------------------------------------------------------
SE_A0900~002 |        916    1243.353    2281.084          0      29650
SE_A0900~003 |        916    15990.98    26805.12       1954     286625
SE_A0900~004 |        916    28696.31    58258.45       3714     583860
SE_A0900~005 |        916    17596.67    44309.82        952     556524
SE_A0900~006 |        916    6538.611       15569        291     198719
-------------+---------------------------------------------------------
SE_A0900~007 |        916    6047.451    14555.51        240     198499
SE_A0900~008 |        916    2686.672    5381.125        108      74162
SE_A10030_~3 |        916    17807.57    46110.45        417     533611
SE_A10030_~4 |        916    21549.34     42591.1       3025     527047
SE_A10030_~5 |        916    10441.91    20850.61        937     432708
-------------+---------------------------------------------------------
SE_A10030_~6 |        916    3788.422    6990.936        304     138781
SE_A10030_~7 |        916    1541.638    2760.061          0      45340
SE_A10054B~2 |        916    4441.971    15628.45         40     164366
SE_A10054B~3 |        916    12884.41    36286.89        680     410344
SE_A10054B~4 |        916    9116.854     20961.4       1047     244892
-------------+---------------------------------------------------------
SE_A10054B~5 |        916    2302.313    4554.849         76      63909
SE_A10054B~6 |        916    661.8231    1238.515          0      16471
SE_A10054B~7 |        916    256.1299    540.3996          0       5826
SE_A1600~001 |        916    136409.2    281810.1      41150    3184818
SE_A1600~002 |        916    7741.591    12451.44        462     123404
-------------+---------------------------------------------------------
SE_A1600~003 |        916    4306.903    7186.225        245      71510
SE_A1600~004 |        916    3434.688    5501.369         53      59706
SE_A1600~005 |        916    128667.7    270895.2      40226    3101274
SE_A1600~006 |        916    111359.1    235018.1      28590    2630456
SE_A1600~007 |        916     17308.6    36249.49       1720     470818
-------------+---------------------------------------------------------
SE_A0600~002 |        916    126699.3      229009      29604    2504061
SE_A0600~003 |        916    53954.91    137303.8       3356    1507032
SE_A0600~004 |        916     25777.6     61652.3       1888     717605
SE_A0600~005 |        916    28177.31    76848.31       1399     927913
SE_A0500~002 |        916    164193.3    333298.3      52517    3626396
-------------+---------------------------------------------------------
SE_A0500~003 |        916    128250.1    273799.8      28184    3149198
SE_A0500~004 |        916    35943.14    62324.97       1052     704680
SE_A10048_~1 |        916    59807.63    125892.7      13733    1382293
SE_A10048_~2 |        916    59500.56    124993.8      13606    1374156
SE_A10048_~3 |        916     59049.9    123555.5      13529    1357254
-------------+---------------------------------------------------------
          id |        916    741.4716    391.3515         11       1347
       year1 |        916    .1310044    .3375895          0          1
       year2 |        916    .1320961    .3387802          0          1
       year3 |        916    .1386463    .3457658          0          1
       year4 |        916    .1451965    .3524913          0          1
-------------+---------------------------------------------------------
       year5 |        916    .1473799    .3546779          0          1
       year6 |        916    .1495633    .3568377          0          1
       year7 |        916    .1561135    .3631612          0          1
         pop |        916    180654.3    363568.8      61628    3990469
pforeignBorn |        916    .2716778    .1073089   .0377028   .5702659
-------------+---------------------------------------------------------
pHousingOw~s |        916    1.885716    .4509502   1.156321   4.690825
    povertyR |        914    .1243843    .0608773    .014142   .4012956
    turnoutR |        916    .6269852    .1549603   .1963706   .9275579

Following variable is string, not included:  
NAMELSAD  
sum3.doc
dir : seeout

. 
. //rVote and rReg are regularly greater than 1, which obviously is not possible and implies either
. // ACS undercounting or voting data issues (potentially also people voting outside their precincts)
. 
. //nCorp nIndvTech nIndvBigTech nCorpBigTech count nDemRec nRepRec nIndRec nComRec aTot aCorp aIndvBigTech aIndvTech aCorpTech aDemRec aRepRec aIndRec aComRec meanCFCont meanCFCand meanCFDiff pop popDen gini incomePC pforeignBorn medIncome
>  aggIncome pHousingOwners povertyR nWorkersOutside travel0t9 travel10t19 travel20t29 travel30t39 travel40t59 travel60t89 travel90p aggIncomeWhite aggIncomeLatino move2005p move2000t04 medianHomeValue aggRent meanQ1Inc meanQ2Inc meanQ3Inc 
> meanQ4Inc meanQ5Inc mean5pInc age5p age10p age15p age18p age20p age21p age22p age25p age30p age35p age40p age45p age50p age55p age60p age62p age65p age67p age70p age75p age80p age85p year*
. 
. xtreg nIndv nCorp aCorp year*, fe vce(cluster id)
note: year7 omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =        916
Group variable: id                              Number of groups  =        143

R-sq:                                           Obs per group:
     within  = 0.3790                                         min =          1
     between = 0.6383                                         avg =        6.4
     overall = 0.1894                                         max =          7

                                                F(8,142)          =      12.83
corr(u_i, Xb)  = -0.7801                        Prob > F          =     0.0000

                                   (Std. Err. adjusted for 143 clusters in id)
------------------------------------------------------------------------------
             |               Robust
       nIndv |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       nCorp |  -19.77432   9.504428    -2.08   0.039    -38.56278   -.9858674
       aCorp |    .000397   .0001108     3.58   0.000      .000178     .000616
       year1 |  -6672.491   4284.006    -1.56   0.122    -15141.16    1796.179
       year2 |  -2535.958   3409.179    -0.74   0.458     -9275.26    4203.344
       year3 |  -5137.472   3042.577    -1.69   0.094    -11152.07     877.128
       year4 |     5960.5   4418.235     1.35   0.179    -2773.515    14694.52
       year5 |   2053.287   3543.621     0.58   0.563    -4951.783    9058.356
       year6 |   8748.805    2616.17     3.34   0.001     3577.131    13920.48
       year7 |          0  (omitted)
       _cons |   24639.31   2276.091    10.83   0.000      20139.9    29138.71
-------------+----------------------------------------------------------------
     sigma_u |  66210.488
     sigma_e |  22438.823
         rho |  .89697835   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. outreg2 using numReg3.doc, replace
numReg3.doc
dir : seeout

.  
. xtreg nIndv pop nCorp aCorp aTot year*, fe vce(cluster id)
note: year7 omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =        916
Group variable: id                              Number of groups  =        143

R-sq:                                           Obs per group:
     within  = 0.6588                                         min =          1
     between = 0.8315                                         avg =        6.4
     overall = 0.6700                                         max =          7

                                                F(10,142)         =      28.14
corr(u_i, Xb)  = -0.9964                        Prob > F          =     0.0000

                                   (Std. Err. adjusted for 143 clusters in id)
------------------------------------------------------------------------------
             |               Robust
       nIndv |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         pop |    .988128   .2379382     4.15   0.000     .5177692    1.458487
       nCorp |  -18.47077    4.93397    -3.74   0.000     -28.2243   -8.717249
       aCorp |  -.0007114     .00024    -2.96   0.004    -.0011858    -.000237
        aTot |   .0005964   .0001307     4.56   0.000      .000338    .0008549
       year1 |   6072.524   3384.681     1.79   0.075     -618.351     12763.4
       year2 |   7101.771   3589.379     1.98   0.050     6.247393     14197.3
       year3 |   3463.481   2778.709     1.25   0.215    -2029.502    8956.464
       year4 |   7806.785   2905.501     2.69   0.008     2063.159    13550.41
       year5 |   1896.613   1833.836     1.03   0.303    -1728.534     5521.76
       year6 |   7076.923   1290.968     5.48   0.000     4524.923    9628.923
       year7 |          0  (omitted)
       _cons |  -162511.8   43932.69    -3.70   0.000    -249358.4    -75665.2
-------------+----------------------------------------------------------------
     sigma_u |  301128.46
     sigma_e |  16654.701
         rho |  .99695039   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. outreg2 using numReg3.doc, append
numReg3.doc
dir : seeout

.  
. xtreg nIndv pop nCorp aCorp aTot nIndvBigTech nIndvTech nCorpBigTech aIndvBigTech aIndvTech aCorpTech year*, fe vce(cluster id)
note: year7 omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =        916
Group variable: id                              Number of groups  =        143

R-sq:                                           Obs per group:
     within  = 0.7955                                         min =          1
     between = 0.8560                                         avg =        6.4
     overall = 0.7191                                         max =          7

                                                F(16,142)         =      29.12
corr(u_i, Xb)  = -0.9904                        Prob > F          =     0.0000

                                   (Std. Err. adjusted for 143 clusters in id)
------------------------------------------------------------------------------
             |               Robust
       nIndv |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         pop |   .5994125   .1901603     3.15   0.002     .2235016    .9753235
       nCorp |   -9.42701   4.875605    -1.93   0.055    -19.06516    .2111387
       aCorp |  -.0003082    .000215    -1.43   0.154    -.0007331    .0001168
        aTot |   .0002592   .0001295     2.00   0.047     3.21e-06    .0005152
nIndvBigTech |   4.991808   5.198558     0.96   0.339    -5.284758    15.26837
   nIndvTech |   2.929387   1.233394     2.38   0.019     .4911999    5.367575
nCorpBigTech |   8.195322   8.890619     0.92   0.358    -9.379752    25.77039
aIndvBigTech |    .001019   .0087787     0.12   0.908    -.0163347    .0183728
   aIndvTech |  -.0029587   .0017281    -1.71   0.089    -.0063749    .0004575
   aCorpTech |   -.006054   .0186475    -0.32   0.746    -.0429165    .0308085
       year1 |    5006.22   2924.424     1.71   0.089    -774.8144    10787.25
       year2 |   4607.838   2504.148     1.84   0.068    -342.3898    9558.066
       year3 |   896.4373   1688.715     0.53   0.596    -2441.833    4234.708
       year4 |   5414.253   2070.788     2.61   0.010     1320.696    9507.809
       year5 |     1754.9   1347.876     1.30   0.195    -909.5957    4419.396
       year6 |   2859.907    1332.28     2.15   0.034     226.2404    5493.573
       year7 |          0  (omitted)
       _cons |  -98605.35    34451.9    -2.86   0.005    -166710.2   -30500.46
-------------+----------------------------------------------------------------
     sigma_u |  177535.09
     sigma_e |  12944.032
         rho |  .99471228   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. outreg2 using numReg3.doc, append
numReg3.doc
dir : seeout

.  
. xtreg nIndv nCorp nIndvTech nIndvBigTech nCorpBigTech nDemRec nRepRec nComRec aTot aCorp aIndvBigTech aIndvTech aCorpTech aDemRec aRepRec aComRec meanCFCont meanCFCand pop popDen povertyR nWorkersOutside travel40t59 travel60t89 travel90p 
> aggIncomeWhite aggIncomeLatino move2005p move2000t04 medianHomeValue meanQ1Inc meanQ2Inc meanQ3Inc meanQ4Inc meanQ5Inc mean5pInc age5p age10p age15p age18p age20p age21p age22p age25p age30p age35p age40p age45p age50p age55p age60p age62
> p age65p age67p age70p year*, fe vce(cluster id)
note: year7 omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =        914
Group variable: id                              Number of groups  =        143

R-sq:                                           Obs per group:
     within  = 0.9957                                         min =          1
     between = 0.9714                                         avg =        6.4
     overall = 0.9435                                         max =          7

                                                F(60,142)         =  103846.71
corr(u_i, Xb)  = 0.6816                         Prob > F          =     0.0000

                                      (Std. Err. adjusted for 143 clusters in id)
---------------------------------------------------------------------------------
                |               Robust
          nIndv |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
          nCorp |  -5.208448   .6606764    -7.88   0.000    -6.514481   -3.902416
      nIndvTech |    .190274   .0842574     2.26   0.025      .023713     .356835
   nIndvBigTech |   .8454412   .3466256     2.44   0.016      .160228    1.530654
   nCorpBigTech |   1.358927   .8274058     1.64   0.103    -.2766981    2.994552
        nDemRec |   .6773748   .0229741    29.48   0.000     .6319592    .7227903
        nRepRec |   2.407329   .4390988     5.48   0.000     1.539313    3.275344
        nComRec |   .9087443   .0165522    54.90   0.000     .8760236     .941465
           aTot |  -.0002415   .0001687    -1.43   0.154    -.0005751     .000092
          aCorp |   2.97e-07   .0000452     0.01   0.995     -.000089    .0000896
   aIndvBigTech |    .001545   .0014973     1.03   0.304    -.0014148    .0045048
      aIndvTech |   .0007106   .0005331     1.33   0.185    -.0003432    .0017644
      aCorpTech |  -.0060335   .0027459    -2.20   0.030    -.0114617   -.0006053
        aDemRec |   .0001257   .0000968     1.30   0.196    -.0000657     .000317
        aRepRec |   .0003669   .0001855     1.98   0.050     2.69e-07    .0007336
        aComRec |   .0002489   .0001498     1.66   0.099    -.0000473    .0005451
     meanCFCont |  -1740.566   629.0334    -2.77   0.006    -2984.046   -497.0861
     meanCFCand |   1406.928   787.3634     1.79   0.076    -149.5402    2963.397
            pop |  -.1782856   .0922111    -1.93   0.055    -.3605694    .0039983
         popDen |  -.0042784   .0017372    -2.46   0.015    -.0077126   -.0008443
       povertyR |  -2944.208   3704.403    -0.79   0.428    -10267.11    4378.696
nWorkersOutside |   -.154941   .0593242    -2.61   0.010    -.2722137   -.0376683
    travel40t59 |  -.2647273   .1332362    -1.99   0.049    -.5281101   -.0013445
    travel60t89 |    .163591   .0968679     1.69   0.093    -.0278985    .3550805
      travel90p |  -.0872924   .1124968    -0.78   0.439    -.3096772    .1350925
 aggIncomeWhite |   4.15e-07   4.96e-07     0.84   0.404    -5.65e-07    1.40e-06
aggIncomeLatino |   4.69e-06   1.58e-06     2.97   0.004     1.57e-06    7.81e-06
      move2005p |   .5049639   .4797513     1.05   0.294    -.4434138    1.453342
    move2000t04 |   .8378626   .4989729     1.68   0.095    -.1485124    1.824238
medianHomeValue |   .0019057   .0009905     1.92   0.056    -.0000522    .0038637
      meanQ1Inc |  -.0084933   .0383717    -0.22   0.825    -.0843469    .0673603
      meanQ2Inc |  -.0684827   .0360068    -1.90   0.059    -.1396612    .0026959
      meanQ3Inc |   .0518512   .0320157     1.62   0.108    -.0114377    .1151402
      meanQ4Inc |  -.0215469   .0193581    -1.11   0.268    -.0598141    .0167203
      meanQ5Inc |    -.01824   .0143221    -1.27   0.205    -.0465522    .0100721
      mean5pInc |   .0024068   .0042449     0.57   0.572    -.0059845    .0107982
          age5p |    .226026   .1302788     1.73   0.085    -.0315106    .4835625
         age10p |  -.1709611   .0795337    -2.15   0.033    -.3281842    -.013738
         age15p |    .478407   .1975793     2.42   0.017     .0878301     .868984
         age18p |  -.6462202   .3348426    -1.93   0.056    -1.308141    .0157004
         age20p |   .4885664   .2021141     2.42   0.017     .0890251    .8881077
         age21p |  -.0074757   .1822493    -0.04   0.967    -.3677481    .3527968
         age22p |  -.3004123   .1393793    -2.16   0.033    -.5759388   -.0248858
         age25p |   .1750203   .1326565     1.32   0.189    -.0872165     .437257
         age30p |  -.0877097   .1026737    -0.85   0.394    -.2906763    .1152569
         age35p |    .214342   .1381991     1.55   0.123    -.0588515    .4875355
         age40p |  -.2479338   .1159234    -2.14   0.034    -.4770925   -.0187752
         age45p |  -.0027846   .1357263    -0.02   0.984    -.2710898    .2655206
         age50p |   .2856148   .1493806     1.91   0.058    -.0096823     .580912
         age55p |   -.129856   .1688203    -0.77   0.443    -.4635817    .2038698
         age60p |    .157324   .1572112     1.00   0.319    -.1534528    .4681008
         age62p |  -.6475385   .2071485    -3.13   0.002    -1.057032   -.2380451
         age65p |  -.7532331   .3157298    -2.39   0.018    -1.377371   -.1290949
         age67p |    1.04805   .3388548     3.09   0.002     .3781979    1.717902
         age70p |   .0703034   .1484429     0.47   0.637    -.2231401     .363747
          year1 |    101.321   786.6272     0.13   0.898    -1453.692    1656.334
          year2 |    149.663   707.1917     0.21   0.833    -1248.321    1547.647
          year3 |   627.1411   689.8264     0.91   0.365    -736.5153    1990.798
          year4 |  -33.70227    586.281    -0.06   0.954    -1192.669    1125.264
          year5 |  -430.6436   444.6141    -0.97   0.334    -1309.562    448.2743
          year6 |  -106.8319   323.2913    -0.33   0.742    -745.9176    532.2539
          year7 |          0  (omitted)
          _cons |   9382.603   3683.455     2.55   0.012     2101.108     16664.1
----------------+----------------------------------------------------------------
        sigma_u |  16423.598
        sigma_e |  1946.0495
            rho |  .98615426   (fraction of variance due to u_i)
---------------------------------------------------------------------------------

. outreg2 using numReg3.doc, append
numReg3.doc
dir : seeout

.  
. 
. xtreg aIndv nCorp aCorp year*, fe vce(cluster id)
note: year7 omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =        916
Group variable: id                              Number of groups  =        143

R-sq:                                           Obs per group:
     within  = 0.0961                                         min =          1
     between = 0.5703                                         avg =        6.4
     overall = 0.4123                                         max =          7

                                                F(8,142)          =      60.43
corr(u_i, Xb)  = 0.5121                         Prob > F          =     0.0000

                                   (Std. Err. adjusted for 143 clusters in id)
------------------------------------------------------------------------------
             |               Robust
       aIndv |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       nCorp |   3388.103   2069.174     1.64   0.104     -702.263    7478.469
       aCorp |    -.05621   .1139206    -0.49   0.622    -.2814094    .1689895
       year1 |    1446214   987799.6     1.46   0.145    -506479.1     3398907
       year2 |   955618.9   578305.4     1.65   0.101    -187581.7     2098819
       year3 |   75005.26   582538.2     0.13   0.898     -1076563     1226573
       year4 |    3824032    1617094     2.36   0.019     627342.4     7020721
       year5 |   809151.8   824115.1     0.98   0.328    -819967.9     2438272
       year6 |    3509992    1463350     2.40   0.018     617224.9     6402759
       year7 |          0  (omitted)
       _cons |    1186462   811085.7     1.46   0.146      -416901     2789825
-------------+----------------------------------------------------------------
     sigma_u |   13616813
     sigma_e |  9936883.4
         rho |  .65251297   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. outreg2 using amountReg3.doc, replace
amountReg3.doc
dir : seeout

.  
. xtreg aIndv pop aggIncome nCorp aCorp aTot year*, fe vce(cluster id)
note: year7 omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =        916
Group variable: id                              Number of groups  =        143

R-sq:                                           Obs per group:
     within  = 0.6278                                         min =          1
     between = 0.2834                                         avg =        6.4
     overall = 0.0259                                         max =          7

                                                F(11,142)         =      37.74
corr(u_i, Xb)  = -0.6491                        Prob > F          =     0.0000

                                   (Std. Err. adjusted for 143 clusters in id)
------------------------------------------------------------------------------
             |               Robust
       aIndv |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         pop |   1.515447   73.70788     0.02   0.984    -144.1911     147.222
   aggIncome |  -.0014901   .0011195    -1.33   0.185    -.0037031     .000723
       nCorp |  -4922.553   3225.971    -1.53   0.129    -11299.69    1454.582
       aCorp |   -.941575   .1807804    -5.21   0.000    -1.298944   -.5842064
        aTot |   .5642412    .081026     6.96   0.000     .4040681    .7244142
       year1 |  -463881.8    1179276    -0.39   0.695     -2795088     1867324
       year2 |   -1021423    1024514    -1.00   0.320     -3046694     1003849
       year3 |   -1292635    1324712    -0.98   0.331     -3911340     1326069
       year4 |   550929.4   941123.5     0.59   0.559     -1309494     2411353
       year5 |   17007.85   957198.9     0.02   0.986     -1875193     1909209
       year6 |   633358.8   774867.5     0.82   0.415    -898407.8     2165125
       year7 |          0  (omitted)
       _cons |   1.02e+07   1.44e+07     0.71   0.480    -1.82e+07    3.86e+07
-------------+----------------------------------------------------------------
     sigma_u |   23347818
     sigma_e |  6389262.3
         rho |  .93032999   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. outreg2 using amountReg3.doc, append
amountReg3.doc
dir : seeout

.  
. xtreg aIndv pop aggIncome nCorp aCorp aTot nIndvBigTech nIndvTech nCorpBigTech aIndvBigTech aIndvTech aCorpTech year*, fe vce(cluster id)
note: year7 omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =        916
Group variable: id                              Number of groups  =        143

R-sq:                                           Obs per group:
     within  = 0.6728                                         min =          1
     between = 0.0151                                         avg =        6.4
     overall = 0.1226                                         max =          7

                                                F(17,142)         =     225.55
corr(u_i, Xb)  = -0.2011                        Prob > F          =     0.0000

                                   (Std. Err. adjusted for 143 clusters in id)
------------------------------------------------------------------------------
             |               Robust
       aIndv |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         pop |  -21.48009    62.8866    -0.34   0.733     -145.795    102.8348
   aggIncome |  -.0005199   .0012124    -0.43   0.669    -.0029166    .0018767
       nCorp |  -3928.076   3332.423    -1.18   0.240    -10515.65    2659.495
       aCorp |  -.7370684   .2569298    -2.87   0.005     -1.24497   -.2291668
        aTot |    .448571   .1419522     3.16   0.002     .1679584    .7291836
nIndvBigTech |  -614.8259    1118.43    -0.55   0.583    -2825.751    1596.099
   nIndvTech |  -60.12956    143.302    -0.42   0.675    -343.4106    223.1515
nCorpBigTech |   71.98736   1074.957     0.07   0.947        -2053    2196.974
aIndvBigTech |   5.929948   6.064966     0.98   0.330    -6.059345    17.91924
   aIndvTech |   4.002552    1.47347     2.72   0.007      1.08978    6.915324
   aCorpTech |  -1.482757    4.85184    -0.31   0.760    -11.07393    8.108414
       year1 |  -484004.3   915379.3    -0.53   0.598     -2293536     1325528
       year2 |   -1140035   743215.5    -1.53   0.127     -2609231    329162.1
       year3 |  -564878.5   959815.5    -0.59   0.557     -2462252     1332495
       year4 |   725178.2   862684.1     0.84   0.402    -980185.2     2430542
       year5 |   65370.85   704758.4     0.09   0.926     -1327803     1458545
       year6 |   188867.4   486597.6     0.39   0.698    -773044.1     1150779
       year7 |          0  (omitted)
       _cons |    7999484   1.16e+07     0.69   0.493    -1.50e+07    3.10e+07
-------------+----------------------------------------------------------------
     sigma_u |   17222627
     sigma_e |  6013799.4
         rho |  .89132377   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. outreg2 using amountReg3.doc, append
amountReg3.doc
dir : seeout

.  
. xtreg aIndv nCorp nIndvTech nIndvBigTech nCorpBigTech nDemRec nRepRec nComRec aTot aCorp aIndvBigTech aIndvTech aCorpTech aDemRec aRepRec aComRec meanCFCont meanCFCand pop popDen incomePC pforeignBorn pHousingOwners nWorkersOutside travel
> 40t59 travel60t89 travel90p aggIncomeWhite aggIncomeLatino move2005p move2000t04 medianHomeValue meanQ1Inc meanQ2Inc meanQ3Inc meanQ4Inc meanQ5Inc mean5pInc age5p age10p age15p age18p age20p age25p age30p age35p age40p age45p age50p age55
> p age60p age62p age65p age67p age70p year*, fe vce(cluster id)
note: year7 omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =        916
Group variable: id                              Number of groups  =        143

R-sq:                                           Obs per group:
     within  = 0.8179                                         min =          1
     between = 0.6276                                         avg =        6.4
     overall = 0.6773                                         max =          7

                                                F(60,142)         =   11086.57
corr(u_i, Xb)  = -0.1596                        Prob > F          =     0.0000

                                      (Std. Err. adjusted for 143 clusters in id)
---------------------------------------------------------------------------------
                |               Robust
          aIndv |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
          nCorp |   -4630.46   2367.155    -1.96   0.052    -9309.879    48.95882
      nIndvTech |   44.39092   49.94442     0.89   0.376    -54.33976    143.1216
   nIndvBigTech |  -510.2775   1022.215    -0.50   0.618    -2531.004    1510.449
   nCorpBigTech |  -28.61988   890.9942    -0.03   0.974    -1789.947    1732.707
        nDemRec |   14.88169   58.46325     0.25   0.799    -100.6891    130.4525
        nRepRec |   1596.475   547.0681     2.92   0.004     515.0252    2677.926
        nComRec |  -44.64334   50.41083    -0.89   0.377     -144.296    55.00934
           aTot |  -.4533387    .560424    -0.81   0.420    -1.561191    .6545135
          aCorp |  -.6381567   .2368751    -2.69   0.008    -1.106414   -.1698995
   aIndvBigTech |   1.311715   2.871894     0.46   0.649    -4.365477    6.988906
      aIndvTech |   3.336152   1.029044     3.24   0.001     1.301927    5.370377
      aCorpTech |  -8.505052   7.349993    -1.16   0.249     -23.0346    6.024494
        aDemRec |   .8667923   .6651506     1.30   0.195    -.4480847    2.181669
        aRepRec |  -.3164228   .7481284    -0.42   0.673    -1.795331    1.162486
        aComRec |   .8584288   .4640271     1.85   0.066    -.0588651    1.775723
     meanCFCont |   -1217726   899420.5    -1.35   0.178     -2995710    560258.7
     meanCFCand |    1602965    1244822     1.29   0.200    -857813.3     4063743
            pop |  -228.1698   149.0004    -1.53   0.128    -522.7154    66.37585
         popDen |  -10.21564   6.325078    -1.62   0.109    -22.71913     2.28784
       incomePC |   312.0683   161.9645     1.93   0.056    -8.104817    632.2415
   pforeignBorn |  -1.00e+07    5169179    -1.94   0.054    -2.02e+07    193765.3
 pHousingOwners |   -2306440    1184470    -1.95   0.053     -4647913    35033.15
nWorkersOutside |   87.51381   70.24309     1.25   0.215     -51.3435    226.3711
    travel40t59 |  -26.34854   152.8521    -0.17   0.863    -328.5083    275.8112
    travel60t89 |   498.0457    238.688     2.09   0.039     26.20462    969.8869
      travel90p |  -119.9953   252.5157    -0.48   0.635    -619.1712    379.1806
 aggIncomeWhite |  -.0034354   .0011764    -2.92   0.004     -.005761   -.0011098
aggIncomeLatino |  -.0045491   .0015769    -2.88   0.005    -.0076662   -.0014319
      move2005p |   819.9818   1608.813     0.51   0.611    -2360.337      4000.3
    move2000t04 |  -555.2103   982.3275    -0.57   0.573    -2497.086    1386.665
medianHomeValue |  -15.69309   6.541497    -2.40   0.018     -28.6244   -2.761791
      meanQ1Inc |   90.95579   111.6925     0.81   0.417    -129.8391    311.7507
      meanQ2Inc |   53.07195   73.90116     0.72   0.474    -93.01667    199.1606
      meanQ3Inc |  -57.36415   74.98637    -0.76   0.446     -205.598    90.86972
      meanQ4Inc |  -58.64738   56.69143    -1.03   0.303    -170.7156    53.42086
      meanQ5Inc |   26.38695   27.81883     0.95   0.344    -28.60561    81.37952
      mean5pInc |  -6.078527   10.15556    -0.60   0.550    -26.15416     13.9971
          age5p |   282.5955    329.909     0.86   0.393    -369.5723    934.7633
         age10p |    498.738   329.5505     1.51   0.132     -152.721    1150.197
         age15p |  -182.6634   232.2284    -0.79   0.433     -641.735    276.4083
         age18p |   159.2955   249.2724     0.64   0.524     -333.469      652.06
         age20p |  -839.9936   383.4872    -2.19   0.030    -1598.075    -81.9118
         age25p |   1054.202   415.9809     2.53   0.012      231.886    1876.517
         age30p |  -418.9914   253.4252    -1.65   0.100    -919.9652    81.98236
         age35p |  -638.5715   338.1583    -1.89   0.061    -1307.047    29.90356
         age40p |    24.8857   309.6721     0.08   0.936    -587.2775    637.0489
         age45p |    32.7044   421.9115     0.08   0.938    -801.3349    866.7437
         age50p |   167.8488   291.8855     0.58   0.566    -409.1537    744.8513
         age55p |   161.7999   266.1648     0.61   0.544    -364.3577    687.9574
         age60p |  -685.3269   362.7065    -1.89   0.061    -1402.329    31.67534
         age62p |   1257.145   688.8427     1.83   0.070    -104.5671    2618.857
         age65p |  -315.2706   430.3047    -0.73   0.465    -1165.902    535.3605
         age67p |   944.8415    435.296     2.17   0.032      84.3436    1805.339
         age70p |  -1609.864   628.9026    -2.56   0.012    -2853.086   -366.6425
          year1 |  -292380.1    1428429    -0.20   0.838     -3116115     2531355
          year2 |   -1855530    1035639    -1.79   0.075     -3902792    191733.5
          year3 |   -2039394    1156619    -1.76   0.080     -4325811    247023.8
          year4 |   -1938695   987261.9    -1.96   0.052     -3890326    12934.85
          year5 |    -971460   742536.4    -1.31   0.193     -2439314    496394.2
          year6 |   -1639902   675096.3    -2.43   0.016     -2974440   -305364.1
          year7 |          0  (omitted)
          _cons |    8182092    7651445     1.07   0.287     -6943369    2.33e+07
----------------+----------------------------------------------------------------
        sigma_u |   10314161
        sigma_e |  4620133.3
            rho |  .83288155   (fraction of variance due to u_i)
---------------------------------------------------------------------------------

. outreg2 using amountReg3.doc, append
amountReg3.doc
dir : seeout

.  
. 
. xtreg vReg nCorp aCorp year*, fe vce(cluster id)
note: year7 omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =        916
Group variable: id                              Number of groups  =        143

R-sq:                                           Obs per group:
     within  = 0.3732                                         min =          1
     between = 0.5041                                         avg =        6.4
     overall = 0.2041                                         max =          7

                                                F(8,142)          =      71.19
corr(u_i, Xb)  = -0.6035                        Prob > F          =     0.0000

                                   (Std. Err. adjusted for 143 clusters in id)
------------------------------------------------------------------------------
             |               Robust
        vReg |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       nCorp |  -297.0519   192.4518    -1.54   0.125    -677.4927    83.38882
       aCorp |  -.0016292   .0059251    -0.27   0.784    -.0133421    .0100837
       year1 |  -743083.3   90792.95    -8.18   0.000    -922563.8   -563602.8
       year2 |  -553286.1   84104.38    -6.58   0.000    -719544.5   -387027.6
       year3 |    -434122   92761.72    -4.68   0.000    -617494.4   -250749.7
       year4 |  -352951.1   75560.61    -4.67   0.000    -502320.1     -203582
       year5 |    -310283   79050.02    -3.93   0.000      -466550   -154016.1
       year6 |  -68777.66   34485.82    -1.99   0.048    -136949.6   -605.7065
       year7 |          0  (omitted)
       _cons |    2651747   57302.26    46.28   0.000      2538471     2765023
-------------+----------------------------------------------------------------
     sigma_u |  3074180.8
     sigma_e |  552235.81
         rho |   .9687394   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. outreg2 using regReg3.doc, replace
regReg3.doc
dir : seeout

.  
. xtreg vReg pop nCorp aCorp aTot year*, fe vce(cluster id)
note: year7 omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =        916
Group variable: id                              Number of groups  =        143

R-sq:                                           Obs per group:
     within  = 0.4832                                         min =          1
     between = 0.8928                                         avg =        6.4
     overall = 0.8667                                         max =          7

                                                F(10,142)         =     125.55
corr(u_i, Xb)  = -0.9822                        Prob > F          =     0.0000

                                   (Std. Err. adjusted for 143 clusters in id)
------------------------------------------------------------------------------
             |               Robust
        vReg |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         pop |   21.65779   5.634099     3.84   0.000     10.52025    32.79534
       nCorp |  -89.94029   92.48556    -0.97   0.332    -272.7668    92.88619
       aCorp |   .0024594   .0079678     0.31   0.758    -.0132914    .0182101
        aTot |   -.003864   .0028309    -1.36   0.174    -.0094601    .0017322
       year1 |  -472324.8   91260.57    -5.18   0.000    -652729.7   -291919.9
       year2 |  -329620.6   101232.7    -3.26   0.001    -529738.5   -129502.7
       year3 |  -261852.1   100688.5    -2.60   0.010    -460894.3   -62809.94
       year4 |  -257418.1   78907.98    -3.26   0.001    -413404.2   -101431.9
       year5 |  -312809.7   60451.25    -5.17   0.000    -432310.4     -193309
       year6 |  -40862.61   37216.43    -1.10   0.274    -114432.4    32707.23
       year7 |          0  (omitted)
       _cons |   -1431058    1043084    -1.37   0.172     -3493038    630921.9
-------------+----------------------------------------------------------------
     sigma_u |  4893096.6
     sigma_e |  502083.49
         rho |  .98958077   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. outreg2 using regReg3.doc, append
regReg3.doc
dir : seeout

.  
. xtreg vReg pop nCorp aCorp aTot nIndvBigTech nIndvTech nCorpBigTech aIndvBigTech aIndvTech aCorpTech year*, fe vce(cluster id)
note: year7 omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =        916
Group variable: id                              Number of groups  =        143

R-sq:                                           Obs per group:
     within  = 0.4966                                         min =          1
     between = 0.8945                                         avg =        6.4
     overall = 0.8706                                         max =          7

                                                F(16,142)         =      76.60
corr(u_i, Xb)  = -0.9707                        Prob > F          =     0.0000

                                   (Std. Err. adjusted for 143 clusters in id)
------------------------------------------------------------------------------
             |               Robust
        vReg |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         pop |   18.50969   3.690302     5.02   0.000     11.21466    25.80472
       nCorp |  -69.07212   72.81497    -0.95   0.344    -213.0136    74.86932
       aCorp |  -.0029579   .0053617    -0.55   0.582     -.013557    .0076412
        aTot |  -.0017352    .001938    -0.90   0.372    -.0055663    .0020959
nIndvBigTech |    12.3979   93.13159     0.13   0.894    -171.7057    196.5015
   nIndvTech |   9.768718   16.25603     0.60   0.549    -22.36639    41.90382
nCorpBigTech |  -28.54739   26.51335    -1.08   0.283    -80.95928     23.8645
aIndvBigTech |   .1781554   .1611992     1.11   0.271     -.140505    .4968158
   aIndvTech |  -.1452736   .0750964    -1.93   0.055    -.2937249    .0031778
   aCorpTech |   .1762626   .2738962     0.64   0.521    -.3651785    .7177037
       year1 |  -479226.1   83669.71    -5.73   0.000    -644625.3   -313826.9
       year2 |    -339842    84666.4    -4.01   0.000    -507211.5   -172472.6
       year3 |  -283364.8   90018.99    -3.15   0.002    -461315.3   -105414.2
       year4 |  -263766.7   68794.72    -3.83   0.000    -399760.8   -127772.5
       year5 |  -307660.4   55687.43    -5.52   0.000      -417744   -197576.9
       year6 |  -38743.25   43030.07    -0.90   0.369    -123805.6    46319.08
       year7 |          0  (omitted)
       _cons |  -854659.9   684979.3    -1.25   0.214     -2208734    499414.7
-------------+----------------------------------------------------------------
     sigma_u |  3761742.3
     sigma_e |  497519.59
         rho |   .9828086   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. outreg2 using regReg3.doc, append
regReg3.doc
dir : seeout

.  
. xtreg vReg nCorp nIndvTech nIndvBigTech nCorpBigTech nDemRec nComRec aTot aCorp aIndvTech aIndvBigTech aCorpTech aDemRec aIndRec meanCFCont sdCFDiff pop popDen incomePC pforeignBorn medIncome nWorkersOutside travel90p aggIncomeLatino medi
> anHomeValue age22p age25p age35p age40p age50p age60p age70p year*, fe vce(cluster id)
note: year7 omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =        916
Group variable: id                              Number of groups  =        143

R-sq:                                           Obs per group:
     within  = 0.6279                                         min =          1
     between = 0.0489                                         avg =        6.4
     overall = 0.0777                                         max =          7

                                                F(37,142)         =    1511.92
corr(u_i, Xb)  = 0.0422                         Prob > F          =     0.0000

                                      (Std. Err. adjusted for 143 clusters in id)
---------------------------------------------------------------------------------
                |               Robust
           vReg |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
          nCorp |  -31.40715   42.59768    -0.74   0.462    -115.6147    52.80041
      nIndvTech |  -7.028063   5.558288    -1.26   0.208    -18.01575    3.959621
   nIndvBigTech |   25.22683    41.1876     0.61   0.541    -56.19326    106.6469
   nCorpBigTech |   29.14028   27.75353     1.05   0.296    -25.72321    84.00377
        nDemRec |   3.615078    2.00793     1.80   0.074    -.3542205    7.584376
        nComRec |  -2.621907   1.791521    -1.46   0.146    -6.163405    .9195913
           aTot |  -.0068128   .0019505    -3.49   0.001    -.0106685   -.0029571
          aCorp |   .0026524    .004231     0.63   0.532    -.0057115    .0110163
      aIndvTech |   .0011865   .0232168     0.05   0.959    -.0447087    .0470817
   aIndvBigTech |  -.0017597   .1046087    -0.02   0.987    -.2085514    .2050319
      aCorpTech |   -.110579   .1918721    -0.58   0.565     -.489874    .2687159
        aDemRec |   .0113642   .0051289     2.22   0.028     .0012254     .021503
        aIndRec |   .0115205   .0021306     5.41   0.000     .0073086    .0157323
     meanCFCont |  -133092.4   72090.53    -1.85   0.067    -275601.8    9416.906
       sdCFDiff |   584076.7   414865.1     1.41   0.161    -236033.2     1404187
            pop |   12.14461    7.19034     1.69   0.093    -2.069331    26.35856
         popDen |   1.248177   .4388414     2.84   0.005     .3806705    2.115683
       incomePC |  -21.95561   7.355009    -2.99   0.003    -36.49507   -7.416147
   pforeignBorn |  -758215.3   571169.2    -1.33   0.186     -1887309    370878.3
      medIncome |    2.86422   2.393104     1.20   0.233    -1.866495    7.594935
nWorkersOutside |   11.49716   5.028895     2.29   0.024     1.555981    21.43833
      travel90p |   37.71294   22.17053     1.70   0.091     -6.11401    81.53989
aggIncomeLatino |   .0004569   .0000982     4.65   0.000     .0002627    .0006511
medianHomeValue |   .9556787   .3685651     2.59   0.011     .2270951    1.684262
         age22p |  -71.29889   20.52997    -3.47   0.001    -111.8828   -30.71502
         age25p |   29.30883   15.40093     1.90   0.059    -1.135888    59.75355
         age35p |   31.60493   17.93856     1.76   0.080    -3.856216    67.06607
         age40p |  -37.74898    21.0417    -1.79   0.075    -79.34444    3.846481
         age50p |   27.88398   15.83235     1.76   0.080    -3.413581    59.18154
         age60p |   38.40048   17.43392     2.20   0.029     3.936921    72.86403
         age70p |  -45.36029   22.20859    -2.04   0.043    -89.26248   -1.458101
          year1 |  -225338.9     114987    -1.96   0.052    -452646.4    1968.624
          year2 |  -114630.4   105082.7    -1.09   0.277    -322359.1    93098.36
          year3 |  -51826.27   121947.5    -0.42   0.671    -292893.5    189240.9
          year4 |  -52954.54   98711.29    -0.54   0.592    -248088.1      142179
          year5 |  -109281.8   82375.71    -1.33   0.187      -272123    53559.43
          year6 |  -37.72053   54995.11    -0.00   0.999    -108752.6    108677.2
          year7 |          0  (omitted)
          _cons |    2084169   433040.3     4.81   0.000      1228130     2940207
----------------+----------------------------------------------------------------
        sigma_u |  2665273.2
        sigma_e |  433781.13
            rho |  .97419501   (fraction of variance due to u_i)
---------------------------------------------------------------------------------

. outreg2 using regReg3.doc, append
regReg3.doc
dir : seeout

.  
. 
. xtreg vTurn nCorp aCorp year*, fe vce(cluster id)
note: year7 omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =        916
Group variable: id                              Number of groups  =        143

R-sq:                                           Obs per group:
     within  = 0.4009                                         min =          1
     between = 0.4913                                         avg =        6.4
     overall = 0.0698                                         max =          7

                                                F(8,142)          =      33.79
corr(u_i, Xb)  = -0.5453                        Prob > F          =     0.0000

                                   (Std. Err. adjusted for 143 clusters in id)
------------------------------------------------------------------------------
             |               Robust
       vTurn |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       nCorp |  -227.5419   122.9511    -1.85   0.066     -470.593    15.50912
       aCorp |  -.0070164   .0017806    -3.94   0.000    -.0105362   -.0034966
       year1 |    -728740   77127.12    -9.45   0.000    -881205.8   -576274.3
       year2 |  -14200.85   96854.87    -0.15   0.884    -205664.6    177262.9
       year3 |    -368415   60928.94    -6.05   0.000      -488860     -247970
       year4 |  -19787.91   78284.15    -0.25   0.801    -174540.9    134965.1
       year5 |    -648453   56089.89   -11.56   0.000    -759332.1   -537573.9
       year6 |   243154.4   43022.56     5.65   0.000     158106.9    328201.9
       year7 |          0  (omitted)
       _cons |    1690988    37447.8    45.16   0.000      1616961     1765015
-------------+----------------------------------------------------------------
     sigma_u |  1936337.7
     sigma_e |  596329.03
         rho |  .91337216   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. outreg2 using turnReg3.doc, replace
turnReg3.doc
dir : seeout

.  
. xtreg vTurn pop nCorp aCorp aTot year*, fe vce(cluster id)
note: year7 omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =        916
Group variable: id                              Number of groups  =        143

R-sq:                                           Obs per group:
     within  = 0.4225                                         min =          1
     between = 0.8511                                         avg =        6.4
     overall = 0.7778                                         max =          7

                                                F(10,142)         =      67.88
corr(u_i, Xb)  = -0.8985                        Prob > F          =     0.0000

                                   (Std. Err. adjusted for 143 clusters in id)
------------------------------------------------------------------------------
             |               Robust
       vTurn |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         pop |   8.605343    2.71548     3.17   0.002     3.237352    13.97333
       nCorp |  -195.0073   101.4864    -1.92   0.057    -395.6266    5.612074
       aCorp |  -.0133014   .0027385    -4.86   0.000     -.018715   -.0078878
        aTot |   .0031848   .0023221     1.37   0.172    -.0014055    .0077751
       year1 |  -618765.9   64102.88    -9.65   0.000    -745485.1   -492046.6
       year2 |   71205.76      83981     0.85   0.398     -94808.8    237220.3
       year3 |    -295439   51911.83    -5.69   0.000    -398058.9   -192819.1
       year4 |    2824.04   66056.15     0.04   0.966    -127756.5    133404.6
       year5 |  -649709.8   55797.78   -11.64   0.000    -760011.4   -539408.1
       year6 |   236253.9   36747.84     6.43   0.000     163610.3    308897.4
       year7 |          0  (omitted)
       _cons |   63413.94     527186     0.12   0.904    -978733.1     1105561
-------------+----------------------------------------------------------------
     sigma_u |  1486021.5
     sigma_e |  586237.95
         rho |   .8653277   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. outreg2 using turnReg3.doc, append
turnReg3.doc
dir : seeout

.  
. xtreg vTurn pop nCorp aCorp aTot nIndvBigTech nIndvTech nCorpBigTech aIndvBigTech aIndvTech aCorpTech year*, fe vce(cluster id)
note: year7 omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =        916
Group variable: id                              Number of groups  =        143

R-sq:                                           Obs per group:
     within  = 0.4575                                         min =          1
     between = 0.8336                                         avg =        6.4
     overall = 0.7815                                         max =          7

                                                F(16,142)         =     118.12
corr(u_i, Xb)  = -0.1081                        Prob > F          =     0.0000

                                   (Std. Err. adjusted for 143 clusters in id)
------------------------------------------------------------------------------
             |               Robust
       vTurn |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         pop |   4.531807   4.528886     1.00   0.319    -4.420944    13.48456
       nCorp |  -146.4957    81.3989    -1.80   0.074     -307.406    14.41452
       aCorp |  -.0099602   .0074607    -1.34   0.184    -.0247086    .0047883
        aTot |  -.0006746   .0056153    -0.12   0.905    -.0117749    .0104258
nIndvBigTech |  -67.55437   150.8188    -0.45   0.655    -365.6946    230.5859
   nIndvTech |   39.06825   44.39959     0.88   0.380    -48.70136    126.8379
nCorpBigTech |   36.61437   56.36647     0.65   0.517    -74.81149    148.0402
aIndvBigTech |   .4003926    .266064     1.50   0.135    -.1255656    .9263507
   aIndvTech |  -.0339552    .061711    -0.55   0.583    -.1559463    .0880359
   aCorpTech |   1.166353   1.037215     1.12   0.263    -.8840252    3.216731
       year1 |  -643080.5   76071.23    -8.45   0.000    -793458.9   -492702.1
       year2 |    28493.4   58775.24     0.48   0.629    -87694.15      144681
       year3 |  -339631.1    60330.3    -5.63   0.000    -458892.7   -220369.5
       year4 |  -55132.46   50396.95    -1.09   0.276    -154757.7    44492.78
       year5 |  -659112.5   59698.66   -11.04   0.000    -777125.5   -541099.5
       year6 |   174435.8   57406.58     3.04   0.003     60953.86    287917.8
       year7 |          0  (omitted)
       _cons |   746351.9   792932.9     0.94   0.348    -821126.6     2313830
-------------+----------------------------------------------------------------
     sigma_u |  669286.02
     sigma_e |  570438.61
         rho |  .57922966   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. outreg2 using turnReg3.doc, append
turnReg3.doc
dir : seeout

.  
. xtreg vTurn nCorp nIndvTech nIndvBigTech nCorpBigTech count nDemRec nRepRec nIndRec nComRec aTot aCorp aIndvBigTech aIndvTech aCorpTech aDemRec aRepRec aIndRec meanCFCont meanCFCand pop gini incomePC pforeignBorn aggIncome povertyR nWorke
> rsOutside travel0t9 travel10t19 travel20t29 travel30t39 travel40t59 travel60t89 travel90p  aggIncomeLatino medianHomeValue aggRent meanQ1Inc meanQ2Inc meanQ3Inc meanQ4Inc meanQ5Inc age5p age10p age20p age22p age25p age30p age40p age60p ag
> e70p year*, fe vce(cluster id)
note: travel90p omitted because of collinearity
note: year7 omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =        914
Group variable: id                              Number of groups  =        143

R-sq:                                           Obs per group:
     within  = 0.8023                                         min =          1
     between = 0.5158                                         avg =        6.4
     overall = 0.4810                                         max =          7

                                                F(55,142)         =    1282.77
corr(u_i, Xb)  = 0.3313                         Prob > F          =     0.0000

                                      (Std. Err. adjusted for 143 clusters in id)
---------------------------------------------------------------------------------
                |               Robust
          vTurn |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
          nCorp |  -285.0227   63.09978    -4.52   0.000     -409.759   -160.2864
      nIndvTech |  -4.747109   4.933283    -0.96   0.338    -14.49928     5.00506
   nIndvBigTech |  -116.2277   58.96546    -1.97   0.051    -232.7912    .3359214
   nCorpBigTech |   54.54139   27.07337     2.01   0.046     1.022459    108.0603
          count |   43.46259   7.354698     5.91   0.000     28.92374    58.00144
        nDemRec |  -29.34592   5.621634    -5.22   0.000    -40.45883   -18.23301
        nRepRec |   321.7995   48.20691     6.68   0.000     226.5036    417.0955
        nIndRec |   65.92017   14.47101     4.56   0.000     37.31371    94.52663
        nComRec |  -46.52825   6.765487    -6.88   0.000    -59.90234   -33.15416
           aTot |     -.0071   .0030614    -2.32   0.022    -.0131518   -.0010481
          aCorp |   .0007847   .0048298     0.16   0.871     -.008763    .0103324
   aIndvBigTech |  -.0345507   .2522488    -0.14   0.891    -.5331989    .4640974
      aIndvTech |  -.0948163   .0417659    -2.27   0.025    -.1773796   -.0122531
      aCorpTech |   .9530529   .4663171     2.04   0.043     .0312322    1.874874
        aDemRec |   .0156608   .0085226     1.84   0.068    -.0011868    .0325085
        aRepRec |  -.0102824   .0113279    -0.91   0.366    -.0326755    .0121108
        aIndRec |   .0092758   .0034495     2.69   0.008     .0024568    .0160948
     meanCFCont |  -367080.5     113032    -3.25   0.001    -590523.3   -143637.6
     meanCFCand |   200830.6   137554.7     1.46   0.146    -71089.13    472750.3
            pop |   18.63717   11.89509     1.57   0.119    -4.877182    42.15152
           gini |   -1435364    1836158    -0.78   0.436     -5065101     2194373
       incomePC |  -22.20603   13.91763    -1.60   0.113    -49.71855    5.306487
   pforeignBorn |   -1119564     509585    -2.20   0.030     -2126917   -112210.4
      aggIncome |   .0000903   .0000489     1.84   0.067    -6.49e-06     .000187
       povertyR |   691008.6     520422     1.33   0.186    -337767.4     1719785
nWorkersOutside |   44.29522   23.57496     1.88   0.062    -2.308013    90.89845
      travel0t9 |  -48.70234    31.0686    -1.57   0.119    -110.1191    12.71441
    travel10t19 |  -42.34524   27.79684    -1.52   0.130    -97.29433    12.60385
    travel20t29 |  -41.09384   25.16948    -1.63   0.105    -90.84914    8.661457
    travel30t39 |   -37.1097   20.87558    -1.78   0.078    -78.37677    4.157373
    travel40t59 |  -59.26399   28.50092    -2.08   0.039    -115.6049   -2.923055
    travel60t89 |   -48.6003    25.1778    -1.93   0.056    -98.37205    1.171446
      travel90p |          0  (omitted)
aggIncomeLatino |   .0002828   .0001229     2.30   0.023     .0000399    .0005257
medianHomeValue |   .7575773   .4754717     1.59   0.113    -.1823403    1.697495
        aggRent |   .0144258    .004972     2.90   0.004     .0045971    .0242544
      meanQ1Inc |  -9.923675   8.729626    -1.14   0.258     -27.1805    7.333147
      meanQ2Inc |   11.09823   7.380947     1.50   0.135    -3.492508    25.68897
      meanQ3Inc |  -10.05515   6.156638    -1.63   0.105    -22.22566    2.115357
      meanQ4Inc |   .0247944   3.457993     0.01   0.994    -6.811005    6.860593
      meanQ5Inc |   2.268907   2.668422     0.85   0.397    -3.006058    7.543872
          age5p |  -38.91401   21.35881    -1.82   0.071    -81.13634    3.308321
         age10p |   34.09345   18.55297     1.84   0.068    -2.582272    70.76918
         age20p |    16.9596   17.67041     0.96   0.339    -17.97147    51.89067
         age22p |  -102.7403   32.37373    -3.17   0.002     -166.737   -38.74354
         age25p |   36.62127   21.11766     1.73   0.085    -5.124361    78.36689
         age30p |   32.58204   8.193236     3.98   0.000     16.38556    48.77852
         age40p |  -17.47103    8.11633    -2.15   0.033    -33.51548   -1.426581
         age60p |   46.79251    18.5896     2.52   0.013     10.04439    83.54063
         age70p |  -44.51405   19.87574    -2.24   0.027    -83.80464   -5.223465
          year1 |  -309900.4     128762    -2.41   0.017    -564438.5   -55362.22
          year2 |   131803.7   88457.81     1.49   0.138    -43060.72      306668
          year3 |  -65811.53   99371.94    -0.66   0.509    -262251.1      130628
          year4 |  -9713.044   85684.88    -0.11   0.910    -179095.9    159669.8
          year5 |  -323369.4   71201.89    -4.54   0.000    -464122.1   -182616.8
          year6 |    17354.4   52441.24     0.33   0.741    -86312.02    121020.8
          year7 |          0  (omitted)
          _cons |    2151230   942585.7     2.28   0.024     287916.1     4014544
----------------+----------------------------------------------------------------
        sigma_u |  1315290.3
        sigma_e |  354061.64
            rho |  .93243336   (fraction of variance due to u_i)
---------------------------------------------------------------------------------

. outreg2 using turnReg3.doc, append
turnReg3.doc
dir : seeout

.  
. 
. xtreg turnoutR nCorp aCorp year*, fe vce(cluster id)
note: year7 omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =        916
Group variable: id                              Number of groups  =        143

R-sq:                                           Obs per group:
     within  = 0.8950                                         min =          1
     between = 0.0048                                         avg =        6.4
     overall = 0.7324                                         max =          7

                                                F(7,142)          =          .
corr(u_i, Xb)  = -0.0019                        Prob > F          =          .

                                   (Std. Err. adjusted for 143 clusters in id)
------------------------------------------------------------------------------
             |               Robust
    turnoutR |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       nCorp |   3.12e-06   1.49e-06     2.10   0.037     1.84e-07    6.06e-06
       aCorp |  -3.77e-10   2.24e-10    -1.68   0.095    -8.20e-10    6.68e-11
       year1 |  -.1661267   .0088998   -18.67   0.000      -.18372   -.1485335
       year2 |   .1472598   .0068115    21.62   0.000     .1337948    .1607249
       year3 |  -.0616099   .0042922   -14.35   0.000    -.0700947    -.053125
       year4 |   .0782072   .0048775    16.03   0.000     .0685652    .0878492
       year5 |  -.2333622   .0044589   -52.34   0.000    -.2421766   -.2245478
       year6 |   .1137797   .0031725    35.86   0.000     .1075083    .1200512
       year7 |          0  (omitted)
       _cons |   .6432166   .0029964   214.67   0.000     .6372933    .6491398
-------------+----------------------------------------------------------------
     sigma_u |  .06799594
     sigma_e |  .04967794
         rho |  .65198453   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. outreg2 using turnrReg3.doc, replace
turnrReg3.doc
dir : seeout

.  
. xtreg turnoutR pop nCorp aCorp aTot year*, fe vce(cluster id)
note: year7 omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =        916
Group variable: id                              Number of groups  =        143

R-sq:                                           Obs per group:
     within  = 0.8950                                         min =          1
     between = 0.0057                                         avg =        6.4
     overall = 0.6825                                         max =          7

                                                F(8,142)          =          .
corr(u_i, Xb)  = -0.1075                        Prob > F          =          .

                                   (Std. Err. adjusted for 143 clusters in id)
------------------------------------------------------------------------------
             |               Robust
    turnoutR |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         pop |   7.75e-08   1.68e-07     0.46   0.645    -2.54e-07    4.09e-07
       nCorp |   3.88e-06   2.02e-06     1.92   0.057    -1.14e-07    7.88e-06
       aCorp |  -3.59e-10   2.79e-10    -1.28   0.201    -9.11e-10    1.93e-10
        aTot |  -1.57e-11   1.02e-10    -0.15   0.878    -2.17e-10    1.86e-10
       year1 |  -.1651591   .0092405   -17.87   0.000    -.1834258   -.1468925
       year2 |   .1480614   .0075268    19.67   0.000     .1331824    .1629404
       year3 |  -.0609954   .0048144   -12.67   0.000    -.0705126   -.0514782
       year4 |   .0785552   .0051141    15.36   0.000     .0684455    .0886648
       year5 |  -.2333711   .0044779   -52.12   0.000    -.2422231   -.2245192
       year6 |   .1138869   .0032528    35.01   0.000     .1074567    .1203171
       year7 |          0  (omitted)
       _cons |    .628613   .0323044    19.46   0.000     .5647533    .6924728
-------------+----------------------------------------------------------------
     sigma_u |  .07635704
     sigma_e |  .04973611
         rho |   .7021126   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. outreg2 using turnrReg3.doc, append
turnrReg3.doc
dir : seeout

.  
. xtreg turnoutR pop nCorp aCorp aTot nIndvBigTech nIndvTech nCorpBigTech aIndvBigTech aIndvTech aCorpTech year*, fe vce(cluster id)
note: year7 omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =        916
Group variable: id                              Number of groups  =        143

R-sq:                                           Obs per group:
     within  = 0.8964                                         min =          1
     between = 0.0216                                         avg =        6.4
     overall = 0.6970                                         max =          7

                                                F(14,142)         =          .
corr(u_i, Xb)  = -0.0694                        Prob > F          =          .

                                   (Std. Err. adjusted for 143 clusters in id)
------------------------------------------------------------------------------
             |               Robust
    turnoutR |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         pop |   7.61e-08   2.06e-07     0.37   0.713    -3.31e-07    4.83e-07
       nCorp |  -7.40e-07   2.39e-06    -0.31   0.757    -5.45e-06    3.98e-06
       aCorp |  -9.57e-10   4.42e-10    -2.17   0.032    -1.83e-09   -8.41e-11
        aTot |   3.17e-10   1.46e-10     2.17   0.031     2.89e-11    6.06e-10
nIndvBigTech |  -3.75e-06   2.42e-06    -1.55   0.123    -8.54e-06    1.03e-06
   nIndvTech |  -8.13e-07   4.53e-07    -1.79   0.075    -1.71e-06    8.26e-08
nCorpBigTech |   4.10e-06   3.72e-06     1.10   0.273    -3.26e-06    .0000115
aIndvBigTech |   2.71e-09   1.47e-08     0.18   0.854    -2.64e-08    3.18e-08
   aIndvTech |  -6.90e-09   5.08e-09    -1.36   0.177    -1.69e-08    3.14e-09
   aCorpTech |   2.70e-08   2.17e-08     1.24   0.216    -1.59e-08    6.99e-08
       year1 |  -.1644778   .0093303   -17.63   0.000     -.182922   -.1460335
       year2 |   .1491186   .0074684    19.97   0.000      .134355    .1638823
       year3 |   -.060661   .0047985   -12.64   0.000    -.0701468   -.0511752
       year4 |   .0797068   .0051483    15.48   0.000     .0695296     .089884
       year5 |  -.2324367   .0046305   -50.20   0.000    -.2415903   -.2232831
       year6 |   .1167343   .0033251    35.11   0.000     .1101611    .1233074
       year7 |          0  (omitted)
       _cons |    .632407   .0385036    16.42   0.000     .5562927    .7085214
-------------+----------------------------------------------------------------
     sigma_u |   .0742097
     sigma_e |  .04961451
         rho |  .69109059   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. outreg2 using turnrReg3.doc, append
turnrReg3.doc
dir : seeout

.  
. xtreg turnoutR nCorp nIndvTech nIndvBigTech nCorpBigTech nRepRec nIndRec nComRec aTot aCorp aIndvBigTech aIndvTech aCorpTech aRepRec aIndRec meanCFCont meanCFCand meanCFDiff pop popDen gini medIncome travel30t39 travel40t59 travel60t89 tr
> avel90p aggIncomeWhite aggIncomeLatino move2005p move2000t04 medianHomeValue aggRent meanQ1Inc meanQ2Inc meanQ3Inc meanQ4Inc meanQ5Inc mean5pInc age5p age10p age18p age20p age21p age25p age30p age35p age40p age45p age50p age55p age60p age
> 65p age75p age85p year*, fe vce(cluster id)
note: year7 omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =        916
Group variable: id                              Number of groups  =        143

R-sq:                                           Obs per group:
     within  = 0.9062                                         min =          1
     between = 0.0507                                         avg =        6.4
     overall = 0.6465                                         max =          7

                                                F(53,142)         =          .
corr(u_i, Xb)  = -0.3007                        Prob > F          =          .

                                      (Std. Err. adjusted for 143 clusters in id)
---------------------------------------------------------------------------------
                |               Robust
       turnoutR |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
          nCorp |  -2.66e-06   4.18e-06    -0.64   0.526    -.0000109    5.60e-06
      nIndvTech |  -1.41e-06   4.44e-07    -3.18   0.002    -2.29e-06   -5.33e-07
   nIndvBigTech |  -4.73e-06   4.00e-06    -1.18   0.239    -.0000126    3.18e-06
   nCorpBigTech |   .0000101   3.31e-06     3.05   0.003     3.55e-06    .0000166
        nRepRec |   3.87e-06   1.98e-06     1.95   0.053    -5.08e-08    7.79e-06
        nIndRec |  -3.74e-07   2.28e-06    -0.16   0.870    -4.88e-06    4.13e-06
        nComRec |   8.22e-08   1.98e-07     0.41   0.679    -3.10e-07    4.74e-07
           aTot |   5.28e-10   2.49e-10     2.12   0.035     3.64e-11    1.02e-09
          aCorp |  -1.30e-09   5.60e-10    -2.31   0.022    -2.40e-09   -1.88e-10
   aIndvBigTech |  -2.72e-09   2.16e-08    -0.13   0.900    -4.54e-08    4.00e-08
      aIndvTech |  -4.31e-09   5.73e-09    -0.75   0.453    -1.56e-08    7.02e-09
      aCorpTech |   4.28e-08   2.78e-08     1.54   0.126    -1.21e-08    9.76e-08
        aRepRec |  -1.01e-09   1.58e-09    -0.64   0.523    -4.13e-09    2.11e-09
        aIndRec |  -5.95e-10   4.36e-10    -1.36   0.175    -1.46e-09    2.67e-10
     meanCFCont |  -.0586075    .012964    -4.52   0.000     -.084235   -.0329801
     meanCFCand |   .0379839   .0219798     1.73   0.086     -.005466    .0814339
     meanCFDiff |  -.2406347    .146123    -1.65   0.102    -.5294921    .0482228
            pop |   1.02e-06   1.35e-06     0.75   0.452    -1.65e-06    3.68e-06
         popDen |  -4.10e-08   3.32e-08    -1.24   0.219    -1.07e-07    2.46e-08
           gini |   .0210073   .1990135     0.11   0.916    -.3724048    .4144194
      medIncome |   7.17e-07   4.21e-07     1.70   0.091    -1.15e-07    1.55e-06
    travel30t39 |  -1.10e-06   9.50e-07    -1.16   0.248    -2.98e-06    7.75e-07
    travel40t59 |  -1.31e-06   1.05e-06    -1.25   0.212    -3.38e-06    7.58e-07
    travel60t89 |  -2.47e-06   1.43e-06    -1.73   0.086    -5.29e-06    3.55e-07
      travel90p |   3.39e-07   2.34e-06     0.15   0.885    -4.28e-06    4.96e-06
 aggIncomeWhite |   4.86e-12   4.37e-12     1.11   0.267    -3.77e-12    1.35e-11
aggIncomeLatino |   7.69e-12   1.06e-11     0.73   0.468    -1.32e-11    2.86e-11
      move2005p |   .0000202   .0000126     1.61   0.111    -4.66e-06     .000045
    move2000t04 |  -8.02e-06   .0000132    -0.61   0.546    -.0000342    .0000181
medianHomeValue |  -8.34e-09   4.62e-08    -0.18   0.857    -9.97e-08    8.31e-08
        aggRent |   5.29e-10   4.86e-10     1.09   0.278    -4.31e-10    1.49e-09
      meanQ1Inc |  -1.73e-07   1.35e-06    -0.13   0.898    -2.85e-06    2.50e-06
      meanQ2Inc |  -4.00e-07   1.05e-06    -0.38   0.705    -2.48e-06    1.68e-06
      meanQ3Inc |  -1.01e-06   9.35e-07    -1.08   0.283    -2.86e-06    8.41e-07
      meanQ4Inc |   5.24e-07   5.94e-07     0.88   0.379    -6.49e-07    1.70e-06
      meanQ5Inc |  -1.91e-07   3.08e-07    -0.62   0.537    -8.00e-07    4.19e-07
      mean5pInc |   1.15e-07   1.08e-07     1.07   0.287    -9.77e-08    3.27e-07
          age5p |  -2.67e-06   2.12e-06    -1.26   0.211    -6.87e-06    1.53e-06
         age10p |   3.18e-06   2.10e-06     1.51   0.133    -9.74e-07    7.32e-06
         age18p |  -3.61e-06   2.37e-06    -1.52   0.130    -8.30e-06    1.08e-06
         age20p |   9.68e-06   3.54e-06     2.73   0.007     2.68e-06    .0000167
         age21p |  -8.47e-06   3.19e-06    -2.65   0.009    -.0000148   -2.16e-06
         age25p |  -6.30e-07   2.28e-06    -0.28   0.782    -5.13e-06    3.87e-06
         age30p |   2.16e-06   1.90e-06     1.14   0.256    -1.59e-06    5.91e-06
         age35p |  -4.41e-06   1.95e-06    -2.26   0.026    -8.27e-06   -5.44e-07
         age40p |   4.23e-06   1.78e-06     2.38   0.019     7.18e-07    7.74e-06
         age45p |  -1.38e-06   2.44e-06    -0.57   0.572    -6.19e-06    3.44e-06
         age50p |   2.25e-06   2.53e-06     0.89   0.375    -2.75e-06    7.25e-06
         age55p |  -3.22e-06   2.46e-06    -1.31   0.193    -8.08e-06    1.64e-06
         age60p |   1.90e-06   2.78e-06     0.68   0.496    -3.59e-06    7.39e-06
         age65p |   2.33e-06   2.83e-06     0.83   0.411    -3.26e-06    7.92e-06
         age75p |  -6.02e-06   2.99e-06    -2.01   0.046    -.0000119   -1.07e-07
         age85p |   .0000102   4.15e-06     2.45   0.016     1.96e-06    .0000184
          year1 |  -.1101239   .0202156    -5.45   0.000    -.1500863   -.0701614
          year2 |   .1845426   .0193226     9.55   0.000     .1463454    .2227398
          year3 |  -.0188592   .0174737    -1.08   0.282    -.0534014     .015683
          year4 |   .0949899   .0141615     6.71   0.000     .0669954    .1229844
          year5 |  -.2146905   .0104566   -20.53   0.000    -.2353612   -.1940197
          year6 |   .1167049   .0067845    17.20   0.000     .1032932    .1301166
          year7 |          0  (omitted)
          _cons |   .5910784   .1057483     5.59   0.000     .3820341    .8001227
----------------+----------------------------------------------------------------
        sigma_u |  .08429129
        sigma_e |  .04859894
            rho |  .75051361   (fraction of variance due to u_i)
---------------------------------------------------------------------------------

. outreg2 using turnrReg3.doc, append
turnrReg3.doc
dir : seeout

.  
. 
. log close
      name:  <unnamed>
       log:  /Users/mishat/Desktop/Data/JP/stata/DIMETimeSeries.log
  log type:  text
 closed on:   3 May 2020, 17:23:01
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
